{
  "obfuscated_plot": "In the early 1900s, a young man works in the sewers of a European city. He expresses his desire to be a street sweeper to work above ground and light candles at a nearby church. After a meeting with the church's priest, he gets the recommendation he needs for the street sweeping job. Two sisters live together, facing financial difficulties since their parents left them a few years ago. When news arrives that their parents have returned with a fortune, the sisters anticipate a return to comfortable living. However, their father discovers their involvement in prostitution to make ends meet and refuses to accept them back, disowning them instead. One sister, furious at the other for revealing the news, begins to beat her. As she tries to escape, the street sweeper steps in, intervening in the confrontation and rescuing her. After a brief flirtation, the aggressive sister returns with the police intending to arrest the other. Once again, the street sweeper intervenes, asserting that the woman is not a prostitute but his wife. Despite initial skepticism, the police refrain from arresting her due to lack of evidence. Concerned about potential repercussions for lying, he fears losing his job as a street sweeper. To provide an alibi, he suggests the woman move in with him. After ensuring she's not being exploited, she agrees to his proposal. Soon afterwards, the police visit his apartment for further investigation, and their strategy succeeds, absolving them both of suspicion. With no more reason to stay, she prepares to leave, feeling disheartened after having grown fond of him and his apartment. When he offers her to stay, she joyfully accepts, feeling that he is a godsend. As they spend more time together, they quickly fall in love, and decide to marry genuinely. News of a major world war reaching their country arrives, prompting the couple to hold an unofficial wedding in their apartment, with God as their sole witness. He is swiftly recruited, forcing him to depart for the battlefield. Upon his departure, the resentful sister returns, deriding the woman for her marriage and attempting to assault her once more. However, the woman instead triumphs over her sister, expelling her from the apartment, and cites her husband's support for her newfound bravery. As he fights in the war, she finds work at a munitions factory. During a battle, he is gravely wounded and believes he's dying. She is told by a soldier that he has been officially declared dead, leaving her devastated. When the war ends, he returns home, his death having been wrongly recorded, but he is now blind."
}