{
  "obfuscated_plot": "A drunk driver who carelessly kills a man is sentenced to ten years for manslaughter. In an overcrowded prison designed for 1800 and actually holding 3000, he is placed in a cell with two inmates, the leaders of the prisoners. One is alternately menacing and friendly, while the other tries to help out the frightened, inexperienced youngster, but the newcomer rebuffs his overtures. When the menacing inmate is ordered into solitary confinement for sparking a protest over the prison food, he passes along his knife before being searched. It ends up in the newcomer's hands. Meanwhile, the helpful inmate is notified that he is to be paroled. Prior to a search of their cell, the newcomer hides the knife in the helpful inmate's bed. When it is found, the helpful inmate's parole is canceled, and he is put in solitary as well. He vows to make the newcomer pay for what he has done. When the helpful inmate is let out of solitary, he escapes by switching places with a corpse on the way to the morgue. He makes his way to the bookstore run by the newcomer's beautiful sister. She recognizes him. She manages to get his gun and starts to call the police, but then changes her mind and gives him back his pistol. The escaped inmate (who has been attracted to her since he saw the newcomer's photograph) gets a job and becomes better acquainted with her and her family. They all like him, especially his sister. However, he is caught and sent back to prison. When the menacing inmate tells the helpful inmate of his plan for a jailbreak on a holiday, the helpful inmate tells him that he is going straight. In return for a promise of freedom, the newcomer informs the warden of the attempt, though he is not privy to the details. Despite the warning, the inmates succeed in taking over the prison, capturing many of the guards, though they are unable to force their way out. Thwarted, the menacing inmate threatens to shoot the guards one by one unless they are allowed to escape. When the warden stands firm, the menacing inmate shoots the warden's right-hand man in cold blood, then tosses the dying man out for all to see. Military vehicles are called to break down the entrance. The helpful inmate grabs a pistol from the prisoner assigned to watch the guards. He finds the newcomer cowering with the guard but spares him. The newcomer panics and flees before the helpful inmate locks the guards in to save their lives. When the newcomer tries to open the front doors, he is killed in the crossfire. The menacing inmate is told that the helpful inmate was the informant who tipped off the warden and learns he has put the guards out of danger. He sets out to kill his former friend. In the ensuing gunfight, both are wounded, the menacing inmate fatally. Before he dies, he learns that the newcomer was actually the informer, and he and the helpful inmate reconcile. For his efforts, the helpful inmate is given a full pardon. When he exits the prison, his sister rushes to embrace him."
}