{
  "obfuscated_plot": "In a bustling city with multiple daily newspapers, a star reporter and his editor hope to cash in on a big story involving an escaped convicted murderer. The criminal is scheduled to go to the gallows the following morning for a politically charged murder of a police officer. The esteemed reporter is about to quit journalism and is on his way to marry his sweetheart and relocate to another city where an advertising job awaits him. His unscrupulous boss does not want him to quit and wants him to cover the major news story. Although labeled an anarchist, the murderer is likely an innocent man who has been wrongly convicted due to rising political tensions in the city. The editor will do anything to make sure the reporter works on the story — including delaying his wedding trip. Hours before the scheduled execution, while being interviewed by a foreign psychiatrist and reenacting the murder, the criminal manages to escape custody with the help of an inept sheriff's carelessly loaned gun. With the assistance of the reporter and editor, they hide the fleeing criminal in a rolltop desk in a room usually occupied by newspaper reporters gathered to cover the execution. The reporter's soon-to-be mother-in-law sees them hide the criminal in the desk. To silence her, the editor has some of his cronies roughly escort her out of the building. The sheriff and the city mayor receive a message of reprieve for the criminal. However, the execution would be a political advantage for the two men in an upcoming election, so they refuse to accept it. Instead, they send the messenger away with a bribe and an address to a brothel. The mother-in-law eventually returns to the press room, and the criminal is found in the desk. The reporters rush to call bulletins to their editors with exaggerated details about the re-arrest. The reporter and editor are about to be arrested for aiding a fleeing criminal and kidnapping when the messenger reappears. Saying he is happily married and his conscience cannot let him accept the bribe, he tells the reporters about the politicians' refusal to accept the pardon. The politicians quickly agree to drop their charges in exchange for the reporters' silence. Despite offers of a promotion, the reporter says he is retiring to go on his wedding trip. The editor seems to accept this gracefully, even giving the reporter a prized watch as a thank-you gift. However, moments after the reporter and his fiancée depart, the editor arranges for the police to arrest the reporter at the train's first stop on a false pretense."
}