{
  "obfuscated_plot": "A disfigured veteran and permanent resident of a grand hotel in a central European city observes \"People coming, going. Nothing ever happens\" — after which a great deal transpires. A baron who squandered his fortune and supports himself as a card player and occasional jewel thief befriends a dying accountant who has decided to spend his remaining days in the lap of luxury. The accountant's former employer, a stern industrialist, is at the hotel to close an important business deal, and he hires a young stenographer to assist him. She aspires to be an actress and shows him some magazine photos of herself. Another guest is a famous ballerina whose career is on the wane. When the baron is in her room to steal her jewelry and she returns from the theatre, he hides and overhears her contemplating suicide. He comes out of hiding and engages her in conversation. The two fall in love and spend the night together. The following morning, the baron returns her jewels, and she forgives his crime. She invites him to accompany her to another city, an offer he accepts. The baron is desperate for money to pay his way out of a criminal group he has been working with. He and the accountant start a card game, and the accountant wins everything, then becomes intoxicated. When he drops his wallet, the baron stashes it in his pocket, intending to keep not only the winnings but the funds that will see the accountant through the last weeks of his life. However, moved by the sight of the accountant's despair, the baron – who desperately needs the money, but has become very fond of the accountant – pretends to have discovered the wallet and returns it to him. As part of a desperate merger plan, the industrialist must travel abroad, and he asks the stenographer to accompany him. Later, when the two are in her room—which opens onto his—the industrialist sees the shadow of the baron rifling through his belongings. He confronts the baron, who hands his wallet back to him. The two struggle, and the industrialist bludgeons the baron with a telephone, killing him. The stenographer sees what happened and runs to tell the accountant, who confronts the industrialist. He insists he acted in self-defense and asks the accountant to lie, but the accountant summons the police, and the industrialist is arrested. The ballerina departs for the train station, expecting to find the baron waiting for her there. Meanwhile, the accountant offers to take care of the stenographer, who suggests they visit another city together. As they leave the hotel, the veteran again observes \"Grand Hotel. Always the same. People come. People go. Nothing ever happens.\""
}