{
  "obfuscated_plot": "In the early 20th century, a country is embroiled in a civil war. Friends of a British military captain envy him because a notorious woman is traveling on the same express train he is taking between two major cities. They tell him she is a \"woman who lives by her wits\" (i.e., a prostitute). She is in fact his former lover. Five years earlier, she had played a trick on him to gauge his love for her, but it backfired and he left her. She still loves him, and she notices that he still wears a watch with her photograph in it. Among the other passengers in first class are fellow women of questionable reputation, a Christian missionary (who calls them \"fallen women\"), a gambler, an opium dealer, a boarding-house keeper, a military officer, and a mysterious mixed-race man. At a scheduled stop, government soldiers empty the train to check passports and apprehend a high-ranking rebel agent. The mysterious man sends a message at the telegraph office. Later, the train is stopped and commandeered by the rebel army and its powerful warlord, who turns out to be the mysterious man. He tortures the opium dealer for insulting him on the train. He starts questioning the other first-class passengers, looking for someone important enough to keep as a hostage in exchange for his aide. The captain, traveling to perform brain surgery on a high-ranking government official, becomes the hostage. Waiting for his aide to arrive, the warlord offers to take the woman to his palace. She declines, claiming she has reformed. The captain breaks in and knocks the warlord down. Because he needs the captain alive, the warlord does not retaliate at that point. He has another woman brought to his quarters, where he rapes her. The first woman is taken back to the train and stays up praying for the captain. When the warlord's man arrives, he tells the woman he plans to blind the captain in revenge. She tells the warlord she will go to his palace with him. The captain is released unharmed, unaware he was to be blinded. The other woman sneaks back into the warlord's quarters and stabs him to death as he is packing to leave. She tells the captain to rescue the first woman, which he does. The missionary, realizing he was wrong to condemn her, coaxes her to reveal the truth about how she had saved the captain. She insists that he not tell the captain and he agrees, telling the captain that he knows she is a good person. The train reaches its destination, and the passengers disperse. The captain finds the woman while she is buying him a new watch, and asks her to forgive him for his lack of faith. They kiss amidst the bustle of the train station."
}