{
  "obfuscated_plot": "A white American sergeant returns to civilian life after a major war. He has served with distinction, earning a medal for bravery, but his war experience has made him restless. His mother and minister brother feel he should be grateful for a tedious office clerk job. When he announces that he wants to enter the construction industry and improve society as an engineer, his brother reacts with outrage, but his mother regretfully accepts his ambitions. He leaves home to find work, but unskilled labor is plentiful, and it is hard for him to find a job. He sinks slowly into poverty. In a Southern state, he visits a diner with an acquaintance, who forces him at gunpoint to participate in a robbery. The police arrive and shoot and kill his friend. He panics and attempts to flee but is caught immediately. He is tried and sentenced to prison with hard labor. He is quickly exposed to the brutal conditions of life on a chain gang. The work is agonizing, and the guards are cruel and sadistically whip prisoners for poor performance. He makes friends among the gang members, most notably an older murderer and chain gang veteran. The two conspire to stage a breakout. While working on a railroad, he receives assistance from another prisoner who damages his shackles. He slips out of his chains and runs. Armed guards and bloodhounds give chase, but he evades them by changing clothes and hiding at the bottom of a river. He makes it to a nearby town, where he is given money for a train ticket and a room for the night by one of his friends. He makes his way to a large northern city, where he obtains a job as a manual laborer and uses his knowledge of engineering and construction to rise to a position of importance within a construction company. Along the way, he becomes romantically involved with his landlady. He grows to loathe her, but she discovers his secret and blackmails him into an unhappy marriage. Trying to forget his troubles, he attends a high-society party and meets and falls in love with a younger woman. His wife betrays him to the authorities when he asks for a divorce. He describes the inhumane conditions of the chain gangs to the press, becoming national news. Many common citizens express their disgust with the chain gangs and their sympathy for a reformed man, while editorials from the South describe his continued freedom as a violation of \"state's rights.\" The governor of his new state refuses to release him to the custody of the Southern state. Its officials offer him a deal: return voluntarily and receive a pardon after 90 days of easy clerical labor. He accepts, only to find the proposals were a ruse; he is sent to a chain gang, where he languishes for another year after being denied a pardon. Reunited with his friend, he decides to escape once more. The two steal a dump truck loaded with dynamite from a work site. While leaning out of his seat to taunt pursuing guards, his friend gets shot. He takes some of the dynamite, lights it, and throws it at a police car, causing a minor landslide. Shortly afterward, his friend falls from the truck and dies, causing him to stop the vehicle. He then uses more dynamite to blow up a bridge he just crossed, allowing him to make a close escape. He makes his way north again, evading a relentless manhunt. Months later, he visits the younger woman to wish her a permanent goodbye. Tearfully, she asks, \"Can't you tell me where you're going? Will you write? Do you need any money?\" He repeatedly shakes his head as he backs away. Finally, she says, \"But you must. How do you live?\" His face is barely visible in the surrounding gloom as he replies, \"I steal,\" disappearing into the darkness."
}