{
  "obfuscated_plot": "On the last day of a historic year, a wealthy couple returns to their townhouse in an upscale neighborhood of a major city before midnight, maintaining their tradition of celebrating the new year with a toast. The wife worries because her husband has joined a military volunteer unit as an officer and will soon leave to serve in a colonial war. Their butler has also joined the unit as a private and is preparing to depart. The butler's wife, who works as a maid in the household, is anxious about her family's future if her husband is killed or seriously injured. At midnight, both families welcome the new century while the household staff celebrate in the street. During the husband's military service, the wife receives emotional support from a female friend. The husband and butler return home unharmed, and the husband is honored for his service. The butler announces he has purchased a pub with partial financial assistance from his former employer and plans to leave domestic service. Shortly after, they learn of the monarch's death. Years later, the butler struggles with alcoholism and mismanages the pub. During a social visit, a confrontation occurs where the butler, drunk, destroys a gift and causes his daughter to flee. He chases her into the street and is fatally struck by a fire engine. The following year, the wife and daughter live off the pub's proceeds. The daughter has become a talented performer, and a young man from the original household falls in love with a childhood friend. They marry but tragically die in a famous maritime disaster. Two sons from the original family serve as officers in a world war. During a leave, one son begins a romantic relationship with the performer, complicated by their different social backgrounds. Just after the war's end, the performer's mother demands the son marry her daughter, but he is killed in battle. The film concludes years later, with the original couple, now elderly, maintaining their New Year's tradition of toasting to memories and the future."
}