{
  "obfuscated_plot": "In an ancient time, a young queen vies with her brother for control of a desert kingdom. A scheming advisor kidnaps her and her loyal servant and strands them in the desert. When the advisor informs a powerful military leader that the queen has fled the country, the leader is ready to sign an agreement with the brother when the servant appears, bearing a gift carpet. When the servant unrolls it, the queen emerges, much to the advisor's surprise. He tries to deny who she is. The military leader sees through the deception, and the queen soon beguiles him with the prospect of the riches of her kingdom. Later, when they are seemingly alone, she spots a hidden assassin and thrusts a spear into him, foiling the assassination attempt. The military leader makes the queen the sole ruler of her kingdom and begins an affair with her. He eventually returns to his homeland with the queen to the cheers of the masses, but his countrymen become uneasy. Powerful politicians become disgruntled, suspecting he intends to abolish their republic and make himself emperor, with the queen as his empress. Ignoring warnings, the military leader goes to announce his intentions to the ruling council. Before he can do so, he is assassinated. The queen is heartbroken at the news. Her servant tells her that the leader did not truly love her, only her power and wealth, and that her kingdom needs her. They return home. Bitter rivals are named co-rulers of the homeland. One of them, disdainful of women, invites the queen to meet him, intending to bring her back as a captive. His close friend warns him against meeting her, but he goes anyway. She entices him to her ship and throws a lavish party, soon seducing him. Together, they sail to her kingdom. A neighboring king, secretly allied with the other ruler, visits the lovers. He suggests poisoning one of them to appease the rival ruler. A reluctant queen tests a poison on a condemned criminal. Before they can act, they receive news of an impending war. The lover orders his generals to gather, but they have deserted out of loyalty to their homeland. A battle sequence shows the conflict, ending in a decisive naval engagement. The lover fights on with the queen's army but is defeated. The rival ruler surrounds them. The lover is mocked when he offers to fight them individually. Without his knowledge, the queen offers to surrender her kingdom in exchange for his life in exile, but is refused. Believing she has betrayed him, the lover stabs himself. When the queen returns, they reconcile before he dies. With her kingdom fallen, the queen kills herself with a venomous creature and is found dead on her throne."
}