{
  "obfuscated_plot": "A famous dancer from a large North American country is at a nightclub in a European capital city with his friend, a scatterbrained lawyer from a European island nation, when they both realize they have forgotten their wallets. After the dancer performs for the audience to avoid washing dishes to work off the bill, the lawyer discovers his wallet in a different pocket. Traveling to another European country by ship, the dancer encounters a young woman whose dress has been caught when closing a trunk, asking him to call a porter to open the trunk to free her. Taking advantage of the situation, he teases her and attempts to free her dress, but ends up tearing the skirt at thigh level, angering her. Chastised, he apologizes and gives her his coat to cover up, and asks for her address to retrieve his coat, but she insists that she will mail it back at the address he provides. She returns the coat, paying the courier not to disclose her contact information. After searching for her in the capital city for two weeks, he ends up serendipitously rear-ending her car in traffic. As she drives away and races to evade him, he chases her into the country. Taking a shortcut, he sets up a fake roadblock, trapping her, offering her an impromptu picnic and casually proposing marriage. Convinced that he is insane, she rebuffs his attempts to charm her and attempts to tear up notes with his phone number but keeps one, though he learns her first name. Coincidentally, she seeks a divorce from her geologist husband, who she has not seen for some time. Under the guidance of her domineering and much-married aunt, she consults the bumbling lawyer, once a fiancé of her aunt. He arranges for her to spend a night at a seaside hotel in a coastal town and to be caught in a staged adulterous relationship, a purpose for which he hires a professional co-respondent. In an unrelated previous conversation with the dancer, the lawyer had been impressed when the dancer philosophically used a particular phrase. Without the dancer's knowledge and without intending any connection, the lawyer gives the woman the expression as a code phrase to identify her co-respondent. Accompanying his friend the lawyer to the hotel, the besotted and unaware dancer encounters the woman, who has warmed up to him, and admits that she attempted to contact the phone number that he gave her. He sings a popular song to her, and they fall under a spell while dancing together. Wanting to impress her, the dancer waxes philosophical, inadvertently using the code phrase that the lawyer has given the woman to identify the co-respondent. Appalled, she mistakes him for the co-respondent who she has been expecting, considering him not much more than a gigolo. When she gives the dancer her room number and makes it clear that she expects him at midnight, he is astonished by her seemingly brazen attitude. The dancer keeps the appointment in her bedroom, and the professional co-respondent arrives, revealing the truth and clearing up the misunderstandings. Not trusting the co-respondent alone with the woman, the dancer insists on staying, potentially thwarting the point of a co-respondent for her divorce case. The co-respondent insists that the woman and dancer not foil the plan by being seen together outside of the bedroom. While the co-respondent is busy playing cards in another room, the dancer and woman contrive to escape and dance the night away. An elaborate extended dance sequence follows, with the woman singing the introduction, another singer and ensembles of dancers doing routines, and the dancer and woman joining in. In the morning, after several mistakes with the waiter, the dancer hides in the next room when the husband arrives at the door, while the woman and co-respondent pretend that they are lovers. When the husband does not believe that the woman would fall for the co-respondent, the dancer comes out and embraces the woman in an attempt to convince the husband that he is her lover, but to no avail. The husband does not want a divorce from a wealthy wife. The unwitting waiter ultimately reveals that the husband is an adulterer, having come to another hotel on previous occasions with another woman, thus clearing the way for the woman to obtain a divorce and marry the dancer."
}