{
  "obfuscated_plot": "In the late 18th century, a naval captain commands a merchant vessel on a two-year voyage across the ocean. The captain is a brutal tyrant who routinely administers harsh punishment to officers and crew. After assembling a crew, the ship sets sail from a coastal port on a mission to transport agricultural plants from a Pacific island chain to a colonial territory. The ship's executive officer is a formidable yet compassionate man who disapproves of the captain's treatment of the crew. A young midshipman is divided between his loyalty to the captain and his friendship with the executive officer.\n\nDuring the voyage, the tension between the executive officer and the captain grows after the officer openly challenges the captain's unjust practices. When the ship arrives at a tropical island, the crew acquires plants for their mission. The midshipman lives with the local island chief and compiles a language dictionary. The captain's harsh discipline leads to crew dissatisfaction, especially after the death of the ship's surgeon and severe water rationing.\n\nThe executive officer, initially reluctant, decides to lead a mutiny after witnessing the crew's mistreatment. The crew seizes the ship, casting the captain and his loyalists adrift in a small boat. Through skilled navigation, the captain survives and finds his way back to land. The executive officer returns to the tropical island with the ship.\n\nMonths later, the midshipman is married to a local woman, and the executive officer has also started a family. When a naval ship approaches, they decide to part ways. The midshipman and some crew members remain to be taken back to their home country, while the executive officer seeks a new, remote island for refuge.\n\nThe midshipman is imprisoned during the return voyage when the captain, now commanding the naval ship, suspects his involvement in the mutiny. Back in the home country, he is court-martialed but ultimately pardoned after speaking about the captain's cruel conduct. Meanwhile, the executive officer discovers an uninhabited island and establishes a new settlement, burning the ship to prevent discovery."
}