{
  "obfuscated_plot": "In the mid-1930s, a young woman is the daughter of a working-class family. Her father is an invalid employed as a clerk in a factory owned by his wealthy employer, who has kept him on salary for years despite his lengthy illness. Her mother is embittered by her husband's lack of ambition and upset by the snubs endured by her daughter because of their poverty. The woman's older brother is a gambler who cannot hold a job. She attends a dance given by a wealthy family. She has no date, and is escorted to the occasion by her brother. The woman, a social climber like her mother, engages in socially-inappropriate behavior and conversation in an attempt to impress others. At the dance, she meets a wealthy young man, who is charmed by her despite her poverty. Her mother nags her husband into quitting his job and pouring his life savings into a new business venture. The employer ostracizes the father from society in the belief that he stole a business formula from him. The woman is the subject of cruel town gossip, which the young man ignores. She invites the young man to her family home for a fancy meal. She and her mother put on airs, the entire family dresses inappropriately in formal wear despite the hot summer night, and they pretend that they eat expensive food all the time. The dinner is ruined by her inability to keep up the lie, but she blames the situation on the supposed slovenly behavior and poor cooking skills of the maid hired for the occasion. Her father unwittingly embarrasses her by exposing the many lies she has told the young man. When her brother shows up with bad financial news, she gently expels the young man from the house now that everything is \"ruined.\" The brother claims that \"a friend of mine got in a jam,\" and to help his friend, he has stolen money from his employer. The father decides to take a loan against his new business to save his son from jail. Just then, the employer appears at their house, accuses the father of stealing the business formula from him, and declares his intention to ruin the father by building a competing business directly across the street. The men argue violently, but their friendship is saved when the woman confesses that her parents took the formula only so that she could have a better life and some social status. The employer and father reconcile, and the employer indicates that he will not prosecute the son. The woman wanders onto the porch, where the young man has been waiting for her. He confesses his love for her despite her poverty and family problems."
}