{
  "obfuscated_plot": "In the late 18th century, a young woman is the new bride of a middle-aged nobleman. The consummation of their marriage is postponed until he is cured of gout at a famous spa. Meanwhile, her true love follows them and stays near their estate. While the nobleman is away taking the cure, they meet in the woods, and after three months she tells him she is carrying his child. The nobleman returns home, cured, and the woman is horrified at what awaits her. The lovers plan to flee that night, but the nobleman discovers her waiting for her lover. He takes her away, but her lover pursues them to an inn, where the nobleman kills him in a sword duel. Months later, the woman dies giving birth to her son at a chalet in a mountainous region. The nobleman leaves the infant in the foundling wheel of a convent. The nuns christen him because he was found on a religious feast day. The nobleman lies to the woman's father, a wealthy merchant, telling him that the infant also died. Ten years later, by chance, the boy is apprenticed to the merchant, who discovers his relationship to the boy but keeps it a secret. The merchant gives the boy a surname acknowledging his difficult start in life. The boy and the cook's daughter fall in love. The girl wants to become a great singer. The boy wants to serve the merchant and marry the girl, but the girl's father wins the lottery and the family leaves town. Years later, the boy finds her, singing in the opera chorus. Eventually, they wed. Soon after the ceremony, the merchant sends the boy to a distant colony to save his fortune from a laggard debtor. On the day his ship sails, he and his wife are supposed to meet at the convent, but she arrives first, and he is late. Unable to wait any longer, she leaves a note outside the convent to inform him that she is leaving with her opera company, but the note is blown away. Confused and upset, he sails without her. Meanwhile, assuming he has abandoned her, she continues her career. He leaves to take control of the trading company's only remaining asset—a slave trading post in Africa, to recover the merchant's debt. Three years in the slave trade corrupts him, and he takes a slave girl into his bed. After his friend is killed by natives, he returns to find the merchant has died. His housekeeper, the nobleman's longtime co-conspirator and now wife, has inherited the merchant's fortune. He goes to a large city to claim his inheritance and is reunited with his friend, a banker. He saves the banker from bankruptcy by loaning his entire fortune, having learned from his friend that \"There's something besides money and power\". Meanwhile, the city is buzzing with gossip about a famous opera star and a prominent political figure. An impresario reunites him with his wife, who bore him a son. A delighted wife tells him that she is singing at the opera, and he goes with the banker. Searching the program in vain for her name, he hears her voice coming from the stage. He exclaims, \"That's my wife!\" and the banker replies, \"That's the famous opera star!\" She continues the aria and emerges from the shadows, descending a staircase. Wearing a famous gift, she whispers \"Goodbye\" as he stands and leaves the box. Shaken, he returns home to find his son, with a letter from his wife saying that he is better suited to raise the boy. He and the boy sail for a new continent hoping for a better life."
}