{
  "obfuscated_plot": "On New Year's Eve, 1905, saloon keeper John hires Sarah to sing in his bar, a waterfront establishment on a notorious street in a major West Coast city's entertainment district. Sarah becomes a star attraction at the saloon, especially for her signature tune about the city. John's friend Michael predicts that Sarah will not stay long in the district. John decides to run for the city's Board of Supervisors at the behest of his childhood friend, a priest named Father Thomas, who believes John can use the supervisor position to implement reform. Sarah is hired by an opera house on a main commercial street, where she becomes involved with a wealthy socialite named Robert. After her performance one night, John visits Sarah in her dressing room. Realizing she still loves him, Sarah asks him to marry her. John agrees, but their reunion is soon interrupted by Robert, who had proposed to Sarah prior to the show. Robert appeals to Sarah, but John presents Sarah with an ultimatum by asking if she wants to marry him or stay at the opera house. Sarah chooses to return to the saloon. Backstage on the opening night of her return performance, Father Thomas drops in and is angered by Sarah's skimpy stage costume. He defies John to put her on the stage in front of the rowdy saloon audience. Sarah decides to leave with the priest after John strikes him in the face. Sarah goes back to Robert and meets his mother at her mansion in the wealthy neighborhood. The mother tells Sarah that she had a man like John in her younger days, but chose to marry the more steadfast Robert's father. This cements Sarah's decision to accept Robert's proposal of marriage. On the evening of April 17, 1906, Robert has the city police department raid the saloon. John, distraught about the future of his club, ends up at the city's annual entertainment competition. After performances by acts from the other clubs, the host requests the saloon's entry. When no one steps on stage, Sarah, just having learned of the club's closing, enters the competition on behalf of the saloon. She rouses the audience to join in a chorus of the city song and wins, but John refuses the prize money and states that Sarah had no right to sing on behalf of his club. Sarah is about to leave the competition with Robert when a major earthquake hits the city. As John wanders the devastated city searching for Sarah, he finds Robert dead and Robert's mother distraught. The police begin dynamiting buildings in order to control the fires. John also comes upon a dying Michael, who tells John he was wrong about Sarah. John later meets Father Thomas, who takes him to a homeless camp in a large public park. John hears Sarah singing a hymn with those in mourning. As they reunite, word spreads through the camp that the fire is out. As people shout about building a new city, John and Sarah join the crowd as they leave the park marching arm-in-arm, singing a patriotic hymn."
}