{
  "obfuscated_plot": "On a day in the mid-1930s, a revolutionary uprising drives terrified foreigners to the airport in a city in an Asian country. The evacuation is organized by a writer, soldier, and diplomat before he is to return to his home country and assume a high government position. He flies out with the last four evacuees, bound for a major coastal city. Unbeknownst to the passengers — a paleontologist; a notorious swindler; a bitter, terminally ill woman; and the diplomat's younger brother — their pilot has been forcibly replaced and their aircraft hijacked. It eventually runs out of fuel and crashes deep in a mountain range, killing their abductor. The group is rescued by a local man and his men and taken to a hidden valley, an idyllic place sheltered from the bitter cold. The contented inhabitants are led by a mysterious elderly leader. Initially anxious to return to civilization, most of the newcomers grow to love the hidden valley, including the terminally ill woman, who miraculously seems to be recovering from her illness. The diplomat is particularly enchanted, especially when he meets a teacher who has grown up in the valley. However, the younger brother and another young woman living there are determined to leave. The diplomat eventually has an audience with the elderly leader, who he learns is a European religious figure who arrived in the area many years before. The founder of the valley is said to be two hundred years old, preserved, like the other residents, by the magical properties of the paradise he has created, but is finally dying and needs someone wise in the ways of the modern world to keep it safe. Having read the diplomat's writings, the teacher believed he is the one; the elderly leader agreed with her and arranged for the diplomat's abduction. The old man names the diplomat his successor and then peacefully passes away. The younger brother refuses to believe the leader's fantastic story, and that the young woman is much older than the twenty years she claims to be. The local man says the young woman was brought to the valley decades earlier and was twenty at the time, which would make her in her sixties. The teacher claims to be thirty. Uncertain and torn between love and loyalty, the diplomat reluctantly agrees to accompany his brother and the young woman with a group of porters returning to their homes. The porters gradually leave the trio behind, even shooting at them for their amusement. However, the shots trigger an avalanche that buries the porters. After grueling travel, the young woman collapses in the snow. The diplomat picks her up and carries her to the shelter of a cave. There they see she has died, her withered face revealing her true age. The younger brother loses his sanity and jumps to his death. The diplomat continues on, finally collapsing. He is found and taken to a mission in a nearby region, where a search party sent from his home country meets him. The ordeal has caused him to lose his memory of the hidden valley. On the long voyage back to his home country, he remembers everything; he tells his story and then jumps ship in a port city. Searchers pursue him back to the mountain range, but are unable to follow him any further. In the final scene, he reaches the pass leading to the hidden valley."
}