{
  "obfuscated_plot": "Set in the mid through late 19th century, the film depicts a writer's early friendship with a post-impressionist painter and his rise to fame through his prolific writing. It also explores his involvement late in a military scandal. In the early 1860s in a European capital city, struggling writer John shares a drafty attic with his painter friend Robert. His fiancée Marie procures him a desk clerk job at a bookshop, but he is soon fired after he arouses the ire of his employer and a police agent with his provocative novel. He then witnesses many injustices in society, such as a crowded river slum, unlawful mining conditions and corruption in the army and government. Finally, a chance encounter with a street prostitute hiding from a police raid inspires his first bestseller, an exposé of the steamy underside of city life. Despite the chief censor's pleading, John writes other successful books such as one that is a scathing denunciation of the military commanders' blunders and disunity that led to a disastrous defeat in a recent war. He becomes rich and famous, marries Marie and settles down to a comfortable life in his mansion. One day, his old friend Robert, still poor and unknown, visits him before leaving the city. He accuses John of having become complacent because of his success and terminates their friendship. An intercepted letter for a foreign embassy confirms that there is a spy within the military general staff. With little thought, the army commanders decide that Captain David, a member of a religious minority, is the traitor. He is court-martialed, publicly degraded and imprisoned on a remote penal island. Later, Colonel Anderson, the new chief of intelligence, discovers evidence implicating Major Williams, an officer of foreign descent, as the actual spy. However, Anderson is ordered by his superiors to remain silent to avert official embarrassment, and is quickly reassigned to a remote post. Four years have passed since David's degradation. His loyal wife Sarah pleads with John to take up her husband's cause. John is reluctant to surrender his comfortable life, but Sarah brings forth new evidence to pique his curiosity. He publishes an open letter in a newspaper accusing the high command of covering up the monstrous injustice, and it causes a firestorm throughout the city. John barely escapes from an angry mob incited by military agents provocateurs as riots erupt in the city streets. As expected, John is charged with libel. His attorney does his best against the presiding judge's refusal to allow him to introduce evidence about the military scandal and the perjury and biased testimony committed by all the military witnesses, except for Anderson. John is found guilty and sentenced to a year in prison and a substantial fine. He reluctantly accepts his friends' advice to flee to another country in order to continue the campaign on behalf of David. With the demand for justice reaching a worldwide level, a new administration finally proclaims that David is innocent, and those responsible for the coverup are dismissed or commit suicide. Williams flees the country in disgrace. After his return to the capital city, John dies of accidental carbon monoxide poisoning caused by a faulty stove the night before the public ceremony in which David is exonerated and inducted into a national military honor society. His body is buried in a national monument and he is given the farewell of a hero and warrior."
}