{
  "obfuscated_plot": "A man tells his wife he is going on vacation to a southern state but instead disappears for two weeks without telling anyone where he is really going. He returns home, with a sunlamp tan, to find that his wife spent the night in the company of her handsome music teacher. The wife claims his car broke down unexpectedly, but the husband refuses to believe her assurances that nothing untrustworthy happened. Upon seeing the fruit in the basket the husband brought home stamped with a different state name, however, the wife discovers that he did not actually go where he claimed. Their mutual suspicion results in divorce proceedings, with custody of their dog in dispute. When the judge pronounces that he will grant custody to whomever the dog responds to when called, the wife wins custody with a concealed dog toy in her hand. The judge grants the husband visiting rights to the dog and orders the divorce finalized in ninety days. The wife moves into an apartment with her aunt. Her neighbor is an amiable but rustic oilman from a western state, whose mother does not approve of the wife. On a visitation to the dog, the husband subtly ridicules the oilman in front of the wife, which causes the wife defiantly to cling closely to the oilman. The husband begins dating a sweet-natured but simple singer, unaware that she performs a vulgar act at a local nightclub where a wind machine blows her skirt up. When the wife and the oilman turn up at the nightclub and see the act, the husband is embarrassed, and the wife makes witticisms as payback for the husband's ridicule of the oilman. Convinced that the wife is still having an affair with the music teacher, the husband bursts into the teacher's apartment only to discover that the wife is a legitimate vocal student and is giving her first recital in front of an audience. When the wife announces her engagement to the oilman, realizing he may still love her, the husband undermines the wife's character with the oilman's mother, implying the wife's infidelity as the cause of their divorce. On a subsequent visit to the dog, the husband arrives as the music teacher is paying an unexpected visit to the wife. Alarmed that the husband will think the teacher is there at her request, the wife asks the teacher to hide in her bedroom while the husband plays with the dog. During a game of hide-and-seek, the dog reveals the teacher's forgotten hat where the wife hid it just before the husband entered the room. Meanwhile, the oilman and his mother arrive; the husband sarcastically states that he never had any doubt about the wife's fidelity, while the oilman and his mother apologize for assuming the worst about her. The husband discovers the teacher hiding in the wife's bedroom and they end up in a fistfight. When the husband chases the teacher out the door, the oilman's mother assumes the worst is true, and the oilman breaks off his engagement to the wife; he and his mother return to their home state. A few weeks later, the husband begins dating a high-profile heiress, whose romance is covered in the society column. Realizing she still loves the husband, the wife crashes a party at the heiress's mansion the night the divorce decree is to become final. Pretending to be the husband's sister, she undermines the husband's character, implying that their father was working class rather than wealthy. Acting like a showgirl, she recreates the singer's risqué musical number. The snobbish family is appalled. The husband attempts to explain away the wife's behavior as drunkenness, and says he will drive her home. The wife repeatedly sabotages the car on the ride to delay their parting. Pulled over by motorcycle police officers, who believe the husband is drunk, the wife manages to wreck the car. The police give the couple a lift to the aunt's nearby cabin. Although sleeping in different but adjoining bedrooms, the husband and wife slowly overcome their pride and a series of comic mishaps in order to admit the truth that they still love one another. They reconcile at midnight, just before their divorce is to be finalized."
}