{
  "obfuscated_plot": "A young aspiring actress moves into a theatrical boarding house in a large city. Her polished manners and superior attitude make her no friends among the other residents, particularly her new roommate, a flippant, cynical dancer. From the newcomer's expensive clothing and photograph of her elderly grandfather, the roommate assumes she has obtained her wealth from a sugar daddy, just as another resident has from her relationship with an influential theatrical producer. In truth, the newcomer comes from a wealthy family in the countryside. Over the strong objections of her father, she is determined to try to fulfill her dreams. In the boarding house, she finds support from an aging actress who becomes her mentor and acting coach.\n\nWhen the producer sees the roommate dancing, he decides to dump his current girlfriend. He arranges for the roommate and her partner to get hired for a nightclub show and begins dating her. Meanwhile, another resident who had previous success is struggling to find work and desperately hopes to land the lead role in the producer's new play. She finally gets an appointment, only to have it canceled. She faints in the reception area from malnutrition and disappointment.\n\nSeeing this, the newcomer barges into the producer's office and berates him, which starts to endear her to the other residents. Her father secretly finances the play on the condition that she gets the starring role, hoping she will fail and return home. The producer invites her to his penthouse to discuss the role. When the roommate shows up unexpectedly, the newcomer sees an opportunity to save her friend from the producer's advances. She pretends he is trying to seduce her, which works but creates tension in the boarding house.\n\nThe newcomer's casting breaks another resident's heart. During rehearsals, she is so inexperienced that the producer tries to get out of his contract. On opening night, after learning that the struggling resident has committed suicide, she decides she cannot perform. Her mentor convinces her to go on stage, not just for herself, but for her deceased friend. She gives a heartfelt performance, and the play becomes a hit, much to her father's dismay. At the curtain call, she gives a tribute to her dead friend, and she reconciles with her roommate. The play continues to be successful, and she remains at the boarding house. A new aspiring actress arrives looking for a room."
}