{
  "obfuscated_plot": "In the slums of a large city, near a river below a prominent bridge, wealthy people live in opulent apartments with picturesque views, while the destitute live nearby in crowded, cockroach-infested tenements. At the end of the street is a dock; to the left are luxury apartments, and to the right are the slums. A gang of street urchins, led by a young boy, are already well on the path to a life of petty crime. The gang members include various youths, with a new kid joining their group. Initially bullied, the newcomer eventually becomes a loyal friend. The leader's sister dreams of marrying a rich stranger to escape poverty and prevent her brother from becoming a criminal like a notorious mobster who has returned to the neighborhood.\n\nA local man, a frustrated architect working odd jobs, recognizes the mobster and warns him to stay away. He is having an affair with a rich man's mistress, though they know they cannot be together due to financial constraints. The kids lure a wealthy boy into a cellar, beating and robbing him. When the boy's father, a judge, tries to intervene, the gang leader stabs him and goes into hiding.\n\nThe mobster is rejected by his mother and ex-girlfriend, who is now a prostitute. Despondent, he decides to kidnap the rich child for ransom. The local man witnesses the kidnapping plot and tries to stop it, resulting in a violent confrontation. After a chase across rooftops, the local man mortally wounds the mobster in a shootout.\n\nAs police gather, a witness identifies one of the gang members. The boy exonerates himself by revealing the gang leader's involvement. The mobster's mistress offers the local man money to run away together, but he refuses. The gang leader attempts to punish a member who betrayed him, but the local man intervenes and convinces him to surrender to the police.\n\nThe local man offers to use his reward money to pay for the gang leader's defense. As they leave with a police officer, the remaining gang members wander off into the night, singing a melancholic song about freedom."
}