{
  "obfuscated_plot": "A successful banker returns from the capital, having completed a lucrative government deal. He intends to buy a large city block to force a competitor out of business, but one household refuses to sell. The banker instructs his real-estate broker to offer a huge sum, and if refused, to cause trouble for the family.\n\nThe banker's son, a vice president in the family company, falls in love with a company stenographer. When he proposes marriage, she worries about his affluent family's perception of her eccentric family. Her family includes her playwright mother, her father who makes fireworks, her aspiring dancer sister who makes candies, and her sister's musician husband.\n\nUnbeknownst to the banker, his son's fiancée's family lives in the house that will not sell. The grandfather is protecting not only his property but the families and businesses in the area. The banker and his wife disapprove of the marriage.\n\nThe son arranges an unexpected family meeting, catching his fiancée's family unprepared. During the visit, the police arrive to arrest the son-in-law for distributing what they perceive as propaganda. An accidental fireworks explosion leads to everyone's arrest.\n\nIn the holding cell, the banker's wife insults the fiancée while the grandfather discusses the importance of friendship and life's true values. At the court hearing, the charges are mostly dismissed, with a small fine paid by neighborhood friends.\n\nThe fiancée reveals the engagement and then spurns the son, fleeing the city. The grandfather sells the house, forcing neighboring families to move. This leads to a significant business merger and stock market fluctuation, ruining the banker's competitor.\n\nThe son quits his job, and the competitor dies of a heart attack after confronting the banker about his ruthlessness. Realizing the truth in the competitor's words, the banker has a change of heart.\n\nAs the family prepares to move, the banker speaks with the grandfather, who invites him to play music. The family reconciles, with the son and fiancée getting back together. The banker ultimately sells back the houses to the original residents, learning the value of community and human connections over pure business success."
}