{
  "obfuscated_plot": "In the mid-19th century in a Southern city, a spoiled, strong-willed young woman is engaged to a wealthy banker. In retaliation for her fiancé refusing to leave an important business meeting to accompany her to the last fitting of her ball gown, she buys a brazen red satin dress. The annual social ball is the most important event of the year, and unmarried women are expected to wear virginal white. All of her friends are shocked by her choice of red, but no one can dissuade her from wearing it. At the ball, her attire is met with shock and disgust by all. She begs her fiancé to take her away, but instead he forces her to dance with him while the other couples abandon the floor. Her fiancé later leaves her, implicitly breaking their engagement. In a final act of spite, she slaps him in the face. He later goes north on business, and she secludes herself at home. A year later, he returns, and she comes back to life. She plans a celebratory homecoming party in his honor and prepares to humble herself before him. What she does not know is that he is accompanied by his new wife. Stung, she prods her longtime admirer, a skilled duelist, to quarrel with her ex-fiancé. The scheme goes awry as her ex-fiancé's younger brother is goaded into challenging the duelist. She tries to get the duelist to skip the duel, but to no avail. To everyone's surprise, it is the duelist who is killed. In the meantime, a deadly epidemic breaks out in the city. The people fight it with cannon and smoke. They believe the disease is highly contagious, and a rigid quarantine mandates that those trying to escape the city be shot. Her ex-fiancé is stricken and is ordered to be sent to a remote medical colony. She sneaks into the city to nurse him. Later, his family arrives, having been granted a pass to enter the city. When the medical wagon comes to pick him up, his wife begs to accompany him, but she tells her that she is too unfamiliar with local culture to be able to deal with the desperate conditions and people there. She begs to go in her place to try to redeem herself. Before agreeing, the wife asks if her ex-fiancé still loves her. She declares that he loves only his wife. The wife blesses them, and she accompanies her ex-fiancé on a wagon loaded with other victims and caregivers."
}