{
  "obfuscated_plot": "A convicted murderer asks to make his confession on the day of his execution. He is visited by an old priest friend who runs a home for indigent men in a midwestern city. When the prison officials suggest that the condemned man owes the state a debt, the priest witnesses the condemned man's diatribe to prison officials and a reporter that describes his awful plight as a homeless and friendless boy who was a ward in state institutions. After the convicted man asks the officials to leave, the priest provides some comfort and wisdom. On the train back home, the priest is transformed in his humanitarian mission by revelations imparted by the condemned man's litany of hardships suffered as a child, without friends or family, and a ward of the state. The priest believes there is no such thing as a bad boy and spends his life attempting to prove it. He battles indifference, the legal system, and often even the boys, to build a sanctuary. The boys have their own government, make their own rules, and dish out their own punishment. One boy is as much as anyone can handle. The boy's elder brother, in prison for murder, asks the priest to take his troublesome younger brother—a poolroom shark and tough-talking hoodlum—to the sanctuary. The elder brother escapes custody during transfer to federal prison. The younger boy stays, though, and runs for mayor of the sanctuary, determined to win with his \"don't be a sucker\" campaign slogan. Winning the election for mayor is a disabled boy. The troublemaker has an outburst after finding out the results. This nearly causes a fist fight between him and the outgoing mayor. Since his arrival at the sanctuary, he and the outgoing mayor do not get along well. To settle their differences once and for all, a boxing match is held. The outgoing mayor defeats the troublemaker with the priest and all of the boys watching. The troublemaker leaves the sanctuary after being defeated in the boxing match. The sanctuary's mascot catches up with him and pleads for friendship. The troublemaker, nearly in tears, refuses and pushes the child to the ground. He storms across the highway as the mascot, crying and wandering blindly in the road, is suddenly hit by a car. The troublemaker leaves, feeling guilty and hurt. During an aimless walk downtown, he runs into his brother, who mistakenly shoots him in the leg. The brother takes him to a church and calls the priest anonymously, after which he is taken back to the sanctuary. The local sheriff comes to get the troublemaker, but the priest offers to take full responsibility for the boy. The boy refuses to tell the priest about the robbery, because he has promised his brother not to inform on him. But when he realizes that his silence could result in the end of the sanctuary, he goes to his brother's hideout. The brother, realizing the sanctuary is more important than they are, releases his brother from his promise. The brother protects him until the priest and some boys arrive at their hideout. The criminals are recaptured and the sanctuary's reward is a flood of donations. The troublemaker is elected the new mayor of the sanctuary by acclamation and the administrator resigns himself to go into more debt as the priest tells him of his new ideas for expanding the facility."
}