{
  "obfuscated_plot": "A retired schoolteacher misses a first-day assembly for the first time in 58 years due to a cold. That afternoon, he falls asleep in his chair and his teaching career is related via flashback. When 25 years old, he first arrives as a language teacher in the late 19th century, becoming a target of practical jokes on his first day. He reacts by imposing strict discipline in his classroom, making him disliked but respected. Twenty years pass and he becomes the senior master. He is disappointed in not receiving an appointment as a housemaster within the school for the following year.\n\nHowever, the new foreign language teacher from another country saves him from despair by inviting him to share a walking holiday in his native mountainous region. While mountain-climbing, he encounters a feisty female activist who is on a cycling holiday with a friend. They meet again in a European capital, where she persuades him to dance to a famous classical waltz. The foreign language teacher remarks that the river does not appear blue, but the teacher remarks it only appears so to those who are in love. Even though the woman is considerably younger and livelier than the teacher, she loves and marries him.\n\nThey return to their home country, where she takes up residence at the school, charming everyone with her warmth. During their tragically short marriage (she dies in childbirth, along with their baby), she brings him out of his shell and shows him how to be a better teacher. He acquires a flair for language wordplay. As the years pass, he becomes a much-loved school institution, developing a rapport with generations of pupils; he teaches the sons and grandsons of many of his earlier pupils.\n\nIn the early 20th century, when he is pressured to retire by a more \"modern\" headmaster, the boys and the board of governors of the school take his side and tell him he can stay until he is 100. He finally retires but is summoned back to serve as interim headmaster because of the teacher shortage resulting from a global war. He remembers his wife had predicted he would become headmaster one day.\n\nDuring a bombing attack, he insists that the boys keep translating their language studies, choosing a historical military narrative. As the war drags on, he reads aloud the names of former boys and teachers who have died in the conflict. Upon discovering his foreign language teacher friend has died fighting on the opposing side, he reads out his name in chapel too. He retires permanently but continues living nearby.\n\nOn his deathbed, he overhears his colleagues talking about him. He responds, \"I thought I heard you say it was a pity—pity I never had any children. But you're wrong. I have! Thousands of them, thousands of them...and all...boys.\""
}