{
  "obfuscated_plot": "A traveler named John is caught in the snow and stays at the estate of a remote manor, despite the cold behavior of his host Thomas. Late that night, after being shown into an upstairs room that was once a bridal chamber, John is awakened by a cold draft and finds the window shutter flapping back and forth. Just as he is about to close it, he feels an icy hand clutching his and hears a woman outside calling, \"Thomas, let me in! I'm lost in the countryside. It's Sarah!\" John calls Thomas and tells him what he saw, whereupon the enraged Thomas throws him out of the room. Once John is gone, Thomas frantically calls out to Sarah and runs down the stairs and into the snowstorm. Mary, the housekeeper, tells the amazed John that he has seen the ghost of Sarah, Thomas's only great love, who died years ago. When John says that he doesn't believe in ghosts, Mary tells him that he might if she told him the story of Sarah, and he asks her to do so, intrigued.\n\nAs a boy, Thomas is found on the streets of a poor neighborhood by a wealthy landowner, who brings him home to live with his two children, Sarah and David. At first reluctant, Sarah eventually welcomes Thomas, and they become very close, but David treats him as an outcast, especially after the landowner dies. About ten years later, the now-grown Thomas and Sarah have fallen in love and are meeting secretly in the rural countryside. David has become dissolute and tyrannical towards Sarah and the servants and forces Thomas to be a stable boy out of hatred for him.\n\nOne night as Sarah and Thomas are out together, they hear music and realize that their wealthy neighbors are having a party. The pair sneak inside the neighbors' estate by climbing over their garden wall, but the dogs are alerted and attack them. One of the dogs bites Sarah, and she suffers a severe leg injury. Thomas is forced to leave Sarah in their care. Enraged that the neighbors' glamor and wealth would so entrance Sarah, he blames the family for her injury and curses them all.\n\nSarah fully recuperates while staying for months with the neighbors, then returns home. The neighbor's son has fallen in love with Sarah and soon proposes; after he takes her back to the manor, she tells Mary what has happened. Mary reminds her about Thomas, but Sarah flippantly remarks that it would degrade her to marry him. Thomas overhears and leaves before he can hear Sarah realize aloud that she belongs with him, not the neighbor's son, despite their class difference.\n\nWhen she discovers Thomas has overheard, she runs after him into the countryside during a raging storm. The neighbor's son finds her cold and ill. He summons the local doctor, who nurses her back to health. Soon after her recovery, Sarah and the neighbor's son marry. Thomas then disappears but returns years later, now wealthy and elegant.\n\nHe has refined his appearance and manners to impress Sarah, and secretly buys the manor from David, whose gambling and heavy drinking have brought him to financial ruin. Sarah remains with her husband despite Thomas's return and denies her love for him; to spite Sarah, Thomas begins courting the neighbor's naïve daughter. Despite Sarah's strong objections, they eventually marry.\n\nA brokenhearted Sarah soon falls gravely ill. Thomas rushes to her side against the wishes of a now disillusioned and bitter wife. Sarah finally tells Thomas that she loves only him, and they reconcile, forgiving each other. At her request, Thomas carries Sarah to the window, so she can see the countryside for the last time before dying in his arms. Thomas asks Sarah to haunt him until the day he dies.\n\nAs Mary finishes her story, the local doctor arrives and tells Mary and John that he saw Thomas on the countryside with a woman, only to find Thomas's corpse alone in the snow. Mary realizes that he saw the ghosts of Thomas and Sarah, who now haunt the countryside together."
}