{
  "obfuscated_plot": "In the late 1930s, the governor of a western state appoints a young man to replace a deceased senator. The man is the head of a youth organization, and his appointment is supported by the governor's children. A corrupt political boss sought the appointment of his handpicked stooge, while popular committees wanted another candidate. The young man, however, was chosen because his naivety about politics was expected to make him easy to manipulate. He is taken under the wing of a publicly esteemed, but secretly crooked, senior senator who was a friend of the young man's late father. He develops an immediate attraction to the senator's daughter. At the senator's home, he has a conversation with her, fidgeting and bumbling, entranced by the young socialite. His naïve and honest nature allows the unforgiving press to take advantage of him, quickly tarnishing his reputation with ridiculous front-page pictures and headlines branding him a yokel. To keep him busy, the senior senator suggests he propose a bill. With the help of his secretary, who was the aide to his predecessor and had been around the political scene for years, he comes up with a bill to authorize a federal government loan to buy some land in his home state for a national youth camp, to be paid back by youngsters across the country. Donations pour in immediately. However, the proposed campsite is already part of a dam-building graft scheme included in an appropriations bill framed by the political machine and supported by the senior senator. Unwilling to crucify the worshipful young man so that their graft plan will go through, the senior senator tells the political boss he wants out, but the boss reminds him that he is in power primarily through the boss's influence. The senior senator then advises the young man to keep silent about the matter. The following day, when the young man speaks out about the bill in the Senate, the machine in his state — through the senior senator — accuses him of trying to profit from his bill by producing fraudulent evidence that he already owns the land in question. The young man is too shocked and angry by the senator's betrayal to defend himself and runs away. His secretary, who looked down on him at first but has come to believe in him, talks him into launching a filibuster to postpone the appropriations bill and prove his innocence on the Senate floor just before the vote to expel him. In his last chance to prove his innocence, he talks non-stop for about 25 hours, reaffirming the ideals of freedom and disclosing the dam scheme's true motives. Yet none of the senators are convinced. The constituents try to rally around him, but the entrenched opposition is too powerful, and all attempts are crushed. Owing to the influence of the political machine, newspapers and radio stations in his home state refuse to report what he has to say and even distort the facts against him. The youth organization's effort to spread the news in support of him results in vicious attacks on the children by the boss's gangsters. Although all hope seems lost, the senators begin to pay attention as he approaches utter exhaustion. The senior senator has one last card up his sleeve: he brings in bins of letters and telegrams from the young man's home state, purportedly from average people demanding his expulsion. Nearly broken by the news, the young man finds a small ray of hope in a friendly smile from the presiding official. He vows to press on until people believe him but immediately collapses in a faint. Overcome with the pangs of remorse, the senior senator leaves the Senate chamber and attempts to commit suicide by gunshot but is stopped by onlooking senators. He then bursts back into the Senate chamber, shouting a confession to the whole scheme; the reformed senator further insists that he must be expelled from the Senate and affirms the young man's innocence to his secretary's delight. The presiding official observes the ensuing chaos with amusement."
}