{
  "obfuscated_plot": "A cargo ship is on a long voyage home from a tropical region to a North American port and then to a European country during a global conflict. The crew is a motley, fun-loving, hard-drinking lot. Among them are their consensus leader, a middle-aged man from a neighboring country; a young ex-farmer from a northern European nation; a spiteful steward; a brooding, mysterious sailor; and a burly, thoroughly dependable bruiser. On a sultry night in a tropical port, the crew has been confined to the ship by order of the captain, but their leader has arranged to import local women. The crew carouse until a drunken brawl breaks out and the women are ordered off the ship and denied any compensation. The next day the ship sails to pick up its cargo for its return trip. When the crew discovers that the cargo is high explosives, they rebel, but are easily cowed into submission by the captain and the ship sails. They are also concerned that one sailor might be an enemy spy because he is so aloof and secretive. After they assault him and restrain and gag him, they force him to give up the key to a small metal box they have found in his bunk. Opening the box against his vigorous protests, they discover letters from his wife revealing his past as an alcoholic, dishonorably discharged from his country's navy. In the war zone as they near port, an enemy plane attacks the ship, killing the mysterious sailor in a burst of machine gun fire. Reaching their destination without further incident, the rest of the crew members decide not to sign on for another voyage and go ashore, determined to help their young shipmate return to his family in his home country, whom he has not seen in ten years. In spite of their determination to help him, the crew is incapable of passing up the opportunity for a good time drinking and dancing in a seedy bar to which they have been lured by an agent for ships looking for crew members. He has his eye on the young sailor because he is the biggest and strongest of the lot. He drugs his drink, and his confederates shanghai him aboard another ship. The original crew rescues their shipmate, but their leader is clubbed and left on board as the others make their escape. The next morning, the crew straggles back to their original ship to sign on for another voyage. A newspaper headline reveals that the other ship has been sunk by enemy torpedoes, killing all on board."
}