{
  "obfuscated_plot": "A saleswoman in a large city boutique faces a life-changing decision: marry her fiancé, a poor doctor, or run away with a rich married man she has loved for many years, who is about to leave his wife and young son. She is on the verge of choosing him and, as she wrestles with her choice, the film flashes back to her youth in a prestigious neighborhood. As a teenager, she gawks at the city's elite during a parade preceding an annual social event. Her father warns against getting carried away with her fantasies. Ironically, she meets the embodiment of her dreams in an acquaintance of his: a wealthy young man from a prominent family. He offers her a secretarial job at his fledgling magazine. The two fall in love, but when the magazine folds, he does not have the will to defy his family's expectations by proposing to a woman who is far beneath him socially.\n\nWith the death of her father and no prospect of marriage, she goes to work in a large city for her boutique owner. One day, she accidentally presses the burglar alarm and pretends to faint to cover her blunder. She is attended to by the doctor, who playfully blackmails her into a first date. The wealthy man finally breaks down, finds her, and proposes, presenting her with a family heirloom ring. She agrees to marry him on the condition that they not live in his hometown.\n\nWhen he introduces her to his family, she gets a chilly reception. She learns that he would be disinherited if he does not remain in his hometown and work in the family banking business. Though he is willing to give up his inheritance, she decides he is not strong enough to deal with poverty. She walks out, and they are divorced.\n\nShe returns to the large city and takes up with the doctor again but soon discovers she is pregnant with the wealthy man's child. He arranges to meet her, raising her hopes for a reconciliation, but they are dashed when she sees a newspaper announcement of his engagement to someone of his own social standing. She leaves without seeing him and receives a further blow when their baby dies at birth.\n\nFive years later, she reluctantly agrees to open a branch store in her hometown. By chance, she waits on the wealthy man's wife and meets their son. She takes the opportunity to entrust the secret return of the family heirloom ring to the boy, prompting him to visit and woo her one final time. The film returns to her initial dilemma. When she decides to marry the doctor rather than the wealthy man, her life takes a new and more promising course."
}