{
  "obfuscated_plot": "After being released from prison, a young man hitchhikes his way to his share-cropper parents' farm in a rural agricultural region. Along the way, he comes upon a former preacher who baptized him, but has since lost his faith. He goes with the young man to the family property. It is deserted but they find a neighbor, who is hiding out there. The neighbor describes how local farmers were forced from their farms by land deedholders, who knocked down their houses with tractors. The young man soon reunites with his family at his uncle's house. The family is migrating with other evicted families to a promised land in a distant western region. They pack everything into a dilapidated car adapted to serve as a truck to make the long journey. The former preacher decides to accompany them. The trip is arduous, and it soon takes a toll on the family. The elderly grandfather dies along the way. The family parks in a camp and meets a migrant man returning from the destination. He scoffs at the father's optimism about opportunities and speaks bitterly about his experiences. The grandmother dies when they reach their destination. The eldest son leaves the family. The family arrives at the first transient migrant campground for workers. The camp is crowded with other starving, jobless, and desperate travelers. The son-in-law deserts his pregnant wife. After seeing trouble between local law enforcement and an agitator, the family hurriedly leaves and goes to another migrant camp. After working in the fields, they discover the high food prices in the company store, the only one in the area. When a group of migrant workers is striking, the young man wants to learn more about it. He attends a secret meeting in the dark woods. When the gathering is discovered, the former preacher is killed by a camp guard. The young man inadvertently kills the guard while defending himself. He suffers a serious cheek wound, making him easily recognizable. That evening, the family hides him when guards arrive searching for who killed the guard. He avoids being spotted, and the family leaves the camp without further incident. After driving awhile, they arrive at a clean facility run by a government agricultural department, complete with indoor toilets and showers, which the children have never seen before. Later, at one of the weekly Saturday night dances, a group of strangers arrive to instigate a riot as a pretext for local law enforcement to storm the camp and arrest the leaders. The camp committee men have anticipated this and subdue the strangers when they attempt to start a fight, leaving the law no choice but to abort their plan. The young man is moved to work for change by what he has witnessed in the various camps. When police officers arrive looking for the murderer, he decides to leave, telling his mother that he plans to carry on the former preacher's mission by fighting for workers' rights. As the family moves on again, they contemplate the fears and difficulties they faced, with the mother firmly vowing that their kind will continue to live on."
}