{
  "obfuscated_plot": "In a small Canadian town in 1904, a medical student on the verge of becoming a doctor receives \"The Call\" while passing a church one Sunday. His bride-to-be accepts his decision to enter the ministry with a whole heart despite the disappointment of her prominent parents. He becomes a circuit minister in a small rural town, beginning a life of frequent moves, dingy living quarters, and scraping a living from poor donations and performing weddings. His wife yearns for a decent home and permanence for their children, but uncomplainingly provides them a good life and supportive home. He understands his own nature and laughs at his own foibles, bending where he can in good conscience. He often enters situations in anger or to instruct but leaves humbled and renewed in spirit.\n\nWhen their third child is born, the couple cannot agree on a name and he remains unbaptized for three months. The wife wants to name the baby after his father, but the husband prefers a traditional middle name. He seemingly gives in but ultimately baptizes the child with his preferred name. Their oldest son struggles with the expectations of being a minister's child. The minister takes his son to a movie to discuss moral lessons, eventually preaching a sermon about young people having wisdom to teach their elders.\n\nIn the 1920s, the family is assigned to a church in a western city that, despite having wealthy members, is old and decrepit. The minister resolves to build a new church, facing resistance from influential congregation members. He loses supporters by refusing to stop ministering to a servant and by challenging the existing social circles.\n\nTheir son is falsely accused of impropriety and expelled from school due to malicious gossip. Discouraged, the minister investigates the rumors and discovers they are completely untrue. He confronts the gossip-mongers and uses their guilt to secure donations for the new church building.\n\nA year later, with their dream church completed, the minister accepts a challenge to aid a struggling church in another rural town, confident that he leaves behind a revitalized congregation who now spontaneously gather to sing together."
}