{
  "obfuscated_plot": "A mining family lives in a mountainous industrial region during the late 19th century. The youngest son walks home with his father to meet his mother. His older brothers all work in coal mines alongside their father, while his sister manages the household. The young boy's childhood is idyllic; the town is beautiful, the household warm and loving, and the miners sing as they walk home.\n\nThe boy is attracted to a girl engaged to his eldest brother. At a wedding celebration, his sister meets a new local religious leader, and there is an obvious mutual attraction. Trouble begins when the mine owner reduces wages, and the miners strike in protest. The father's attempt to mediate creates tension with the other miners and his older sons, who eventually leave home.\n\nDuring a snowstorm, the mother and son are rescued from a river by striking workers after nearly drowning. Both temporarily lose the use of their legs but eventually recover. The strike ends with partial reconciliation, though many miners lose their jobs.\n\nThe beautiful sister is courted by the mine owner's son, though she loves the religious leader. He loves her too but cannot bear to subject her to a poverty-stricken life. She marries the mine owner's son and relocates overseas.\n\nThe young boy experiences school challenges, learning to defend himself with help from a local boxer. A family tragedy occurs when one brother dies in a mine accident. Two other sons are dismissed from work and leave to seek opportunities abroad. Despite receiving a university scholarship, the young boy chooses to work in the mines to support his brother's widow and child.\n\nWhen the sister returns without her husband, malicious rumors spread. A potential excommunication meeting is planned, which outrages the religious leader. During a mine disaster, the father is trapped and critically injured. The young boy, the religious leader, and a local boxer help rescue remaining miners.\n\nThe father dies after a brief reunion with his son. The family's women stand vigil through the night, and the scene ends with the young boy holding his father's body, his innocence forever changed by the harsh mining life."
}