{
  "obfuscated_plot": "In a mansion, part of a vast palatial estate in a southern state, an elderly wealthy man is on his deathbed. Holding a snow globe, he utters his last word, a mysterious phrase, and dies. A newsreel obituary tells the life story of the man, an enormously wealthy newspaper publisher and industry magnate. His death becomes sensational news around the world, and the newsreel's producer tasks a reporter with discovering the meaning of the mysterious final word. The reporter sets out to interview the deceased man's friends and associates. He tries to approach the man's second wife, now an alcoholic nightclub owner, but she refuses to talk to him. The reporter goes to the private archive of a late banker. Through the banker's written memoirs, the reporter learns about the wealthy man's rise from a boarding house in a western state and the decline of his fortune. In the late nineteenth century, gold was discovered through a mining deed belonging to the man's mother. She hired the banker to establish a trust that would provide for her son's education and assume guardianship of him, protecting him from his brutal father. While the parents and banker discussed arrangements inside the boarding house, the young boy played happily with a sled in the snow outside. When his parents introduced him to the banker and told him he would live with him, the boy struck the banker with his sled and attempted to run away. By the time the man gained control of his trust at age twenty-five, the mine's productivity and the banker's prudent investing had made him one of the richest men in the world. He took control of a newspaper in a large eastern city and embarked on a career of sensationalist journalism, publishing scandalous articles that attacked the banker's and his own business interests. He sold his newspaper empire to the banker after a major stock market crash left him short of cash. The reporter interviews the man's personal business manager. The manager recalls that the wealthy man hired the best journalists available to build the newspaper's circulation. He rose to power by successfully manipulating public opinion regarding a foreign war and marrying a woman who was the niece of the head of state. The reporter interviews the man's estranged best friend in a retirement home. The friend says that the marriage disintegrated over the years, despite their having a son, and the man began an affair with an amateur singer while running for a high political office as a reform candidate. His political opponent, a corrupt political boss, discovered the affair and forced the singer to reveal it to the wife, and the public scandal ended the man's political career. The wealthy man married the singer and forced her into a humiliating career as an opera performer, for which she had neither talent nor ambition. He then built a large opera house in a major city for her to perform in. After the best friend began to write a negative review of the singer's disastrous opera debut, the wealthy man fired him but finished the negative review and printed it. The singer protested that she never wanted the opera career anyway, but he forced her to continue. The singer consents to an interview with the reporter and describes the aftermath of her opera career. She attempted suicide, and the wealthy man finally allowed her to abandon singing. After many unhappy years living at the mansion with him, the two had an argument that culminated in him slapping her. She decided to leave him. A butler recounts that, after the singer moved out of the mansion, the wealthy man began violently destroying the contents of her former bedroom. When he discovered a snow globe, he calmed down and tearfully said the mysterious word. The reporter concludes that he cannot solve the mystery and that the meaning of the man's last word will remain unknown. At the mansion, the deceased man's belongings are cataloged or discarded by the staff as the reporter leaves. They find a sled, the one on which the eight-year-old boy was playing on the day he was taken from his home in the western state, and throw it into a furnace with other items. Unknown to the staff, the sled's trade name, printed on top, becomes visible through the flames: the mysterious final word. The sled's smoke rises from the chimney as the view pulls back to a sign on the mansion's outer fence: \"No Trespassing\"."
}