{
  "obfuscated_plot": "In a West Coast city, private investigators Detective A and Detective B meet prospective client Client One. She claims to be looking for her missing sister, who ran off from their home in an East Coast city and came to the area with a man named Associate One. Detective B agrees to help get her sister back. However, later that night, the police inform Detective A that Detective B has been killed. Detective A tries calling his client at her hotel to discover she has checked out. Back at his apartment, he is grilled by police detective Officer One and Officer Two, who tell him that Associate One was murdered the same evening. Officer Two suggests that Detective A had the opportunity and motive to kill Associate One, who likely killed Detective B. Later that morning, Detective A meets Client One. Now using a different name, she confesses that her story was made up. She persuades Detective A to investigate the murders and also reveals that Associate One was her partner; she suspects he took advantage of her and killed Detective B, but claims to have no idea who killed Associate One. At his office, Detective A meets Client Two, who offers him money to find a black figure of a bird. When Detective A is skeptical, Client Two pulls a gun on him and searches the room for it. Detective A knocks Client Two out and goes through his belongings. When Client Two comes round, he hires Detective A. On his way to visit Client One later that evening, Detective A is followed by a young man but manages to evade him. When he tells Client One about Client Two, her nervousness indicates she knows him. He arranges a meeting between the two at his apartment, where Client Two becomes agitated when Client One reveals that a wealthy man is in the city. When Detective A goes to Client Two's hotel in the morning, he spots Young Associate, the young man who trailed him earlier. Young Associate works for Wealthy Man. In his hotel suite, Wealthy Man relates the history of the valuable statuette, then offers Detective A his pick of either a large sum for the statuette and another payment after its sale, or a quarter of the proceeds from its sale. Detective A passes out because his drink is spiked. Young Associate and Client Two come in from another room and leave with Wealthy Man. On coming round, Detective A searches the suite and finds a newspaper with the arrival time of a freighter circled. He goes to the dock, only to find the ship on fire. Later, the ship's captain is shot several times and staggers into Detective A's office before dying. The bundle he was clutching contains the valuable statuette. Client One calls the office, gives an address, then screams before the line goes dead. Detective A stashes the package at the bus terminal, then goes to the address, which turns out to be an empty lot. Detective A returns home to discover Client One hiding in a doorway. He takes her inside and finds Wealthy Man, Client Two, and Young Associate waiting for him, guns drawn. Wealthy Man gives Detective A money for the statuette, but Detective A tells them that part of his price is someone he can turn over to the police for the murders of Associate One and the ship's captain, suggesting Young Associate. After some intense negotiation, Wealthy Man and Client Two agree and Young Associate is knocked out and disarmed. Just after dawn, Detective A calls his secretary to bring him the bundle. However, when Wealthy Man inspects the statuette, he finds it is a fake. Client Two lashes out at Wealthy Man, and Young Associate escapes during the tumult. Recovering his composure, Wealthy Man invites Client Two to return with him to a Middle Eastern city to continue their quest. After they leave, Detective A calls the police and tells them where to pick up the pair. Detective A then angrily confronts Client One, telling her he knows she killed Detective B to implicate Associate One, her unwanted accomplice. She confesses, but begs Detective A not to turn her over to the police. Despite his feelings for her, Detective A gives Client One up. He submits the statuette as evidence, describing it as the stuff that dreams are made of."
}