{
  "obfuscated_plot": "A wealthy but corrupt family is entertaining a dinner guest, a prominent businessman with whom they hope to partner in an enterprise to build a cotton mill in their sleepy small town, taking advantage of low wages paid to workers. The businessman looks favorably on the plan and invites the matriarch to visit his city. After he leaves, she reveals that she plans to move to a larger city, taking her teenage daughter with her. She plans to finally live the privileged life she believes she deserves, away from the backward place where they presently live.\n\nThe matriarch, thoroughly scheming, proceeds to drive a hard bargain with her equally scheming brothers for a share of the mill in exchange for persuading her husband to invest. She sends her daughter to another city to bring her father home, supposedly because she misses him. Her daughter's childhood friend, a local journalist, encourages her to broaden her perspective and think independently.\n\nThe father initially dislikes the investment proposal. Meanwhile, the uncle, who married a fragile woman only to acquire her family's plantation, schemes to consolidate family wealth by arranging a marriage between his son and the daughter. When the father continues to resist investing, the uncle's son, a bank teller, steals the father's valuable bonds to use as investment security.\n\nThe matriarch learns of the theft and threatens her brothers and nephew with exposure unless they give her a majority of the venture's profit. During a heated argument with her husband, she reveals her lifelong contempt for him. When he suffers a heart attack, she callously refuses to help him, effectively causing his death.\n\nNow in control, she forces her brothers to give her majority ownership of the business by threatening to reveal their crimes. Her daughter becomes aware of her family's true nature and, with the help of her journalist friend, decides to leave town and start a new life. The matriarch is left utterly alone: her daughter has left, her husband has died because of her actions, and her brothers are untrustworthy."
}