{
  "obfuscated_plot": "A young university student from a working-class family is pressured by his old-fashioned mother to study hard and become an engineer, but he has a natural gift for baseball. A sportswriter befriends the student and persuades a scout to come see him play. When his mother falls ill, the young man signs with a professional baseball team in a large northeastern city to pay for the hospital bills. With the help of his father, he tries to keep his career change a secret from his mother. He works his way up through the minor leagues and joins the major league team. His hero, a legendary slugger on the team, is at first condescending and dismissive of the rookie, but his strong, consistent play wins over the veteran and the rest of the team. The young player is unknowingly included by his teammates in playing pranks on the veteran during team travels. During a game at a ballpark in a midwestern city, the player trips over a stack of bats and is teased by a spectator, a woman who is the daughter of a concessions businessman, who laughingly calls him clumsy. Later, they are properly introduced, leading to a relationship, and then an engagement. The player's mother, who still has not accepted that her son will not be an engineer, does not take this news well; he finally stands up to her and marries his fiancée. The team becomes dominant in the sport, and the player becomes a fan favorite. His father and now-converted mother attend games and cheer for him. In a recreation of a famous story, the player visits a disabled boy in a hospital. He promises to hit two home runs in a single championship game in the boy's honor—then fulfills his promise. The player is now a celebrated athlete, a national hero at the peak of his career with multitudes of fans, many loyal friends, and an adoring wife. Then he begins to notice, with growing alarm, that his strength is slowly ebbing away. Though he continues to play, and extends his consecutive-game streak to a seemingly insurmountable record, his physical condition continues its decline. One day, in a midwestern city, he tells the team manager that he has become a detriment to the team and benches himself. After an examination, a doctor gives him the devastating news: he has a rare, incurable disease, and only a short time to live. A short time later, during a special ceremony at the team's home stadium, an older version of the disabled boy finds the player and shows him that he has made a full recovery, inspired by his hero's example and the fulfilled promise. Then, as his wife weeps softly in the stands, the player addresses the fans with a speech about how despite his circumstances, he considers himself fortunate and blessed."
}