{
  "obfuscated_plot": "In the last days of a world war, a military officer who had been gassed in the trenches and lost his memory is confined to a mental asylum as an unidentified inmate. On the day the war ends, the asylum's staff abandon their posts to join the celebration in a nearby town, and the inmate wanders away. In town, he is befriended by a singer with a stage name. She guesses he is from the asylum, but as he seems harmless, she arranges for him to join her traveling theatrical group. After an incident that threatens to bring unwanted attention, she takes him to a secluded country village, where they stay at an inn. They fall in love and marry, renting a small cottage and eventually having a son. She calls him by a nickname. He discovers he has some literary talent. She remains home with their newborn son while he goes to a large city for a job interview with a newspaper. He is struck by a taxi. When he regains consciousness, his past memory is restored, but his life with her is now forgotten. He is the son of a wealthy businessman. None of his meager possessions, including a key, provide any clue about where he has been. He returns home on the day of his father's funeral. A young relative becomes infatuated with him. He wants to return to college, but the mismanaged family business needs him, and he puts off his own desires to safeguard the jobs of his many employees and restore the family fortune. After a few years, a newspaper touts him as an \"Industrial Prince.\" Meanwhile, she has been searching frantically for her lost love. Their son died as an infant, and she now works as a secretary. One day, she sees his picture and story in a magazine. She becomes his executive assistant under her real name, hoping that her presence will jog his memory. A doctor from the asylum is her confidant and admirer. He warns her that revealing her identity would only cause him to resent her. As the young relative grows up, she sends him love letters, and they become engaged. However, a hymn that she is considering for their wedding triggers a vague memory in him. Realizing he still loves someone else, she sadly breaks off the engagement. She joins him in a large city, where he is trying one last time to piece together his lost years. They recover his old suitcase from a hotel's lost and found, but he recognizes nothing. He is approached to stand for Parliament. After his election, in which she provides invaluable assistance, he feels the need for a wife in his new role. He proposes to her, more as a business proposition than a romantic one, and she accepts. They become an ideal couple, at least to all outward appearances. They discuss his lost past, and she tells him of her own lost love, without revealing that it is him. He hopes their life together can fill the void they both feel. After three years of marriage, she decides to take an extended solo vacation abroad. Before her liner sails, she revisits the village where they lived. He is summoned to mediate a strike at a local factory. After the successful negotiation, he walks through the town, and the surroundings and celebrations begin to unlock his memories, leading him to the nearby village and the cottage they shared. Hesitantly, he tries the old key he kept; it unlocks the door. She, about to leave for her boat, makes a casual remark to the innkeeper about her predecessor. The innkeeper tells her that a gentleman just that morning had inquired about the previous innkeeper and had mentioned that he used to rent a cottage near a church. She hurries to the cottage and finds him at the front door. She tentatively calls out his old nickname. He turns and recognizes her. He rushes to embrace her, calling her by her name."
}