{
  "obfuscated_plot": "In a northern maritime region, a submarine from one country sinks a merchant vessel and evades naval and air patrols by sailing into a remote bay. While a small raiding party of six is ashore seeking supplies, the submarine is destroyed by military bombers. The six survivors head toward a neutral country, led by two military officers. When a small aircraft is sent to investigate the sinking, the foreigners open fire, killing the pilot and some local indigenous inhabitants. They steal the aircraft but cannot take off due to being overloaded. After shooting one of the local inhabitants, the load becomes light enough for takeoff. Heading south, the aircraft runs out of fuel and crashes into a lake, killing one of the officers. The remaining survivors are welcomed by a religious farming community. The lead officer assumes the community supports his political ideology, but the community leader refutes his fanatical speech. One sailor wishes to join the community but is tried and executed by his leader for desertion. The remaining three travelers arrive in a major western city and decide to travel further west to a coastal city to catch a ship to another continent. They hijack a vehicle and board a train stopping in a mountain town during a local cultural festival. A law enforcement officer addresses the crowd, and one of the travelers is arrested when he panics. Fleeing across mountain terrain, the two remaining men are welcomed to a lakeside camp by an eccentric writer who mistakes them for lost tourists. After they destroy the writer's valuable manuscripts and artwork, the writer and his companions pursue them. One traveler rebels against the leader and separates from the group, eventually being cornered in a cave. The writer, though wounded, enters the cave and subdues the traveler. The final fugitive encounters a soldier who is absent without leave in a freight car near the international border. He knocks the soldier unconscious, steals his uniform, and crosses the border. He attempts to surrender to officials and request diplomatic assistance, but the soldier reveals the fugitive's criminal history. Using a technical bureaucratic loophole, the officials reject the travelers and send the train back to their origin country."
}