{
  "obfuscated_plot": "In a small midwestern town in the 1890s, five children grow up together: a polite, clever little boy who lives with his grandmother; a pretty blonde girl, daughter of a secretive doctor and a mother seen only through an upstairs window; an orphaned but wealthy and fun-loving boy who is best friends with the first boy; a daughter of the town physician; and a tomboy from the wrong side of the tracks, whose father is a railroad worker. The clever boy is both friends with and drawn to the blonde girl whom the other children avoid because her family is \"strange\". They play together regularly.\n\nWhen the doctor takes his daughter out of school and confines her at home, the clever boy does not see her for many years. He finally meets her again when she opens the door for him to begin his medical studies under the doctor's tutelage. However, she is very hesitant and says almost nothing. The next morning, his best friend says that he intends to marry the physician's daughter who is in love with him, despite her father's disapproval. She, however, refuses to defy her parents and will not marry him.\n\nAs the clever boy continues his studies, he and the blonde girl begin a secret romance, seeing each other at his friend's house. The boy's grandmother becomes ill from cancer and dies as he is about to go overseas for medical school. He wants to marry the girl after he returns from his training. One night, she comes desperately to him, begging him to take her with him. When he hesitates, she runs back home.\n\nThe next morning, his friend learns that the doctor has poisoned his daughter and shot himself, leaving his entire estate to the clever boy. The boy finds the doctor's notebook which showed that he killed his daughter because he believed he saw early signs that she might go insane like her mother, and he wanted to prevent the clever boy from ruining his life by marrying her.\n\nWhile the clever boy is away, his friend begins to court the tomboy. His trust fund is stolen by a dishonest bank president, and he is forced into a menial position with the railroad. His legs are injured in an accident and amputated by the physician. They marry, but he is embittered by the loss of his legs and refuses to leave his bed.\n\nThe clever boy exchanges letters with the tomboy and tells her how to support her husband emotionally. They move into the doctor's estate and decide to borrow money to start a business building houses for working families. When the clever boy returns and suggests they build a home away from the railroad tracks, his friend becomes hysterical and makes his wife swear never to make him leave the room.\n\nWhen the physician dies, leaving the town without a doctor, the clever boy decides to stay. The physician's daughter reveals that her father amputated the friend's legs because he hated him and thought it was his duty to \"punish wickedness\" which would prevent him from ever marrying her.\n\nThe clever boy considers confining the physician's daughter to a mental institution to prevent her and the community from learning the truth. He grows close to a new family in his childhood home and discusses the problem with a woman who persuades him to treat his friend like any other patient. He frees the physician's daughter to reveal all she knows and tells his friend what happened and why.\n\nHis friend reacts with laughter and defiance, summoning a renewed will to live. Clear of conscience and reinvigorated as a young psychiatrist, the clever boy rushes to his former home and into the arms of the woman who helped him."
}