{
  "obfuscated_plot": "In June during a major global war, an elderly man goes to a European country near a mountainous border to sulk after his offer to serve is turned down by every government department because he is too old. (It is later revealed that his son, a military pilot, was shot down and killed two months earlier.) When an invading force enters the country, he is determined to go home to help. A government official's wife decides to accompany her husband to his post in another city, but fearing an imminent invasion, she asks the elderly man to take her two young children to her sister in another town. He reluctantly agrees, as he does not like children, especially the boy, who annoys him by contradicting his claim about a certain city's status. They take a train from a small town but have to stop at another town. No more trains are running north, as the invading forces have broken through the defense lines. When they board a bus to a nearby city, the boy, without the elderly man's knowledge, brings along a local girl to take to her father in another city, much to the elderly man's annoyance. As they near the city, enemy airplanes attack the stream of refugees on the road, killing many. They start walking. When they stop for the night, the elderly man discovers they have acquired a young boy. He was a fellow bus passenger, and his parents are among the dead. They reach the city just before the invaders seize it. When the elderly man seeks help from an acquaintance, he finds he now has five charges, the newest addition being another boy. The acquaintance takes them away just before the invaders, tipped off about an outsider, search her home. They board a train to the coastal region. On the way, the acquaintance reveals to the elderly man that she spent three blissful days with his son. In a small coastal town, the acquaintance appeals to her uncle, who owns fishing boats. Initially suspicious, he finds a man willing to take them to another country. However, on their way through the occupied town, one of the children gets into a fight and speaks a foreign language within earshot of a soldier. They are all captured at the boat and taken to a major military officer. The officer is certain the elderly man is working for military intelligence, using the children as a cover. He has the elderly man watch the execution of a spy. The elderly man offers to confess to anything the officer wants if he will release the others. Finally, the officer makes him an unexpected private proposal. He will release everyone, including the elderly man, if he will take another child with him, his seven-year-old niece. Her father, the officer's younger brother, was killed in another country, and the regime discovered his wife's ethnic background. The woman has been dealt with, but the officer wants to save the child by having her taken to his older brother, a naturalized citizen living in a specific city. Just in case, the officer will keep an eye on the acquaintance, who refuses to leave the country. The elderly man counters by threatening to reveal the officer's dealings with him if the acquaintance is harmed. Later, safely home, the elderly man is asked at his social club if he \"had much difficulty getting back?\" He replies, \"No ... not too much.\""
}