{
  "obfuscated_plot": "A mill worker and political activist is accused of arson and murder, allegedly setting fire to a woolen mill and killing the mill foreman. In the middle of the trial, he escapes from jail and seeks shelter in a remote cottage owned by a former schoolmate, on whom he has had a crush for years. The schoolteacher has rented the unoccupied cottage for the summer to a distinguished law professor who plans to use this secluded location to write a book. Both the professor and the fugitive arrive within minutes of each other, so the schoolteacher decides to hide the fugitive in the attic. When the fugitive is spotted by the professor, she passes him off as her gardener. A visitor suddenly arrives, a senator who informs the professor that he is about to be nominated to the Supreme Court.\n\nMeanwhile, the professor and the fugitive enjoy having spirited discussions about the law, with the professor arguing from an academic viewpoint, and the fugitive subscribing to a more practical approach. As a result of their debates, they become good friends, but also romantic rivals, as the professor falls in love with the schoolteacher. Prodded by the schoolteacher and the fugitive's lawyer, the professor becomes suspicious of the mill owner, foreman, and the girlfriend of the supposed murder victim.\n\nDespite his initial reluctance, the professor starts to investigate the charges against the fugitive. As a ruse, he romances the girlfriend and discovers that the foreman is still alive and hiding in another city. The schoolteacher, professor, and fugitive go to the city and find him. They bring him back to their town and get him to admit his guilt and that of the mill owner for setting the fire. While the three argue about whether to call the police, the foreman catches them unawares, knocks them unconscious, and escapes.\n\nThe fugitive is held for trial while the town's anger at him is stoked into a riotous mob. The professor takes a gun and seeks out the foreman, forcing him at gunpoint to go to the courthouse just as the mob is about to break in to lynch the fugitive. Firing the revolver to draw attention, the professor announces that the supposedly dead foreman is now present. He then gives an impassioned speech to the mob about the importance of the law, both in principle and in practice.\n\nIn due course, the foreman and mill owner are indicted, and the fugitive is set free. Soon afterward, the professor is appointed to the Supreme Court. The schoolteacher visits him in his chambers, and he tells her that his dream of 20 years has been realized. He suggests that she should marry the fugitive. During the first seating of the professor as an Associate Justice, the fugitive misinterprets an affectionate look between the professor and schoolteacher and leaves the courtroom abruptly. The schoolteacher follows him and eventually convinces him that she has chosen him."
}