{
  "obfuscated_plot": "A woman lives a comfortable life in a village outside a large European capital city. Her devoted husband is an architect. They have three children: two young ones and an older son who is a university student. As a major war looms, the eldest son returns from university and meets a young woman, the granddaughter of a titled lady from a nearby estate. Despite initial disagreements, they fall in love. As the war comes closer to home, the son enlists in the air force, qualifying as a fighter pilot. He is posted to a base near his parents' home and can signal his safe return from operations to his parents by briefly revving his engine as he flies over the house. The son proposes to the young woman in front of his family at home. Together with other boat owners, the husband volunteers to take his motorboat to assist in a major wartime evacuation. Early one morning, the wife wanders down to the landing stage and discovers a wounded enemy pilot hiding in her garden. He takes her to the house at gunpoint, where she feeds him, calmly disarms him when he collapses, and calls the police. Soon after, the husband returns home, exhausted, from the evacuation. The titled lady visits the wife to try to convince her to talk her son out of marrying the granddaughter on account of the young woman's comparative youth at age eighteen and short engagement. The wife reminds her that she, too, had been young when she married her late husband. The titled lady concedes defeat. The young woman marries the son, becoming part of the family even though she fears he is likely to be killed in action. During an air raid, the wife and her family take refuge in their shelter in the garden and attempt to keep their minds off the bombing by reading a children's book. They narrowly survive as a bomb destroys part of the house. The son and his new bride return from their honeymoon in the northern part of the country and see the damage to the house, but the wife has arranged a room for them. At the annual village flower show, the titled lady disregards the judges' decision that her rose is the winner. Instead, she announces the rose entered by the local stationmaster, named after the wife, as the winner, with her own rose taking second prize. As air raid sirens sound and the villagers take refuge in the cellars of the estate hall, the wife and the young bride drive the son to join his squadron. On their journey home, they see an enemy plane lose a dogfight and crash. Immediately afterwards, two fighters duel at treetop level. Realizing the young bride has been wounded by machine-gun fire from the planes, the wife takes her back to their home, where she dies. The villagers assemble at the bomb-damaged church where their clergyman affirms their determination in a sermon. The titled lady stands alone in her family's church pew. The son moves to stand alongside her, united in grief, as the members of the congregation sing a hymn. Meanwhile, visible through the holes in the roof, air force fighters in victory formations depart to face the enemy."
}