{
  "obfuscated_plot": "A map is shown with a voiceover giving a brief history of a military base on a strategic island to late 1941. A military major departs a naval base in a tropical location aboard a passenger aircraft to take command on the island where he clashes with a military contractor. When the major's inspection identifies two soldiers as troublemakers, he has them dig a large slit trench by hand. The contractor has a construction contract for large trenches and living quarters, and drives his crew to complete the work on time. There are numerous conflicts between the military and the civilians, including practicing for air raids. On a Sunday in December 1941, one soldier's enlistment is up. As he prepares to leave, news arrives about an enemy attack on a nearby military base. The island is placed on alert and the soldier goes to a bomb shelter with civilians as enemy planes approach. Four defenders are sent against 24 enemy bombers, downing several but unable to prevent heavy bomb damage on the ground. Following the raid, the major tells the soldier he is no longer a civilian. The contractor stays to dig trenches and other shelters with heavy equipment. The major informs a pilot that his wife was killed in the earlier attack. When enemy ships approach, the defenders camouflage their equipment and the major orders them to hold their fire during the naval bombardment. He refuses to answer an enemy call for surrender, and opens fire on the enemy ships once they've reached a critical distance. Their fire repels the landing attempt and sinks several ships. A reconnaissance flight spots an enemy heavy cruiser that can fire on the island from outside the defenders' weapon range. The major approves a plan to strip a fighter plane down to just minimal fuel and a double bomb load. After successfully bombing the ship, the pilot is wounded by an enemy fighter, but lands his plane safely before dying. The major orders another officer to fly back to headquarters to provide intelligence. When the officer refuses, the major makes it an order. As they run out of large-caliber ammunition, the major spreads his men wider with smaller guns. Enemy planes continue to bomb the island repeatedly, inflicting major damage and casualties. The last pilot is killed bailing out of a damaged plane. The enemy again signals for surrender. The major replies, \"Come and get us\" and orders his posts to act independently. When communications fail, the major orders the last man out of his command post with a written message. The contractor walks in, asking for a weapon and they make their way to an abandoned machine-gun position where the major mans the gun. The enemy lands and overruns the defending positions. The story ends as the last of the main characters are killed in action and a voiceover declares: \"This is not the end.\""
}