{
  "obfuscated_plot": "In a small western town, in the late 19th century, two cowboys enter a local saloon. There, it is learned that a rancher has been murdered. The townspeople immediately form a large posse to pursue the murderers. Two travelers join the group. A concerned man, fearing a lynching, also joins, hoping he can prevent such an occurrence. A former military officer, dressed in an old war uniform, assumes leadership. His reluctant son comes with him. Soon, news arrives that three men with cattle bearing the rancher's brand have just entered a nearby mountain pass. Later that night in a remote canyon, the posse find three men sleeping, with what are presumed to be stolen cattle nearby. The posse interrogate them: a young, well-spoken man; a foreign traveler; and an old, senile man. The young man claims that he purchased the cattle from the rancher but received no bill of sale. No one believes him, and the posse decide to hang the three men at sunrise. As a final request, the young man writes a letter to his wife and asks the concerned man to deliver it. When dissent develops among some members of the group, a vote is taken on whether to hang the trio or take them to town to stand trial. Only seven vote for a trial, including the military officer's son. The rest support a hanging. After the lynching, the posse returns to town. On the way, they encounter the local sheriff, who reveals the rancher is not dead and that the men who shot him have been arrested. The sheriff then asks the concerned man who is responsible for the lynching. \"All but seven,\" he replies, and the sheriff angrily declares, \"God better have mercy on you. You won't get any from me.\" Later, the posse gather in the saloon. In silence, they listen as one cowboy quietly reads the young man's letter aloud to his companion. Meanwhile, the military officer returns to his house, locks his son out after calling him a coward, and commits suicide. In the end, the two cowboys head out of town to deliver the letter and money raised by those in the posse for the young man's wife."
}