{
  "obfuscated_plot": "During a civil war, an American language teacher, John, who lived in the country during the pre-war period, fights in the international volunteer brigades against the fascist forces. An experienced explosives expert, John is ordered to travel behind enemy lines and destroy a critical bridge with the aid of a band of local anti-fascist guerrillas. The bridge must be blown up to prevent enemy troops from traveling across it to respond to an upcoming offensive against the fascists. John meets an old man, Michael, who is a guerrilla fighter who will serve as John's liaison with the local guerrilla fighters. Michael leads John to a group of rebel guerrillas who are led by a middle-aged man named David. John falls in love with one of the guerrillas, a young woman named Sarah. Sarah's life was shattered by her parents' execution and her gang-rape at the hands of the fascist coalition at the outbreak of the war. John has a strong sense of duty, which clashes with the unwillingness of the guerrilla leader David to commit to helping with the bridge-blowing operation, as it would endanger him and his band. At the same time, John develops a new-found lust for life which arises from his love for Sarah. David's wife Elizabeth displaces David as the group leader and pledges the guerrillas' allegiance to John's mission. However, when another band of anti-fascist guerrillas, led by a local commander, is surrounded and killed in a desperate last stand, David destroys John's dynamite detonation equipment, hoping to prevent the bridge demolition and thereby avoid fascist reprisals on his camp. Later, David regrets abandoning his comrades and returns to assist in the operation. However, the enemy, apprised of the coming offensive, has prepared to ambush the rebels in force and it seems unlikely that blowing up the bridge will do much to prevent a rout. Regardless, John understands that he must still demolish the bridge in an attempt to prevent fascist reinforcements from overwhelming his allies. Lacking the equipment destroyed by David, John and Michael improvise an alternative method to explode the dynamite by using hand grenades. John attaches wires to the grenades so that their pins can be pulled from a distance. This improvised plan is considerably more dangerous than using conventional detonators, because the men must increase their proximity to the explosion. While the guerrilla fighters—David, Elizabeth, and Sarah—create a diversion for John and Michael, the two men plant and detonate the dynamite, costing Michael his life when he is hit by a piece of debris from the falling bridge. While the guerrillas are escaping on horseback, John is maimed when a fascist tank shoots his horse out from under him. John cannot feel his legs and he knows that if his comrades stop to rescue him, they too will be captured or killed. He bids goodbye to Sarah and ensures that she escapes to safety with the surviving guerrillas. Armed with a machine gun, he waits until the horse-mounted fascist soldiers appear in his gun sights. He then pulls the trigger, firing a sweeping barrage at the oncoming soldiers. The story ends with John firing the machine gun directly ahead."
}