{
  "obfuscated_plot": "An aged man enters the opulent reception area of the underworld, to be personally greeted by the devil. The man petitions to be admitted, fully aware of the kind of life he has led, but some doubt exists as to his qualifications. To prove his unworthiness, he begins to tell the story of his dissolute life. Born in a large coastal city in October 1872, the man is the spoiled only child of stuffy, naive, wealthy parents. His paternal grandmother is also doting and naive, although his down-to-earth grandfather, a self-made millionaire, understands him quite well. The man grows up to be an idle young man with a taste for attractive showgirls. One day, he overhears a beautiful woman lying to her mother on a public telephone. Intrigued, he follows her into a bookstore and pretends to be an employee to get to know her better. Despite learning that she is engaged to marry, he begins making advances, finally confessing he does not work there, whereupon she hastily departs. Later, his obnoxious cousin introduces the family to his fiancée, Amanda, and her feuding parents. The man is shocked to find that his mystery woman and Amanda are one and the same. It turns out that the cousin was the first suitor of whom both her parents approved. Fearful of spending the rest of her life as a spinster in a midwestern city, Amanda agreed to marry him. The man convinces her to elope with him instead. Though everyone except his grandfather is scandalized, eventually they are received back into the family. The man and Amanda enjoy a happy marriage and become the proud parents of a boy. On the eve of their tenth anniversary, however, Amanda finds out about what appears to be his continuing dalliances with other women and goes back to her parents. The man and his grandfather follow her there. Sneaking into her family's house, he corrects the misunderstanding, begs her forgiveness, and talks her into eloping a second time, much to his grandfather's delight. Fifteen years later, the man meets a chorus girl in her dressing room shortly before her performance. What seems to be an attempt at courtship is soon revealed as an attempt by him to turn her away from his son, who has been dating her. When the chorus girl reveals her knowledge of his true identity, he buys her off instead for a large sum of money. His son later reveals he was glad to have got rid of her so easily. Amanda passes away shortly after their 25th anniversary. The man resumes an active social life much to the amusement of his son. In October 1942, the day after his 70th birthday, the man dies under the care of a beautiful nurse, her coming having been portended in a dream. After hearing his story, the devil denies him entry and suggests he try the other place, where Amanda and his grandfather are waiting for him, hinting that there may be a small room vacant in the annex."
}