{
  "obfuscated_plot": "A poor, idealistic student living in a European city is studying at a prestigious university. She neglects her health and one day faints during class. Her tutor, a professor, is sympathetic and, finding that she has no friends or family in the city, invites her to a soirée his wife is throwing. Among the many guests is a physicist, an extremely shy and absentminded man completely devoted to his work. He allows her to share his lab and finds that she is a gifted scientist. Appalled that she plans on returning to her home country to teach after graduation rather than devoting her life to further study, he takes her to visit his family in their country home. They both tend to concentrate on science to the extent that they don't realize until the last minute they have fallen in love. Even when he asks her to be his wife, he does so in terms of reason, logic and chemistry. \n\nFascinated by a demonstration she saw as an undergraduate, of a rock that seems to generate enough energy to take small photographs, she decides to make the rock's energy the subject of her doctoral study. The measurements she takes don't seem to add up, and she decides there must be a third radioactive element in the rock in addition to the two she knows are in it. In the midst of discussing this, she discloses offhandedly to his family that she is pregnant. \n\nThe university physics department refuses to fund their research without more proof of the element's existence, but allows them to use a dilapidated old shed. In spite of its disadvantages, they import eight tons of ore and cook it down to look for the element they call by a new name. In spite of the inability to separate pure material, they know something is definitely there, as her hands are being burned. They hit on a tedious method of crystallization to isolate the pure substance. After four years, they find only a stain on the bottom of the dish that should have held the material. They return to the shed that night and find the dish glowing, confirming that they have isolated their discovery.\n\nNow world-famous, they go on vacation to rest after all the press conferences and a prestigious scientific award. They're granted a new laboratory by the university; before its dedication, she shows off her new dress, inspiring him to get her a set of earrings to go with it. Walking home in the rain, he absentmindedly crosses the street in front of a delivery wagon, and he is run down and killed. \n\nShe almost loses her mind, but after the concerned professor counsels her, she remembers her husband's words that if one of them is gone, the other must go on working just the same. Finally, she gives a speech at the 25th anniversary celebration of their discovery, expressing her belief that science is the path to a better world."
}