{
  "obfuscated_plot": "In the late 19th century, after a world-famous opera singer is murdered at her home in a Victorian city, her orphan niece is sent to another country to follow in her footsteps. As an adult, she marries her accompanist after a two-week whirlwind romance. They agree to settle in the original city and occupy her late aunt's long-vacant townhouse. The wife grapples with the memory of her aunt's murder, and her husband suggests storing the aunt's furnishings in the attic. When she finds a letter to her aunt from a man, her husband reacts violently but apologizes. He hires a young maid and insists that she never bother his \"high-strung\" wife. The wife is surprised when her husband chides her supposed forgetfulness, but on a visit to a historic landmark, she cannot find an heirloom brooch he gave her, although it was stored safely in her handbag. She is plagued by noises coming from the boarded-up attic, and notices the gaslights dimming for no apparent reason when her husband is not home, which he assures her is only her imagination. Her husband flirts with the maid, whose disgust for his wife only worsens her nerves. Her anxious behavior is noticed by a detective, a childhood admirer of her aunt. Struck by her resemblance to her aunt, the detective attempts to reopen the cold case, discovering that a gift of royal jewels was not recovered after the murder. Isolating his wife from the world, the husband convinces her that she is a kleptomaniac, responsible for hiding a painting, and is too unwell to be in public. Unable to prevent her from attending a party hosted by her old family friend, the husband accuses his wife of stealing his pocket watch. When he \"finds\" it in her handbag, she becomes hysterical in front of the guests. Taking her home, he angrily claims that her mother died in an asylum, and that the letter she discovered never existed. Doubting her own sanity, she breaks down. Meanwhile, the detective has recruited a patrolman to watch her husband, who they learn often visits an abandoned house nearby, and is planning to institutionalize his wife. While her husband is out, the detective offers her his help, confirming that the attic noises and flickering gaslights are indeed real. He deduces that her husband has been entering his own attic through a skylight via the neighboring vacant house, to search through the aunt's belongings. When he lights the attic lights, the gas to the downstairs lights is reduced. The detective pries open her husband's desk, and she finds the letter that her husband insisted was a delusion. Her husband is actually the same man who murdered her aunt but was interrupted before he could find her jewels. His marriage was a scheme to gain access to her aunt's home, followed by a cunning strategy to have her institutionalized and so gain full access to the estate. At the same time, he discovers the jewels hidden in plain sight, sewn into one of the aunt's famous costumes. He returns downstairs to find his desk unlocked. He questions the mentally exhausted wife, who admits the desk was opened by a man that was visiting her. To protect her, the kindly cook denies seeing any man and assures her husband that this was merely a figment of her imagination, driving her to despair. The detective appears and confronts her husband, chasing him into the attic and tying him to a chair. Finally convinced of her own sanity, she is left alone with her husband, who urges her to cut him free. Instead, she taunts him, musing that the knife in her hand might not be real and also finding the \"missing\" brooch. As the police drive her husband away, the detective expresses interest in seeing her again."
}