{
  "obfuscated_plot": "Father John, an incoming priest from a Midwestern city, is transferred to a Catholic church in a large city. On his first day, his unconventional style gets him into a series of mishaps; his informal appearance and casual attitude initially make a poor impression with the elder priest, Father Thomas. The very traditional Thomas is further put off by John's recreational habits – particularly his golf-playing – and his friendship with the even more casual Father Michael. Michael tricks John into revealing that he was actually sent by the bishop to replace Thomas and take charge of the parish's affairs, with Thomas remaining on as pastor. To spare Thomas's feelings, John pretends that he was sent to serve as the elderly priest's assistant. The difference between John and Thomas's styles is openly apparent as they deal with events like a parishioner being evicted and a young woman named Mary having run away from home. The most consequential difference arises in their handling of the church youth, many of whom consistently get into trouble with the law in a gang led by a young man named Robert. Thomas is inclined to look the other way, siding with the boys because of their frequent church attendance. John wants to help the boys improve their lives, befriending Robert and eventually convincing the boys to form a church choir. The noise of the practicing choir annoys Thomas, who goes to the bishop and asks for John to be transferred to another parish. In the course of their conversation, Thomas realizes the bishop sent John to take charge of the parish. To avoid an uncomfortable situation, Thomas asks the bishop to put John in charge, and then, resigned to his fate, he informs John of his new role. Distressed, Thomas goes walking in a rainstorm for several hours and returns late that night. John puts the older priest to bed, and the two finally begin to bond. They discuss Thomas's long unfulfilled desire to go to his home country to visit his mother, now over 90 years old. John puts Thomas to sleep with a traditional lullaby. John runs into Sarah, an old girlfriend whom he left to join the priesthood. Sarah now has a successful career singing with a major opera company, under a stage name. As she prepares to go onstage in a performance, the two discuss their past, and she learns that her world travels with a previous opera company caused her to miss John's letter explaining he had entered the priesthood. John next pays a visit to Mary, now suspected of living in sin with David, the son of the church's mortgage holder. John describes to the young couple his calling in life, to follow the joyous side of religion and lead others to do the same, expressed through his musical composition. When David is later confronted by his father, the father discovers that he and Mary have married, and he has joined the military. Sarah visits John at the church, sees the boys' choir, and reads the sheet music of his composition. She, John, and Michael devise a plan to rent out a major opera house, have the choir perform the song with a full orchestra, then sell the publishing rights, saving the church from its financial woes. When a music executive brought on to hear the song does not believe it will sell, the choir decides to make the most of its opportunity on the grand stage, and sings another song. The executive overhears the song and wants to buy it, providing enough money to pay off the church's mortgage. With everything settled, John is transferred to a new assignment; Michael will be Thomas's new assistant, with Robert in charge of the choir. However, the church is damaged by a massive fire. On a holiday evening, parishioners gather in a temporary church for a service that also serves as John's farewell. As a parting gesture, John has sent for Thomas's mother from her home country. As mother and son embrace for the first time in 45 years, the choir sings the traditional lullaby, as Father John quietly slips away into the night."
}