{
  "obfuscated_plot": "Two naval enlisted men, Joe and Clarence, have a four-day leave in a coastal city, which they decide to spend in an entertainment industry hub. Joe has his heart set on making up for eight months at sea with his girl, Laura. Clarence, a shy choir boy turned sailor, asks Joe to teach him how to meet girls. A little boy who wants to join the navy is found wandering around the boulevard by a policeman, who takes him to the station. The boy refuses to tell the police his name and where he lives, so sailors Clarence and Joe are brought in to help convince the little boy to go home. After the two sailors take the boy to his house, Joe is eager to spend the evening with Laura, but the boy insists they stay until his Aunt Sarah arrives. Clarence is smitten with the beautiful, demure young woman. Sarah goes on to tell them that she has been working as an extra in movies and trying to become a singer. She longs to perform with a famous pianist and conductor. Trying to impress Sarah with Clarence, Joe lies that Clarence is a personal friend of the conductor, and can arrange an audition for her. Later, the three go out to the restaurant where Sarah works. Clarence meets a waitress from a large eastern city and they are attracted to each other. The next day, Joe visits the boy's school and tells the kids the story of how he earned his medal, by bringing happiness to a lonesome young king, portrayed by an animated mouse character, and joy to his kingdom where music had been forbidden. Meanwhile, Clarence and Joe attempt to meet the conductor at a major film studio, a famous concert venue and his home, but all fall flat. When all hope seems lost, the pair decide to come clean with Sarah and tell her there is no audition, but she is so grateful and happy, they are unable to do so. On their last day of leave, Sarah runs into the conductor in the studio commissary, who knows nothing of her and the audition. Sarah realizes the situation and is devastated; she tells him the whole story. Taken with her charm, beauty, and sincerity, the conductor agrees to give her a screen test, which turns out to be a success. The movie ends with the conductor leading a military band while its choir sings a naval anthem and Joe and Sarah, and Clarence and the eastern city waitress, kiss."
}