{
  "obfuscated_plot": "Three returning World War II veterans meet on a flight to their midwestern hometown: a bombardier captain, a navy petty officer, and an army sergeant. Each had left a very different life behind: the bombardier had been a drugstore soda jerk who lived with his parents on the wrong side of the tracks. Before shipping out, he married a gold-digger after a whirlwind romance. His wife has since been working in a nightclub to fill her time despite his generous combat pay. The army sergeant was an executive at a bank and lived in a luxury apartment with his wife and their teenage children. The navy petty officer was a star high school athlete living with his middle-class parents and younger sister. He had also been dating his next-door neighbor, whom he intended to marry upon his return from the war.\n\nEach man faces challenges integrating back into civilian life. The navy petty officer lost both hands in the war and, though functional with mechanical hooks, cannot believe his girlfriend will still want to marry him. The army sergeant, tired and jaded from the war, returns to the bank and is given a promotion but wrestles with alcohol. The bombardier, though highly decorated, suffers from PTSD flashbacks by night.\n\nHe arrives home and cannot locate his party girl wife. The sergeant's family invites the bombardier along with them for the evening. An inebriated bombardier keeps asking the sergeant's daughter who she is. When he cannot get into his apartment, the family offers him a bed for the night. The daughter calms him during a nightmare, and they gradually become attracted to each other.\n\nThe navy petty officer demonstrates to his girlfriend how she will need to assist him at bedtime when he removes his prosthetic hands. She reaffirms her love and commitment. The army sergeant struggles with re-entry, criticizing the bank's policies in a drunken speech about veterans' treatment.\n\nWith limited job prospects, the bombardier returns to his old drugstore job. His attraction to the sergeant's daughter grows stronger, creating tension with her father. After defending the navy petty officer from a critical customer, the bombardier is fired. His wife decides to divorce him, seeing no future together.\n\nBitter and feeling directionless, the bombardier visits an aircraft boneyard. A work crew foreman tells him the planes are being demolished for prefab housing, and the bombardier finds a new job in this emerging industry.\n\nAt the navy petty officer's wedding, where the bombardier serves as best man, he reunites with the sergeant's daughter. Now divorced, he expresses his love and concerns about their financial future. Her smile and their kiss suggest a hopeful beginning together."
}