{
  "obfuscated_plot": "On a winter holiday eve in a mid-20th century small town, a struggling businessman contemplates suicide. The prayers of his family and friends reach Heaven, where a guardian angel is assigned to save him and earn his wings. The angel is shown flashbacks of the man's life. He watches the protagonist rescue his younger brother from drowning in a frozen pond as a child, leaving him with hearing loss. The protagonist later saves a local pharmacist from accidentally poisoning a customer. In the late 1920s, he plans a world tour before college. He is reintroduced to a childhood friend who has loved him since youth. When his father dies from a stroke, he postpones his travel to settle the family business, a small financial institution. A wealthy, avaricious board member who owns most of the town seeks to dissolve the company, but the board of directors votes to keep it open if the protagonist runs it. He works alongside his uncle, giving his tuition savings to his brother with the understanding that his brother will take over the company when he graduates. His brother returns from college married and with a job offer, and the protagonist resigns himself to running the financial institution.\n\nThe protagonist and his childhood friend marry and abandon their honeymoon to use their savings to keep the company solvent during a bank run. Under his leadership, the company establishes an affordable housing development surpassing the wealthy board member's overpriced slums. The board member tries to entice the protagonist with a high-paying job, but he refuses when he realizes the true intention is to close the financial institution.\n\nOn a holiday eve, the town prepares to welcome the protagonist's brother home as a decorated war hero. The uncle goes to the bank to deposit a significant sum of money but accidentally loses it. With a bank examiner reviewing the records, the protagonist frantically tries to find the missing money. Frustrated and angered by his uncle's mistake, which may lead to scandal and jail, he resents the sacrifices he has made. He appeals to the wealthy board member for a loan but is rejected. Contemplating suicide, he goes to a bridge. Before he can jump, a mysterious stranger dives into the river and he rescues him.\n\nWhen the protagonist wishes he had never been born, the stranger takes him into an alternate timeline where he does not exist. He finds the town transformed into a seedy, run-down place. Key people in his life are either dead, institutionalized, or dramatically different. Realizing the profound impact of his existence, he begs to have his life back.\n\nHis wish granted, he happily returns home. His wife and uncle rally the townspeople, who donate enough to replace the missing money. His brother arrives and celebrates him. Among the donations, he finds a book with an inscription about friendship. As the gathered crowd sings, his young daughter remarks about angels earning their wings when a bell rings."
}