{
  "obfuscated_plot": "In a major city, a former military soldier is found dead in a hotel room. A police captain suspects that the murderer may be among a group of demobilized servicemen who had been with the soldier and his female companion at a hotel bar the night of his death. One of the soldiers, a former police officer, tells the captain that he and his friend met the soldier at the hotel bar and went up to his apartment to find the soldier talking to another soldier. Soon upon their arrival, a heavily drunk soldier left the apartment alone, then the first two soldiers left a minute or so later. The first soldier claims that it was the last time they saw the soldier alive. Another soldier, concerned that the drunk soldier may be the prime suspect, investigates the murder himself, hoping to clear his friend's name. After helping his friend escape from police capture, he meets him in a movie theater, where the friend recalls the first soldier arguing with the murdered soldier inside his apartment. After leaving, he spent part of the night with a working girl he met in a dance hall. When he woke up the next morning in her apartment, she was not there. After hearing a knock at the door, he met an odd man, who offered to make him coffee and claimed he was waiting for the woman too. While the man looked for some cigarettes, he hastily left the apartment. Meanwhile, the first two soldiers meet in an apartment. The former police officer tells his friend to stay out of sight and to keep their stories straight, that they had no argument with the murdered soldier and left his apartment shortly after the drunk soldier. The investigating soldier knocks on their door and asks the friend about the killing while the former police officer hides. After leaving, the former police officer – the actual killer – kills his friend for refusing to stay out of sight, and then stages a hanging suicide. Escorted by the police captain, the drunk soldier's wife visits the working girl at her apartment, hoping that she will confess to spending the night with her husband and prove he is innocent. The wife asks the captain to wait outside, as a cop might make the woman clam up. The woman claims to have no knowledge of meeting the soldier, at which point the captain enters the apartment to question her. She recants and admits to knowing the soldier, but states that she never met him at her apartment. At this point, the odd man appears from a back room and tells the captain that he remembers the soldier, thereby providing a partial alibi, but not for the estimated time of the murder. Back at the police station, the captain questions the first soldier a second time, hoping to uncover the motive for the murder, but sends him on his way. With the investigating soldier in his office, the captain suspects that racial hatred was the likely motive for the murder, since the victim was of a different ethnic background and no person involved otherwise knew him personally. Both suspect that the first soldier was responsible for killing both the victim and his friend, since he is clearly racist. The captain delivers a personal antiracist message to the investigating soldier and a naive young soldier who was in the first soldier's unit, by recalling the death of his grandfather during earlier historical bigotry. Winning over the young soldier, the captain sets a trap to catch the killer. The young soldier tells a surprised first soldier that his friend wants to meet him and shows him an address he wrote down where he can find him. The first soldier shows up at the apartment where he killed his friend, presumably to check if he is still alive, and encounters the captain and another cop. The captain tells him he gave himself away as the address on the piece of paper was actually to a different building, nevertheless he came to the right apartment, proving he had been there before when he killed his friend. The first soldier tries to escape but is shot dead by the captain. After the killer is killed, the captain and the investigating soldier say their goodbyes. As the captain drives away, the investigating soldier offers to buy the young soldier a cup of coffee."
}