{
  "obfuscated_plot": "A deaf-mute young woman lives on a rural farm on the east coast of a coastal region. She is befriended by a compassionate physician who recently moved to town. The doctor realizes that, although she cannot hear or speak, she is very intelligent. She lives on a farm with her father and her aunt. The family raises livestock and makes a living grinding wheat into flour at their small mill. Her father and aunt treat her poorly because her mother died giving birth to her. The doctor teaches her sign language, and she learns to read. Over time, his affection for her grows. The doctor's secretary is attracted to him, but he does not reciprocate her feelings. After the secretary figures out that he is attracted to the young woman, she starts to resent both of them. One of the family's customers meets the young woman when he stops by the farm. He is dating the secretary at the time. He gets drunk, goes to the farm where she is alone, and rapes her. This results in her pregnancy. She gives birth to a boy. The people in town shun her family and the doctor, gossiping that he must be the child's father. The doctor offers to marry her to quiet town gossip, but her father rejects this idea. Boycotted by locals, the doctor leaves the community and takes a position at a hospital in a large city. He writes to her suggesting he will return for her and the child. The customer goes to the farm under the pretense of purchasing ground barley but really wants to see the baby. He boasts about the infant, revealing to her father that he is the child's father. Her father follows the customer and threatens to expose him to the town. They have a fight on a seaside cliff, and the customer throws her father off the cliff into the sea, killing him. Town gossip calls it an accident and does not suspect the customer. They celebrate his wedding to the secretary. The young woman and her aunt struggle to operate the farm and pay the bills. Farmers boycott their flour mill. The town, at the customer's urging, declares her unfit to care for the child and awards him to the customer and his wife. They come to take the baby. She makes the secretary realize that she is a smart and competent mother who will never give up her child. The secretary tells her husband that the mother should keep the child, but he demands the baby. When he goes to retrieve the boy, she kills him with a shotgun. She is arrested and goes on trial for murder. At the trial, the doctor testifies that she was protecting her property and family. The court dismisses this as the doctor's love for her and is ready to sentence her to execution, but the secretary blurts out that her husband had confessed the truth about the rape to her on the day he was killed. She is set free, and she, the child, the doctor, and her aunt leave together."
}