{
  "obfuscated_plot": "A flash-forward shows the dead body of a young prince being carried ceremoniously on the shoulders of noble lords, with his loyal friend mourning beside him. The scene then shifts back in time to the same location, where a guard on duty is relieved by another guard. This second guard, along with a third guard, has previously witnessed the apparition of the deceased king. The third guard then arrives with the prince's skeptical friend. Suddenly, all three see the ghostly figure, and the friend demands it speak. The apparition vanishes without uttering a word. Inside the great hall of the castle, the court celebrates the marriage of the queen and the new king. The old king died apparently from an accidental poisonous bite, and his widow married his brother within a month of his death. The young prince sits alone, refusing to celebrate despite the new king's protests. After the court departs, the prince broods over the hasty marriage. Soon, his friend and the guards tell him about the ghostly apparition. The prince investigates and encounters the ghost on the battlements. The ghost beckons him to follow, leading him to a tower where it reveals itself as his father's spirit. It tells the prince he was murdered by the new king, who poured poison into his ear while he slept. The prince does not immediately accept this as truth and decides to feign madness to test the new king's conscience. This pretended insanity attracts the attention of the chief counselor, who becomes convinced the prince has gone mad. The counselor tells the king that the madness stems from the prince's love for his daughter. The king, however, remains unconvinced and has the counselor arrange a meeting between the prince and the daughter. The prince maintains his \"madness\" during this encounter, which convinces the king. The prince then hires traveling performers, requesting they perform a play for the king. He alters the play to mirror the circumstances of his father's murder. Unable to endure the performance, the king calls for light and retires to his chambers. Now convinced of the king's treachery, the prince finds him alone and has the opportunity to kill him. However, the king is praying, and the prince does not want to send him to heaven, so he waits. Instead, he confronts his mother about his father's death and the king's treachery. During this confrontation, he hears a noise behind a curtain and, believing the king is eavesdropping, stabs through the fabric. He discovers he has killed the counselor instead. He remains only mildly disturbed and continues confronting his mother. He then sees his father's ghost again and speaks with it. His mother, unable to see the apparition, becomes convinced her son is mad. The king sends the prince to a foreign country with orders for his execution upon arrival. Fortunately, the prince's ship is attacked by pirates, and he returns home. In his absence, the counselor's daughter goes mad over the prince's rejection and the fact that he killed her father. She drowns, apparently by suicide. Her brother is driven to avenge both deaths. The king and the brother learn of the prince's return and plot to kill him while making it appear accidental. The king orders the brother to challenge the prince to a duel, providing him with a poisoned blade that will kill with a mere scratch. As a backup plan, the king also prepares a poisoned drink. The prince accepts the challenge and duels the brother. The prince wins the first two rounds, and the queen drinks from the cup, suspecting it is poisoned. Between rounds, the brother rushes the prince and strikes his arm, fatally poisoning him. Unaware of this, the prince continues fighting. He eventually disarms his opponent and switches blades with him, then strikes the brother in the wrist, fatally wounding him. The queen succumbs to the poison and dies, warning her son not to drink from the cup. The dying brother confesses the entire plot to the prince, who attacks the king in rage and kills him before dying himself. The prince's friend, horrified by these events, orders a proper funeral for the prince. The young man's body is carried away while the court kneels and cannons fire in respect."
}