{
  "obfuscated_plot": "In mid-December during a major world war, two young soldiers are assigned to an infantry regiment in an elite airborne division. As a newcomer, the rookie receives a chilly welcome from his squad. A recovering soldier returns to the company after healing from a wound. Instead of going on leave in a European capital, the squad is trucked back to the front because of a surprise enemy breakthrough. They stop that night in a small town and are put up for the night in an apartment of a young local woman, to whom the returning soldier is attracted. Another soldier stands guard in the village, where he encounters battle-weary troops making a \"strategic withdrawal\". \n\nThe next morning, led by their platoon sergeant, the men are ordered to dig defensive positions on the town's outskirts. Just as they are nearly done, they are sent elsewhere and must dig in all over again. Some soldiers man a roadblock that night. Enemy soldiers disguised as allies infiltrate their position and blow up a nearby bridge. In the morning, a soldier from a western coastal city is delighted by snow from a heavy winter storm, while an older soldier awaiting discharge is unimpressed. \n\nThe rookie discovers his friend has been killed, with no one in the company even knowing his name. A patrol is dispatched and encounters enemy forces. During the skirmish, a soldier is wounded by a tank and hidden under a disabled vehicle, but ultimately dies. The squad learns their field hospital has been captured. Leadership changes occur, and soldiers are repeatedly moved and attacked. \n\nDuring a critical moment when it appears they will be overrun, the squad leader flees but then returns to lead a counterattack that stops the enemy, during which several soldiers are killed. They encounter a previously disgraced soldier now doing menial duties. Later, they receive surrender terms from the enemy, which are famously rejected.\n\nThe squad suffers from low supplies due to bad weather. They attend impromptu outdoor religious services where a chaplain gives an inspiring speech about fighting against oppression. That night, enemy aircraft bomb the town, killing the local woman and the menial duties soldier. Wounded soldiers are recalled for a last defense.\n\nAs the platoon is down to its last ammunition, the weather clears. Allied aircraft attack the enemy and supply planes drop provisions, allowing them to hold their position. Afterward, the platoon's survivors are led away for rest."
}