{
  "obfuscated_plot": "A reporter is sent on assignment to write about a local politician running for county treasurer in a Southern state. The politician's campaign focuses on exposing corruption among local political leaders. The reporter meets the candidate and his family, writing an inspiring story about his honesty. The local political machine uses its power to prevent the candidate from winning.\n\nAfter losing the election, the candidate earns a law degree. When a poorly-constructed school in the county experiences a structural collapse that kills several students, he wins a lawsuit that leads to a state-wide investigation. He uses this momentum to build his political profile and is drafted as a spoiler candidate in a gubernatorial race.\n\nInitially struggling on the campaign trail, the candidate begins to give more passionate speeches after learning he was meant to be a secondary candidate. He loses the first election but gains significant rural support. Over the next four years, he learns political maneuvering and builds influence through backroom deals.\n\nThe reporter becomes his campaign researcher, helping to convince local supporters by promising political appointments. The candidate wins the election in a landslide and begins using power aggressively. He covers up scandals and becomes increasingly corrupt, alienating his original supporters.\n\nHis personal life unravels as he has affairs and pressures his adopted son, who eventually becomes paralyzed after a serious injury during a football game. A respected local judge publicly exposes the politician's corruption, leading to an impeachment trial.\n\nDuring a dramatic confrontation, the judge commits suicide. At a public victory celebration, the politician is mortally shot by the brother of a woman he was involved with, who believes the politician manipulated his way into power through personal relationships.\n\nThe reporter, having lost respect for the politician, seeks to further expose his reputation even after his death. The politician dies on the steps of the state capitol, lamenting his lost potential and wondering about his downfall."
}