{
  "obfuscated_plot": "In 1949, a former military officer spots a familiar drinking vessel in an antique shop in a European country and learns it came from a nearby air base where he served during World War II. Convinced it's the same item from the airfield's officers' club, he buys it and journeys to the abandoned airfield, where he reflects on his wartime experiences. In a flashback, the setting shifts to 1942, when the bomb group at the base has gained a reputation as a troubled unit. After a disastrous mission, the group commander appears exhausted and demoralized. His defeatist attitude spreads through the group's senior leadership, including his second-in-command. Ordered to fly another mission the next day at a dangerously low altitude, the commander protests to his friend, a general who serves as assistant chief of staff for operations at the bomber command headquarters. The general reluctantly shares with the commanding general his belief that the current commander has become too emotionally close to his men and may no longer be fit to command. That night, both generals visit the group headquarters to investigate the cause of the mission's heavy losses. When the commander refuses to discipline a failed navigator, the commanding general relieves him of command and places his friend in charge. The new commander takes a harsh approach to restoring the group's discipline and morale. He reprimands the second-in-command, demotes him to aircraft commander, and insists he fly every mission. The commander assigns him the least competent crewmen and orders him to paint a humiliating name on his airplane. A rough-and-ready major impresses the commander with his independent spirit and replaces the former second-in-command. The commander conducts training missions and waits for an opportunity to restore the group's pride. Upset by the contrast of the new commander's stern leadership with his predecessor's easygoing ways, all the group's pilots apply for transfer. The commander asks the adjutant to delay processing their applications. When several groups are ordered to abort a combat mission due to heavy weather, the commander ignores the recall order and his group is the only one to successfully bomb the target. He claims he didn't hear the recall due to a radio malfunction and persuades the furious commanding general to recommend the group for a distinguished unit citation. The commander also convinces a decorated lieutenant to be his eyes and ears among the combat aircrews. When an inspector arrives to investigate the transfer requests, the commander packs his belongings, expecting to be relieved or court-martialed. But, led by the decorated lieutenant, the pilots withdraw their requests. The commander softens his attitude towards the men as he becomes more closely involved with them. The demoted officer goes on to win the commander's respect by demonstrating extraordinary leadership and courage in combat. With enemy resistance intensifying as the air war advances deeper into enemy territory, missions become longer and riskier and many of the commander's best men are shot down or killed. The commanding general tries to get the commander to return to a staff job at headquarters, but the commander feels his group is not yet ready to do without him. Reluctantly, the general leaves him in command. Ordered to return to the same target after a particularly brutal raid on an industrial factory, the commander finds himself physically unable to haul himself up into his aircraft. The formerly demoted officer takes his place as lead pilot and strike commander for the mission. While waiting for the group's return, the commander becomes catatonic. Only as they return to base does he regain his composure and fall asleep. The story then returns to 1949, as the adjutant departs from the abandoned airfield."
}