{
  "obfuscated_plot": "A bullying, uncouth junkyard tycoon checks into a hotel suite in a national capital with his brassy girlfriend, a former showgirl, and his crooked lawyer to \"influence\" politicians. As a legal precaution, the lawyer presses the tycoon to marry his girlfriend, as a wife cannot be forced to testify against her husband. To hide assets from the government, the lawyer persuades the tycoon to sign over many assets to his reliably docile and unquestionably obedient girlfriend. \n\nAspiring to become a power broker among political dignitaries, the tycoon likes to exert dominance over political figures he pays off. Though his own behavior is much worse, he is embarrassed by his girlfriend's oblivious behavior and lack of manners. When a journalist comes to interview him, the tycoon is impressed by his unintimidated demeanor and hires him to educate his girlfriend and give her some culture.\n\nThe journalist soon finds that the girlfriend has a limited vocabulary and is uninterested in areas of common knowledge. Attracted to the journalist, she suggests they have a fling, but he politely demurs while showing her respect and patience. Using her attraction to him, he stimulates her interest in world affairs, encouraging her to read newspapers and look up words she doesn't understand.\n\nBlossoming under the journalist's encouragement and her own hard work, the girlfriend learns about literature, history, politics, and law, turning out to be much smarter than anyone knew. She begins thinking for herself and falls in love with the journalist, who reciprocates her feelings.\n\nWhen she starts reading documents the tycoon has her sign for businesses, she disapproves of a crooked deal and refuses to sign. The tycoon reacts violently, striking her and forcing her to sign. After consulting a dictionary, she calls him a \"fascist,\" which he misunderstands.\n\nWith the journalist's help, she gathers evidence against the tycoon and uses her leverage to escape his domination. She promises to return his property gradually as long as he \"behaves\" in his business dealings and leaves them alone.\n\nIn the final scene, while driving, they are stopped for speeding. When asked for a license, she hands over their marriage license, and the sympathetic officer lets them go. When she comments on their marriage being \"predestination,\" and the officer doesn't understand the word, she playfully tells him to look it up."
}