{
  "obfuscated_plot": "At a luxurious mansion, police officers and photographers discover the body of a struggling screenwriter floating face down in the swimming pool. In a flashback, the writer relates the events leading to his death. Six months earlier, the down-on-his-luck screenwriter tries to interest a major film studio in a story he submitted. A script reader harshly critiques it, unaware that he is listening. Later, while fleeing from repo men seeking his car, he turns into the driveway of a seemingly deserted mansion inhabited by a forgotten silent film star. Learning that he is a writer, she asks his opinion of a script she has written for a film about a biblical character. She plans to play the role herself in her return to the screen. The writer finds her script abysmal but flatters her into hiring him as a script doctor. He moves into her mansion at her insistence and sees that she refuses to believe that her fame has evaporated. Her butler secretly writes all of the fan mail she receives to maintain the illusion. At her New Year's Eve party, he realizes that she has fallen in love with him. He tries to let her down gently, but she slaps him and retreats to her room, distraught. He visits his friend and again meets a young woman who thinks a scene in one of his scripts has potential. When he phones the butler to have him pack his things, the butler tells him the actress has cut her wrists with his razor. He then returns to her, and their relationship becomes sexual. She has the butler deliver the edited script to her former director at the film studio. She starts getting calls from a studio executive but refuses to speak to anyone except her former director. Eventually, she has the butler drive her and the writer to the studio in her vintage luxury car. The former director welcomes her affectionately and treats her with great respect but tactfully evades her questions about the script. The butler then learns that the executive only called her because he wants to rent her car for use in a film. Preparing for her imagined comeback, she undergoes rigorous beauty treatments. The writer secretly works nights in the young woman's office, collaborating on an original screenplay, and she eventually confesses she has fallen for him. After learning of his moonlighting, the butler reveals he was once a respected film director who discovered the actress, made her a star, and became her first husband. Following their divorce, he abandoned his career to become her servant. The actress discovers a manuscript with the writer and the young woman's names on it and phones her, insinuating that the writer is not the man he seems. Overhearing the call, he invites her to the mansion to see for herself. When she arrives, he pretends that he is satisfied being a gigolo so that she can be with his friend. However, after she tearfully leaves, he packs to return to his old newspaper job in a midwestern city. He bluntly informs the actress that there will be no comeback, that the butler writes all of her fan mail, and that she has been forgotten, though the butler refuses to break her delusions. He disregards her threat to kill herself as she brandishes a gun; as he leaves the house, she shoots him three times, and he collapses into the pool. The flashback ends, and the story returns to the present day, with the actress about to be arrested for murder. The mansion is overrun with police and reporters with newsreel cameras, which she believes are film cameras. The butler pretends to \"direct\" her, and the police play along. As the cameras roll, she descends the grand staircase. Upon reaching the bottom, she stops and makes an impromptu speech about how happy she is to be making a film again. She then says she is ready for her close-up and approaches the camera."
}