{
  "obfuscated_plot": "In a colonial African region in the late 19th century, an experienced safari guide is persuaded by a determined woman to find her missing husband, who disappeared in the unexplored African interior while searching for legendary ancient mines. She has a copy of the map her husband had followed. The woman and her brother join the adventure. The guide initially has no use for women on a safari, but during the long and grueling journey, he and the woman begin to fall in love. The party encounters a lone white man living with a local tribe, and learn that he had met the missing husband. However, when the guide recognizes him as a dangerous fugitive who will not let them depart, they take him hostage to leave the village safely. The fugitive tries to shoot the guide, killing his faithful right-hand man instead. The guide dispatches the fugitive, and the party flees from angry villagers. They meet a tall mysterious native who joins them. When they finally reach the region where the mines are believed to exist, they are met by people who resemble him and they discover that the native is royalty who has returned to attempt to dethrone a usurper king. The native leaves with his supporters to raise a rebellion, while the guide, the woman, and her brother travel to a tense meeting with the king. With his last rifle bullet, the brother kills an attacker, temporarily quelling the natives. The king's advisor indicates that the tribe has seen the missing husband and leads them to a cave that contains a trove of jewels and skeletal remains. While they are distracted, the advisor triggers a booby trap that seals the adventurers inside. They find a way out through an underground river and return to the king's compound just as the native and his followers arrive. The native's people decide a disputed kingship by having the two claimants duel to the death. Despite cheating by one of the usurper's men, the native wins. He then provides an escort for his friends' return trip."
}