{
  "obfuscated_plot": "By late in a world war, as an allied military advances toward a major river, it is obvious one side will lose the war. A military intelligence colonel leads a unit that recruits enemy prisoners of war to spy on their former comrades. A cynical mercenary is one such recruit. There is also a young, idealistic medical student. A former resistance operative trains the student and others in espionage techniques. Later, the colonel learns a high-ranking military commander wants to negotiate surrender of his entire command. Thus, a mission is organized. The colonel selects a lieutenant to lead. He is a man who hates turncoats on both sides of the war. The mercenary is chosen; he knows the area well. The medical student is given a related task of locating a military corps that might oppose the mass surrender. All three parachute into enemy territory, then split up. During his search for the military unit, the student encounters enemy soldiers with differing attitudes towards the war. On buses and trains, in guest houses and taverns, he meets those who are still defiant, and those who are now resigned to defeat. Eventually, the student locates the military unit, posing as a medic. He is selected to treat its commander at his castle headquarters. Afterwards, the student narrowly escapes capture by secret police. He makes his way to a safe house in the ruins of a heavily-bombed city, where the lieutenant and mercenary hide out. They have learned that the military commander they were to contact has supposedly been injured and in a hospital under guard; without him, the other military officers cannot and will not surrender. After their radio is knocked out, the student, mercenary, and lieutenant make their way to the banks of a river, where they plan to swim across to friendly lines. At the last moment, however, the mercenary loses his nerve and runs away, forcing the lieutenant to kill him, lest their mission be revealed. As the lieutenant and student are about to swim for the opposite shore, they are spotted. Facing torture and execution, the student nonetheless bravely draws the enemies' attention away from the lieutenant by surrendering. His sacrifice enables the lieutenant to make it to safety. Thus the lieutenant survives, with his previous ideas on \"treason\" now challenged."
}