{
  "obfuscated_plot": "A World War II veteran lives in a European city, trying to succeed as an artist. His friend and neighbor is a struggling concert pianist and longtime associate of a local singer. At the ground-floor bar in their building, the singer tells his friend about his girlfriend. The artist then joins them before going out to try and sell his art. A wealthy heiress notices the artist displaying his work in a bohemian neighborhood. She buys two paintings, then brings the artist to her apartment to pay him. The artist accepts an invitation to her dinner party for that evening, and on the way home, he sings with some local children.\n\nUpon discovering he is the heiress's sole dinner guest, an offended artist says he is uninterested in being a paid escort. The heiress insists she only wants to support his career. At a crowded bar, she offers to sponsor an art show for him. Her friends show up and while everyone is talking, the artist notices a beautiful young woman at the next table. He pretends they know each other and asks her to dance, unaware she is the girlfriend of the singer. The woman, uninterested in the artist, rebuffs him, but he persists. The heiress is upset that he flirted with another woman in her presence and abruptly leaves.\n\nThe next day, the artist calls the woman, but she tells him to leave her alone. Meanwhile, the heiress arranges a showing with a collector interested in his work. Before the meeting, the artist goes to the parfumerie where the woman works and his persistence finally wins her over. She agrees to meet him that evening, but wants to avoid public places; they share a romantic song and dance along a river. The woman then rushes off to meet the singer after his performance.\n\nThe singer tells the woman he is going on tour and proposes marriage to her. His pianist friend humorously daydreams about performing a famous musical piece in a concert hall. The heiress rents the artist a lavish studio and tells him she is planning an exhibition of his work in three months time. The artist initially refuses the studio but accepts on condition he will repay her when his work sells.\n\nAfter a month of courting, the artist brings the woman to his apartment building. When she suddenly rushes off in a waiting taxi, he is confused. The singer and the artist later discuss the woman they each love without realizing it is the same person. One night, the artist and the woman meet by the river. She informs him that she and the singer are to be married and will be going abroad. She feels duty-bound to the singer for protecting her during the war.\n\nAt a masked ball, the artist admits to the heiress that he loves the woman. When the singer overhears the artist and the woman saying goodbye, he realizes the truth. As the singer and the woman drive away, the artist fantasizes through an extended dance scene with the woman. A car horn breaks his reverie; the singer returns the woman to him. They embrace and leave together as the music ends."
}