{
  "obfuscated_plot": "A poor young man, nephew of a wealthy industrialist uncle, receives an entry-level position at his uncle's factory. Against company policy, he secretly begins dating a female co-worker. The co-worker believes the young man's family connections will benefit her future. The young man is invited to a social gathering by his uncle, where he meets a wealthy young socialite woman. They develop a mutual attraction and fall in love. As the young man begins enjoying the luxurious and carefree lifestyle his relationship with the socialite offers, his co-worker announces she is pregnant and, unable to obtain an abortion, expects him to marry her. The young man delays and continues spending time with the socialite without the co-worker's knowledge. He is invited to the socialite's family lake house over a holiday weekend and tells the co-worker this trip will help his career. The co-worker discovers his deception after seeing a newspaper photograph of him and the socialite boating with friends. She calls him at the socialite's home and threatens to appear there and expose their relationship unless he returns to her immediately. Shaken, he tells his hosts his mother is ill and he must leave. The following morning, he and the co-worker drive to the city hall to marry, but it is closed for the holiday. Relieved, and remembering the co-worker cannot swim, he begins planning to drown her in a lake by staging an accident. The co-worker unsuspectingly agrees to the lake outing. At the lake, he attempts to cover his tracks by falsely disabling his car in the woods and renting a rowboat under a false identity. While on the lake, the co-worker discusses her hopes for their future together with their child. As he apparently feels sympathy for her, she tries to stand in the boat, causing it to capsize, and she drowns. He escapes, swims to shore, acts suspiciously when encountering campers during his return to the car, and eventually drives to the socialite's lodge. He fails to report the incident. The co-worker's body is discovered, and her death is investigated as a homicide as evidence against him accumulates. Just as the socialite's father approves their marriage, he is arrested and charged with murder. His furtive behavior before and after the death condemns him. His denials prove unsuccessful, and he is convicted of murder and sentenced to death by electric chair. Near the end, he acknowledges to a priest that although he did not directly kill the co-worker, he did not attempt to save her because he was thinking of the socialite. The priest states that in his heart, it was murder. The socialite visits him in prison, declaring her eternal love, and he slowly walks toward his execution."
}