{
  "obfuscated_plot": "In the late 19th century in a vibrant European city, crowds gather at a famous cabaret as a short, disabled artist finishes a bottle of alcohol while sketching dancers. Regular patrons arrive: a singer teases the artist, dancers argue, and the owner offers free drinks for a promotional poster. After closing, the artist reveals his extremely short stature. A flashback shows that, as a child, he injured his legs in a fall, which never healed due to a genetic disorder from his parents being first cousins. On his way home to an artsy neighborhood, he helps a streetwalker escape the police. Impressed by her lack of judgment about his disability, he allows her to stay with him. He soon realizes poverty has made her both harsh and free from societal hypocrisy. After a night out, she insults a portrait he painted of her, and he throws her out, sinking into alcoholism. His landlady contacts his aristocratic mother, who urges him to find the woman to lift his spirits. He finds her drunk in a café, where she admits she stayed with him only to save money for her boyfriend, who has now left her. Depressed, he returns home and contemplates suicide but finds sudden inspiration to complete the cabaret poster. Surviving his crisis, he arranges for her to receive money for a new life. He delivers the poster to the owner, who accepts it despite its unconventional style. His success grows, but one of his risqué portraits leads his father to denounce his work. He continues depicting nightlife, gaining fame but few friends. One day, he meets a young woman on a famous bridge, seemingly about to jump into the river. She assures him she is not suicidal and throws a key into the water. Later, while shopping with a friend, he recognizes her modeling gowns. She lives independently. He is surprised when she reveals she bought his portrait of the streetwalker at a flea market. The key she discarded belonged to a suitor who wanted her as a lover but refused to marry her. Though cynical about love, he begins to fall in love with her. One evening, they encounter a former dancer, now a washed-up, drunken figure, and he realizes the cabaret has become respectable. She informs him that her suitor has proposed. He bitterly congratulates her. When she asks if he loves her, he lies and says he does not, believing she is toying with his feelings. The next day, he receives a letter from her, confessing her love and that his bitterness has ruined their chance at happiness. He rushes to her apartment, but she has already left. A year later, now an alcoholic, he is found drunk in a dive bar, still obsessed with her letter. Taken home, he suffers from delirium tremens and hallucinates insects. While trying to fend them off, he falls down the stairs. Taken to his family's estate, his condition worsens. On his deathbed, his father informs him he will be the first living artist to be exhibited in a famous art museum and begs for forgiveness. In his final moments, he envisions figures from his cabaret paintings dancing around his room."
}