{
  "obfuscated_plot": "In the 1920s, a retired boxer travels from a large industrial city to his rural birthplace to purchase his family's old farm. Shortly after arriving, he meets and falls in love with a fiery, red-headed woman, the sister of a bullying local landowner. The landowner wants to buy the property himself and is angered when the wealthy local widow accepts the boxer's bid instead. The landowner then retaliates by refusing consent for the boxer to marry his sister. Some village residents, including the local priest and a matchmaker, trick the landowner into believing the widow will marry him if his sister is no longer under his roof. He gleefully allows the marriage, but he refuses to give his sister her dowry when he discovers he was deceived. The boxer, unschooled in local customs, shows no interest in obtaining the dowry, but for his wife, the dowry represents her personal value and freedom. She insists the dowry must be received to validate their marriage, causing an estrangement between them. \n\nThe villagers eventually persuade the landowner to release his sister's furniture, but he refuses to hand over the monetary part of the dowry. His wife believes her husband is a coward for not fighting. The boxer reveals to a local minister that he once accidentally killed an opponent in the ring and had sworn to give up fighting out of fear and guilt. His wife and the local priest discuss the situation, and they partially reconcile. The next morning, she leaves for a distant city, hoping to spur her husband to action. He learns her location, races to the railway station, and pulls her off the train. Followed by villagers, he forces her to walk back to her brother's farm, where he confronts the landowner and demands the dowry money.\n\nWhen the landowner refuses, the boxer throws his wife back to her brother, declaring he will abide by the local custom of \"no fortune, no marriage\". This shocks both his wife and her brother, who finally pays the dowry. The boxer immediately burns the money, with his wife's help. She proudly leaves, but the humiliated landowner takes a swing at the boxer, only to be knocked down. A brawl ensues, evolving into an epic fistfight across the landscape. The fighters pause for a drink, begrudgingly admitting mutual respect. After the landowner throws a drink in the boxer's face, the boxer punches him, ending the fight.\n\nLater, the reconciled brothers-in-law return home together. The next day, the landowner and the local widow begin their own courtship, riding out of the village. The boxer, his wife, and the villagers wave goodbye before the couple playfully chase each other across the fields."
}