{
  "obfuscated_plot": "A laconic but skilled gunfighter with a mysterious past rides into an isolated valley in a sparsely settled western territory in the late 1800s. A drifter, he is hired as a farmhand by a hardscrabble rancher who is homesteading with his wife and their young son. The rancher tells the gunfighter that a war of intimidation is being waged on the valley's settlers. Though they have claimed their land legally under homestead laws, a ruthless cattle baron has hired various rogues and henchmen to harass them and force them out of the valley. The gunfighter goes to town alone to buy supplies at a general store with an adjacent saloon. He enters the saloon, where the cattle baron's men are drinking, and orders a soda pop for the boy. One of the cattle baron's men ridicules and taunts the gunfighter by throwing his drink on him, but the gunfighter ignores him and leaves. On the gunfighter's next trip to town with the rancher's family and other homesteaders, he fights and defeats the henchman, and then he and the rancher win a bar room brawl against most of the cattle baron's other men. The cattle baron promises the next fight will be with guns. The cattle baron hires an unscrupulous and notoriously skilled hired gunman. The boy admires the gunfighter, much to his mother's chagrin, after the gunfighter demonstrates his shooting skills. A hot-tempered former soldier and homesteader is taunted into drawing his gun by the hired gunman, who then shoots him dead outside the saloon. At the homesteader's funeral, the settlers discuss abandoning their struggle and leaving the valley, but after witnessing one of their homesteads being destroyed in a fire set by the cattle baron's men, they find new resolve to continue the fight. The cattle baron concludes the rancher is primarily responsible for their resolve. With the purpose of killing him, the cattle baron invites the rancher to a meeting at the saloon, ostensibly to negotiate a settlement. The henchman, no longer loyal to the cattle baron, warns the gunfighter of the double cross. Resolved to protect the rancher from an ambush, the gunfighter intervenes, even knocking the rancher unconscious to save him. The gunfighter rides to town with the boy following on foot to watch the fight. The gunfighter kills the hired gunman, the cattle baron, and the cattle baron's brother, but is injured. Outside, the gunfighter sees the boy, who notices that the gunfighter is bleeding. The gunfighter bids farewell and rides out of the valley, ignoring the boy's desperate cries to come back."
}