{
  "obfuscated_plot": "In 1941, a military private who works as a bugler and was once a professional boxer transfers from one military base to a rifle company at another base on a Pacific island. A captain wants him on his regimental boxing team, but the private refuses absolutely, with no further explanation. Consequently, the captain makes the private's life miserable and ultimately orders a first sergeant to prepare a court-martial. The sergeant suggests doubling the private's company punishment as an alternative. The private is hazed by the other NCOs and is supported only by his close friend, another private. The two privates join a social club where the first private becomes attracted to a woman working there. He confides to her he quit boxing after blinding his sparring partner. At the club, his friend argues with a stockade sergeant. Later, at a local bar, the stockade sergeant provokes the friend and the two nearly come to blows before the first sergeant intervenes. Despite being warned, the first sergeant risks prison when he starts an affair with the captain's wife. Her marriage is unhappy and distant, made worse after the captain's drinking and infidelity resulted in the stillbirth of her only child and consequent infertility. The wife encourages the sergeant to become an officer, which would enable her to divorce her husband and marry him. The friend is sentenced to the stockade after walking off guard duty and getting drunk, subjecting him to the stockade sergeant's brutal treatment. The private discovers the woman's real name and learns her goal is to make enough money at the club to return to the mainland and marry. He tells her his career is in the military, and the two wonder whether they have a future together. A member of the captain's boxing team picks a fight with the private. The captain fails to stop it, which is noticed by the regimental commander. When the private prevails in the fight, the captain finally intervenes and is about to punish him again, but does nothing after learning the boxer started the fight. The friend escapes from the stockade after a brutal beating and dies in the private's arms. Seeking revenge, the private engages the stockade sergeant in a back alley knife fight. He kills him but is badly wounded and stays with the woman. The first sergeant covers for the private's absence. After initiating a review into the captain's conduct, the regimental commander orders his resignation in lieu of a court martial. The captain's replacement reprimands the other NCOs, demotes the boxer to private, and affirms there will be no more promotions through boxing. The wife tells the first sergeant that her husband's resignation is forcing them back to the mainland, but the sergeant reveals he has no interest in becoming an officer, effectively ending their relationship. He promises her that they will meet somewhere someday. On December 7, the Japanese attack a naval base. The first sergeant takes command, orders coffee be made and leads a fierce resistance to the attack. Despite the woman's pleas to stay with her, the private attempts to rejoin his company but is shot dead by military police when he refuses to halt. The sergeant identifies him as a hardhead but a good soldier. Days later, the wife and the woman coincidentally stand next to each other on a ship going to the mainland. The wife tosses her leis into the sea, wondering if she will ever return to the island. The woman tells her she herself will not return, as her fiancé, whom she identifies as the private, was a bomber pilot who died during the attack and was awarded a military medal. The wife recognizes the name but says nothing."
}