{
  "obfuscated_plot": "A young royal princess is on a tightly-scheduled diplomatic tour of European capital cities. After an especially hard day in a historic city, her doctor gives her an injection and advises her to do what she wishes. She secretly leaves her embassy to explore the city and, as the drug takes effect, falls asleep atop a low wall, where a struggling American reporter finds her. Not recognizing her, he thinks she is intoxicated and takes her to his apartment to sleep it off. He oversleeps and misses her scheduled press conference, but claims to his editor that he attended. The editor shows him a news item about the cancellation of the press conference due to her \"sudden illness\". The reporter realizes the woman in his apartment is the princess from the newspaper photograph, and negotiates a substantial payment for an exclusive interview.\n\nHe calls his photographer friend and offers to show the woman around the city, without revealing his true intentions. The princess cites an important appointment and leaves. He follows and observes her exploring an outdoor market, buying shoes, and getting her long hair cut short. He contrives to meet her and convinces her to spend the day with him, taking her to meet his photographer friend who secretly captures their moments.\n\nThroughout the day, they have adventures including a chaotic motor scooter ride, a visit to historic landmarks, and a playful interaction with a local folklore tradition. During an evening boat dance, government agents attempt to forcibly return her to her duties. She resists, fighting alongside the reporter and his friends, even smashing a guitar over a pursuer's head. After nearly drowning and rescuing each other, they share intimate moments.\n\nUpon returning to her embassy, she affirms her commitment to her royal responsibilities. At a subsequent press conference, she speaks eloquently about international relations, surprising the reporter who thought he would expose her. When asked about her favorite city, she declares her love for the city where her adventure occurred. Her photographer friend presents her with mementos of their day together, while the reporter watches from a distance, their connection understood but unspoken."
}