{
  "obfuscated_plot": "A large city prizefighter's career was cut short when he purposely lost a fight at the request of a local crime boss. The fighter now works for the crime boss's labor union as a dock worker while his older, more educated brother is the boss's right-hand man. He is coerced into luring a fellow worker onto a rooftop, where he believes the boss's henchmen want to talk the worker out of testifying to a crime commission. When they instead murder the worker by throwing him off the roof, the fighter confronts the boss, but is threatened and bribed into acquiescence. The murdered worker's sister and a local priest try to inspire the dock workers to stand up to the boss. The fighter attends a meeting as a snitch, but when it is violently broken up by the boss's men, he helps the sister escape and misses the priest convincing one worker to testify. After the testimony, the worker is killed in a staged workplace accident. The fighter's unwillingness to testify is softened by his growing feelings for the sister, and her and the priest's pursuit of justice. He confesses his role in the worker's death to both. Shocked by this, the sister distances herself from him. The boss sends the brother with a job offer to keep the fighter quiet. Knowing refusal will get the fighter killed, the brother urges him to comply. When the fighter expresses regret about throwing his best fight and blames the brother for setting up the fix, the brother hands him a gun and tells him to run. The fighter finds the sister and they kiss. After hearing someone in the street, they find the brother murdered. Determined to kill the boss, the fighter is convinced by the priest to instead testify in court. Following the hearing, the boss loses his powerful connections and faces indictment. When he is excluded from the next hiring call at the harbor, the fighter confronts the boss together with the other workers, saying that he is proud of testifying and no longer betraying himself. After seeing the fighter get beaten severely by the boss's thugs, the dock workers refuse to work without him and renounce the boss, wishing to run the union \"on the up-and-up\". Encouraged by the sister and the priest, the fighter stumbles to the warehouse. The men follow him inside and the door closes, leaving the boss outside, ignored by the workers and shippers."
}