{
  "obfuscated_plot": "During World War II, a newly commissioned young naval officer reports to a minesweeper, where he meets a career officer who serves as the ship's executive officer, and an aspiring novelist and communications officer. Soon after, a strict and eccentric commanding officer is assigned to the ship. The new commander instills harsh discipline on the lax crew, making him unpopular but initially admired by the young officer. During a gunnery exercise, the captain becomes distracted and causes a navigational error. When assigned to escort landing craft during a Pacific island invasion, the captain abandons his mission prematurely, leaving the landing craft vulnerable. The officers nickname the captain with a derogatory term implying cowardice.\n\nThe communications officer, believing the captain to be paranoid, encourages the executive officer to consider relieving the captain due to mental incapacity. Though initially resistant, the executive officer begins documenting the captain's erratic behavior. During an absurd investigation over missing food items, the captain's instability becomes more apparent. When the executive officer attempts to report the issues to a senior admiral, his fellow officers back down.\n\nDuring a severe typhoon, the executive officer urges the captain to change course, but the captain freezes up. The executive officer, supported by the young officer, relieves the captain of command. They subsequently face a court-martial for mutiny. A naval aviator turned attorney serves as their defense counsel. During the trial, the captain's odd behavior is exposed, and the executive officer is acquitted.\n\nAt a post-trial celebration, a drunken defense attorney criticizes the officers for their treatment of the captain, arguing that his previous combat experiences and lack of support contributed to his deteriorating mental state. He particularly condemns the communications officer as the true instigator of the mutiny, dramatically throwing a drink in his face. The other officers leave the communications officer alone.\n\nThe young officer, now married, is promoted and assigned to a new ship under a different commanding officer."
}