{
  "obfuscated_plot": "In a mid-19th century frontier territory, a rugged backwoodsman goes to a small town for supplies and to find a bride. He meets a pretty young cook at the town bar. Seeing her strength, hardworking attitude, and culinary skills, he proposes. She accepts and they immediately marry, but upon arriving at his mountain homestead, she discovers that he has six younger brothers who are uncouth and expect her to clean and cook for them. She angrily ruins dinner and retreats to the bedroom, where she bans her husband from their bed. He initially crawls out the window to sleep in a nearby tree; eventually, they reconcile, with her regretting her high hopes concerning marriage.\n\nShe begins teaching her husband's brothers hygiene and manners; eventually, this extends to advice on romance and courtship. At a town barn-raising event, the brothers display their newly acquired social graces as they meet six local women who are immediately attracted to them. The women's initial suitors, overcome with jealousy, attack the brothers during the barn-raising. In the ensuing brawl, the barn is destroyed.\n\nWinter sets in. The brothers pine for their loves back in town. To console them, the husband reads from his wife's historical book about ancient women who were kidnapped to be wives. He then claims his brothers should do the same to get their prospective brides. The brothers sneak into town at night and kidnap the women. As they race back to the homestead, they trigger an avalanche that blocks the mountain pass, stopping their pursuers.\n\nThe brothers realize they neglected to procure a religious official to conduct wedding ceremonies and are snowed in until spring. The wife is furious with her husband and the brothers and exiles them to the barn while the women stay in the house. Humiliated, the husband leaves for a trapping cabin to spend the winter alone.\n\nOver the winter, the women vent their anger by pranking the brothers, but their feelings gradually soften. Meanwhile, the wife reveals she is expecting a baby. By springtime, the women and brothers have happily paired off. When the wife has a baby girl, the youngest brother goes to tell the husband, who initially refuses to return. After being chastised, the husband returns and meets his daughter.\n\nHe admits that being a father, he now understands how families feel about their daughters and tells his brothers they must return the women. The heartbroken brothers agree to take them home. However, the women hide and refuse to go back. As the brothers search, the women's angry families reach the homestead. A religious leader hears a baby crying and asks whose baby it is. The women immediately and simultaneously claim it as their own. The fathers begrudgingly allow their daughters to marry the brothers in a collective shotgun wedding."
}