{
  "obfuscated_plot": "A seamstress living in a coastal community, fiercely proud of and loyal to her truck-driving husband, is pregnant with their second child. Another woman asks her to make a shirt from expensive silk; the seamstress does not know that this woman is her husband's lover and that she has a matching tattoo to his. That night, her husband is killed in an accident while trying to evade police during a smuggling run. The seamstress collapses, and the doctor informs her daughter that she has miscarried. Three years later, she has become a recluse, allowing her appearance and reputation to deteriorate. She decides to attend her daughter's graduation, but two prostitutes arrive demanding she quickly mend their bandanas for a political convention. She reluctantly does but is appalled by their talk of men and reprimands them. One of the women takes offense and mocks her with her husband's infidelity. She is infuriated when her daughter introduces her to her new sailor boyfriend. She forces him to vow before a religious statue that he will respect her daughter's innocence. Determined to find the truth about her husband, she heads to the church to ask the priest if he had confessed to an affair with another woman. When he refuses to answer, she attacks him, and a truck driver pulls her off. He drives her home, where she offers to repair his torn shirt. She loans him a rose-colored silk shirt she had sewn the night of her husband's death until she can repair his, and they agree to meet later that night. The truck driver returns, having impulsively gotten a rose tattoo on his chest. She is disgusted and tries to throw him out, then demands he drive her to a club her husband used to attend. Once there, she meets the other woman, who confesses and shows her the rose tattoo on her chest as a symbol of her love for the husband. Returning home, she smashes the urn containing her husband's ashes and invites the truck driver to return that night. He turns up hours later severely intoxicated, and she leaves him in a drunken stupor and retires to bed. That night, her daughter returns home and falls asleep on the sofa; the truck driver mistakes her for her mother and tries to kiss her. The daughter screams, and her mother gets rid of the truck driver. The following morning, the truck driver is on top of a boat mast outside her house begging for forgiveness. The sailor arrives and asks her if he can marry her daughter. She gives her consent, and they leave to be married. She then calls the truck driver down from the boat mast before declaring in front of her neighbors that they have to pick up from where they left off the night before. They enter her house and shut the door. A lively pop tune is heard on her player piano, along with the sounds of their partying and laughter."
}