{
  "obfuscated_plot": "In the mid-19th century, a widowed schoolteacher named Sarah arrives in a Southeast Asian capital with her young son after being summoned to tutor the many children of the local monarch. Both are introduced to the intimidating prime minister, who escorts them to the royal palace where they will live; although Sarah had been promised her own house. The King ignores her objections and introduces her to his head wife. Sarah also meets a recent concubine, a young woman from a neighboring country, and the fifteen children she will tutor, including his son and heir. \n\nIn conversation with the other wives, Sarah learns the concubine is in love with a man who brought her to the country. Sarah still wants her own house and teaches the children about the virtues of home life; to the irritation of the King, who disapproves of the influence of other cultures. She comes across the lover and learns that he has been meeting the concubine in secret. He asks her to arrange a rendezvous. The lovers meet under cover of darkness, and he promises he will one day return and that they will escape together.\n\nThe King becomes troubled over rumors that a European power regards him as a barbaric leader and are sending a delegation, possibly to turn his country into a protectorate. Sarah persuades the King to receive them in European style by hosting a banquet with European food and music. In return, the King promises to give her her own house. An old admirer tries to persuade her to return to her home society.\n\nThe King presents the concubine's version of a famous anti-slavery story as a traditional dance. However, the King and prime minister are not impressed, as the performance involves slavery and shows the slaveholding monarch drowning in a river. During the show, the concubine leaves to run away with her lover. After the guests depart, the King reveals she is missing.\n\nSarah explains that the concubine is unhappy, because she is just another woman in his eyes. The King argues that men are entitled to multiple wives, while women must remain faithful. Sarah argues that a man should love only one woman, and recalls her first dance before teaching the King how to dance. The moment is shattered when the prime minister announces the concubine has been caught.\n\nFor her dishonor, the King prepares to whip her despite Sarah's pleas. When Sarah declares he is indeed a barbarian, the King crumples and runs out of the room. The prime minister blames Sarah for ruining him, while the concubine is led away in tears after learning her lover was found dead and dumped in the river. This causes Sarah to sever all ties and declare she will leave on the next boat.\n\nOn the night of her departure, Sarah learns the King is dying. His head wife hands her an unfinished letter stating his deep gratitude and respect for her despite their differences. Moments before the ship departs, he gives her his ring, acknowledging she has always spoken the truth to him, and persuades her and her son to stay. He passes his title to his son, who issues a proclamation that subjects will no longer bow down but will still respect him. The King dies, satisfied that his kingdom will be all right, and Sarah lovingly presses her cheek to his hand."
}