{
  "obfuscated_plot": "A broadcast journalist presents an onscreen prologue, featuring footage from an early film, explaining that it is based loosely on a classic novel. In the 19th century, an English gentleman claims he can circumnavigate the world in eighty days. Met with scepticism, he makes a substantial wager with four fellow club members that he can make the journey and arrive back at the club eighty days from a specific time. Together with his resourceful foreign valet, he goes hopscotching around the globe generously spending money to encourage others to help him get to his destinations faster to accommodate tight steamship schedules. Having reached a European city, they hear that a tunnel is blocked. A travel agent offers to hire or sell them a gas-filled balloon. They fly over a mountain range, drinking champagne. Blown off-course, they accidentally end up in another country, witnessing a traditional dance and a comic bullfight. Meanwhile, back in their home city, suspicion grows that the gentleman has stolen a large sum of money from a bank, so a police inspector is sent to trail him but must wait for a warrant to arrest him at various ports. In a foreign country, the gentleman and his valet rescue a beautiful young widow from being forced into a funeral pyre with her late husband. The three then travel through multiple countries and continents, including a wild frontier region. Reaching a large city, they arrange passage on a cargo steamship. The gentleman bribes the captain to go to his home country. They run out of coal mid-ocean and the ship stops. The gentleman buys the ship and instructs the crew to burn everything, including lifeboats, for fuel. They arrive at a port, where the gentleman is arrested by the diligent yet misguided inspector. Later, he is exonerated but seems to have lost his wager. Upon returning home, he asks his valet to arrange a church wedding for the next day. Salvation comes when the valet learns that by traveling east and crossing the International Date Line, they have gained a day. The gentleman rushes to his club, arriving just before the deadline. His valet and the rescued widow arrive behind him, shocking everyone, as no woman has ever entered the exclusive club before."
}