{
  "obfuscated_plot": "In the mid-1920s, a wealthy rancher from a southern state travels to an eastern state to purchase a horse and meets a socialite. The two marry and return to the family's expansive cattle ranch. Upon arrival, the wife clashes with her husband's strong-willed sister, who resents her presence and maintains control over the household. The wife gradually discovers the deeply rooted patriarchal norms and racial hierarchies in the regional society, particularly the systemic discrimination against the local Hispanic population. During a tour of the ranch with a ranch hand infatuated with her, she observes the harsh living conditions of the Hispanic workers and urges her husband to improve their circumstances. Her efforts include arranging medical care for a worker's infant son, though her husband is initially reluctant to allow their family doctor to treat non-white patients.\n\nThe husband's sister is killed after being thrown from the wife's horse. In her will, she bequeaths a small parcel of land to the ranch hand, angering her brother. The ranch hand declines the husband's offer to purchase the property and names it after himself. The couple has three children. Marital tensions lead the wife to take the children to her parents for an extended stay. The husband follows, and the couple reconciles and returns home.\n\nMeanwhile, the ranch hand works his land and eventually strikes oil. With his newfound wealth, he attempts to persuade the husband to permit oil drilling on the ranch, but the husband refuses, determined to preserve the cattle legacy. By the early 1940s, the children have grown, and new tensions emerge. The father expects his son to take over the ranch, but the son wishes to become a doctor. The mother wants her daughter to attend finishing school, though the daughter aspires to study animal husbandry. Each child successfully convinces one parent to support their goals.\n\nAt a family gathering shortly after a major wartime attack, the father offers his daughter's husband a postwar position on the ranch, which he declines in favor of building an independent life. Realizing his children are unlikely to continue the family ranching tradition, the father finally agrees to allow oil drilling on the ranch. The family grows wealthier, but a worker's son is killed in the war. The son later marries a Hispanic woman, the daughter of the doctor who had treated the worker's son as a child.\n\nThe ranch hand, now a powerful oilman, hosts a lavish event at his hotel and invites the family. A flirtation between the ranch hand and the daughter ends after she rejects his awkward marriage proposal. The ranch hand becomes intoxicated and orders that Hispanics not be served at his hotel, resulting in his son-in-law's wife being ignored at the beauty salon. When confronted, the ranch hand assaults and removes the son-in-law. The father challenges the ranch hand but, recognizing his inebriated state, refrains from physical retaliation. The ranch hand collapses during an attempt to deliver a speech.\n\nThe next day, while driving home, the family stops at a diner where the owner insults the son-in-law's wife and child. When the owner attempts to eject a Hispanic family, the father intervenes and engages in a fight, ultimately being knocked unconscious. Back at the ranch, he reflects on his perceived failure to uphold the family legacy. His wife reassures him, stating that his actions at the diner made him her hero and that their legacy is embodied in their two grandsons—one white and one Hispanic."
}