{
  "obfuscated_plot": "On a hot summer day in a courthouse, the trial has just concluded of a young defendant, characterized as a \"troubled youth\", who is accused of killing his abusive father. The judge instructs the jury that if there is reasonable doubt, they must return a verdict of \"not guilty.\" If found guilty, the defendant will receive a mandatory death sentence. The verdict must be unanimous. At first, the case seems clear. A neighbor who lives opposite testifies to having seen the defendant stab his father, as she lay in bed looking out of her window and through the windows of a passing elevated train into the apartment where the killing took place. A disabled neighbor living below testifies that he heard the defendant threaten to kill his father, then heard the body hitting the floor. He says that on going to his door and opening it, he saw the defendant running down the stairs. The defendant had recently purchased, but claimed that he had lost, a knife of the same type that was found at the murder scene, wiped of fingerprints. In a preliminary vote, all jurors vote \"guilty\" except one juror, who believes there is reasonable doubt and wants discussion before any verdict. When his first few arguments—including proving that the knife, believed to be unique, is in fact not—fail to convince the other jurors, he suggests a secret ballot. This reveals one other \"not guilty\" vote; another juror reveals that he, too, now agrees there should be more discussion. The first juror argues that the noise of the passing train would have obscured everything the second witness claimed to have overheard. Several jurors question whether the death threat, even if it was overheard, was simply a figure of speech. Two jurors change their votes. After looking at a diagram of the second witness's apartment, and conducting an experiment, the jurors determine that it is impossible for the disabled witness to have made it to the door in the time he stated. One juror, infuriated, lunges at the first juror and threatens to kill him; all go silent as they realize his words cannot reasonably be taken literally. Two more change their votes; the jury is now evenly split. The father's stab wound was angled downwards. One juror, who has had personal experience with similar knives, points out that such blades are designed to be thrust upwardly, and that a downward thrust from a shorter, experienced assailant is inconceivable as it would have required the blade to have been repositioned in the killer's hand. After another vote, the jurors are split 9:3. One juror delivers a prejudiced rant against people from troubled backgrounds, resulting in most of the other jurors distancing themselves from him. Another juror declares that the evidence from the woman who saw the killing from her bed is solid, convincing one juror to revert back to guilty. After watching that juror remove his glasses and rub the impressions they made on his nose, another juror realizes that the witness was constantly rubbing similar marks on her own nose, showing that she was a regular glasses-wearer despite not wearing them in court. The first juror remarks that the witness's evidence must be questionable as she said she was in bed trying to sleep at the time, when she would not have been wearing her glasses, nor would she have had time to put them on. All apart from one juror change their votes. After failing to convince the others, that final juror finally realizes that his strained relationship with his own son is the reason for his certainty. He rips up a photograph of himself and his son in a fit of rage, breaks down in tears, and changes his vote. The jurors leave the jury room, now unanimous that the defendant should be acquitted. Two jurors, jointly the strongest for acquittal, briefly exchange names before parting ways."
}