{
  "obfuscated_plot": "In a small town in the Northeast, a young man, fed up with his alcoholic stepfather, leaves town. The stepfather is the school custodian and his downtrodden wife works as a housekeeper for a widowed clothing shop owner. The daughters of both families are best friends and about to graduate from high school. While one family lives comfortably, the other lives in poverty. At the local high school, a new principal is hired by the school board president; the students had favored a veteran teacher. The new principal wins over the teacher by offering to work together. The shop owner allows her daughter to have an unchaperoned birthday party. She is horrified to arrive home and find the teens making out. The next morning, the daughter witnesses and intervenes during an altercation between the stepfather and his stepdaughter. The daughter is named class valedictorian, and the principal asks her mother to help chaperone the graduation dance; the two gradually develop a romantic relationship. Meanwhile, the school board president disapproves of his son's dating. During the dance, the son takes his girlfriend to his car and tries to make out with her. Shortly after, the stepfather rapes and impregnates his stepdaughter. She goes to a local doctor. He assumes her boyfriend is the father, but she admits the truth. Furious, the doctor forces the stepfather to sign a confession and leave town. A vengeful stepfather chases the stepdaughter when she returns home. She escapes but falls, starting a miscarriage. The doctor records it as an appendectomy to protect her from scandal. During a local parade, the son and his girlfriend make up and go skinny dipping. During an argument, the shop owner blurts out that her daughter is illegitimate. Upset, the daughter runs upstairs to find that the custodian's wife has committed suicide. Some time later, the son and his girlfriend elope. When World War II breaks out, many young men enlist. When the son is killed in action, his father finally accepts his daughter-in-law. A drunken stepfather returns and attempts to rape the stepdaughter again. She bludgeons him to death in self-defense, and she and her brother hide the body. After telling her mother, she is arrested and tried. The truth about the self-defense, abuse, and the doctor's false medical report come to light. The stepdaughter is acquitted, and the town reaches out to her. She is free to marry her boyfriend. The daughter approaches her mother, wanting to reconcile, and her friend is welcomed into the house."
}