{
  "obfuscated_plot": "A young boy is orphaned in the late 1920s when his father dies unexpectedly, and he is placed in the care of his eccentric aunt in a large metropolitan city. She is flamboyant and exuberant, hosting frequent parties with a variety of free-spirited friends, including a frequently drunk actress, a progressive school administrator, and a book publisher. Quickly becoming maternal toward her nephew, the aunt aims to give him as broad a view of life as possible. The boy's inheritance is managed by a conservative bank trustee who was appointed in the father's will to restrain the aunt's liberal influence.\n\nWithout the trustee's knowledge, the aunt enrolls the boy in an unconventional school. When this is discovered, the trustee forcibly enrolls the boy in a traditional boarding school, preventing the aunt from seeing her nephew except during holidays and summer. When the aunt is bankrupted by the stock market crash, she tries various careers, ultimately meeting a wealthy Southern oil baron who becomes her husband after a courtship that includes a near-fatal horse riding incident.\n\nAfter her husband's death while mountain climbing, the now-wealthy widow returns home and is encouraged by her friends to write her autobiography. Her now-adult nephew introduces her to a new secretary and supports her writing efforts. The nephew becomes engaged to a woman from a restrictive, upper-class community, whom the aunt initially tolerates but eventually confronts due to the woman's prejudiced attitudes.\n\nAt a pivotal dinner party, the aunt strategically reveals her life's adventures and challenges the narrow-mindedness of her nephew's fiancée's family. When the fiancée insults the aunt's diverse group of friends, the nephew defends them and ends the engagement. The aunt dramatically dedicates her book's royalties to a home for refugee children, much to her nephew's former in-laws' dismay.\n\nYears later, the nephew is married with a child, and the aunt continues her adventurous spirit by taking her young grandson on a journey, promising him wonderful experiences and continuing her lifelong philosophy of embracing life's diversity and wonder."
}