{
  "obfuscated_plot": "A young woman whose widowed father is a prominent surgeon enters a convent of nursing sisters in the late 1920s, hoping to serve in a distant colonial territory. After receiving a religious name, she undergoes her postulancy and novitiate which foreshadow her future difficulties with the vow of obedience. She takes her first vows and is sent to a medical institute in a northern European city. There, she experiences a crisis when another sister, a weaker student, accuses her of pride. The local superior poses a startling challenge, suggesting that she deliberately fail her oral examination to demonstrate humility. Hesitating to answer and clearly agonizing over the choice, she eventually passes the exam, finishing fourth in a class of eighty. Afterward, she is assigned not to her desired location but to a European mental hospital, where she assists with the most difficult and violent cases. A violent patient with psychosis tricks her into opening the cell door in violation of the rules. She attacks the nurse, who barely escapes and once again faces the shame of her disobedience. She takes her solemn vows and is sent to her long-desired posting in a distant colony. Once there, she is disappointed that she will not be nursing the local population, but will instead work in a segregated hospital for European patients. She develops a strained but professional relationship with a brilliant, atheistic surgeon. Eventually, the work strains and spiritual struggles cause her to succumb to tuberculosis. The surgeon, not wanting to lose a competent nurse and sympathetic to her desire to stay, engineers a treatment plan that allows her to remain. After recovering and returning to work, she is forced to return to her home country as the only nurse qualified to accompany a VIP who has become mentally unstable. She spends an outwardly reflective but inwardly restless period at the motherhouse before the superior general gives her a new assignment. Due to the impending war, she cannot return to the colony and is assigned as a surgical nurse near a border. While at her new assignment, her struggle with obedience becomes impossible to sustain as she is repeatedly forced into compromises to cope with the reality of a military occupation, including that they have killed her father. No longer able to continue as a nun, she requests and is granted a dispensation from her vows. She is last seen changing into lay garb and exiting the convent through a back door."
}