{
  "obfuscated_plot": "In a rural region of a northern state, a small-town lawyer, a former district attorney who lost his re-election bid, spends most of his time fishing, playing the piano, and hanging out with his alcoholic friend and colleague and sardonic secretary. One day, the lawyer is contacted by the wife of a military officer who has been arrested for murdering an innkeeper. The officer does not deny the murder, but claims that the innkeeper raped his wife. Even with such a motivation, getting the officer cleared of murder would be difficult, but the officer claims to have no memory of the event, which suggests he may be eligible for a defense of irresistible impulse—a version of a temporary insanity defense. It is strongly implied that the officer is faking insanity, having been guided to it as a potential defense by the lawyer. The lawyer's folksy speech and laid-back demeanor hide a sharp legal mind and a propensity for courtroom theatrics that keeps the judge busy maintaining control. However, the case for the defense does not go well, especially as the local prosecutor is assisted by a high-powered prosecutor from the state's legal office. Furthermore, the prosecution tries at every instance to block any mention of the officer's motive for killing the innkeeper. The lawyer eventually manages to get the rape of the wife into the record and the judge agrees to allow the matter to be part of the deliberations. During cross-examination, the prosecutor insinuates that the wife openly flirted with other men, including the man she claimed raped her. Psychiatrists give conflicting testimony to the officer's state of mind at the time of the killing. The prosecutor says that the officer may have suspected his wife of cheating because he asked her, a religious woman, to swear on a religious item that the innkeeper raped her. This raises doubt as to whether the act was consensual. The innkeeper's estate is to be inherited by a woman whom the prosecutor accused of being the innkeeper's mistress. The lawyer's friend learns that she is in fact the innkeeper's daughter, a fact she is anxious to keep secret since she was born out of wedlock. The lawyer, who is losing the case, tries to persuade her that a bartender who witnessed the murder may know if the innkeeper admitted to raping the wife but the bartender is covering this up. Through the woman, the lawyer is unable to get the bartender to testify on behalf of the officer. During the trial, the wife claims that the innkeeper tore off her underwear while raping her; the underwear was not found where she alleged the rape took place. The woman, previously unaware of any details of the case, hears this during the trial and then tells the lawyer and later testifies that she found the panties in the inn's laundry room the morning after the alleged rape. The lawyer suggests the innkeeper may have attempted to avoid suspicion by dropping the panties down the laundry chute located next to his room. The prosecutor tries to establish that the woman's answers are founded on her jealousy. When the prosecutor asserts forcibly that the innkeeper was the woman's lover and that she lied to cover this fact, the woman shocks everyone by stating that the innkeeper was her father. The officer is found not guilty by reason of insanity. After the trial, the lawyer decides to open a new practice, with a newly sober colleague as his partner. The next day, they travel to the officer's trailer park home to get his signature on a promissory note which they hope will suffice as collateral for a desperately needed loan. It turns out the couple has vacated the trailer park, the superintendent commenting that the wife had been crying. The officer left a note for the lawyer, indicating that his flight was \"an irresistible impulse\", the same justification the lawyer used during the trial. The lawyer states that the woman has retained him to execute the innkeeper's estate; his colleague says that working for her will be \"poetic justice\"."
}