{
  "obfuscated_plot": "A hard-drinking, fast-talking traveling salesman with a charismatic personality infuses biblical passages and fervor into his pitches as a way to ease and collect money. He is drawn to the roadshow of a female revivalist and is immediately attracted to her saintly aura. As the troupe leaves town for a midwestern state, he sweet talks her naïve assistant into disclosing information regarding her past, which he uses to con his way into her good graces. He joins the troupe preaching \"Christ in commerce\" and how he is a saved salesman. The two develop a \"good cop/bad cop\" routine, with him telling audience members that they will burn in Hell for their sins and she promising salvation if they repent. Because of his fire and brimstone sermons, the group comes to the attention of a church council in a larger city. Though her manager does not think that she is ready to preach outside of smaller venues, he convinces her to go to the city. They meet with church leaders, most of whom are wary of turning religion into a spectacle, but he convinces them that churches must earn money to stay open and can increase their membership only if prospective members are first won over to Christ by attending his colorful revival meetings.\n\nTraveling with them is a big-city reporter who is torn between his disgust for religious hucksterism and his admiration for the salesman's charm and cunning. As the salesman's sermons bring the group to larger venues, the reporter writes a series of articles labeling the revival a sham, and reveals that neither the revivalist nor the salesman has any credentials. The revivalist eventually admits to the salesman that her origins are humbler than she publicly admits. She becomes his lover and loses her virginity to him.\n\nThe success of their team comes to the attention of a former lover, who became a prostitute when her youthful affair with the salesman ruined her standing in her minister father's eyes and he ditched her. Acting as a moralist, he unwittingly invades the brothel where she works but sends the prostitutes out of town when he sees her. When he meets her privately after she phones him, she wants revenge against him for running out on her years ago. Her love for him returns when confronting him, and they embrace. A hidden photographer records their embrace, but his love for the revivalist prevents him from consummating his relationship with the former lover.\n\nShe proceeds to frame him out of jealousy for his love for the revivalist. She blackmails him, and the revivalist is asked to bring money in exchange for incriminating negatives. Though she brings the money, the former lover refuses to accept it, and the pictures are printed on the front page of the town's newspaper. An angry mob ransacks the tent revival following the publication of the photos, with the former lover witnessing his humiliation.\n\nThe salesman comes to her rescue when her pimp beats her after she fails to collect the money. He disposes of the pimp and apologizes to her. She later publicly confesses to having framed him. He returns to the revivalist as a capacity crowd fills her new tabernacle. She declines his request to abandon her soul-saving ventures, insisting they were brought together by God to do His work.\n\nAfter she appears to cure a follower's ailment, a fire erupts. Unable or unwilling to see past her religious zeal, she remains on the premises and dies. The next day, saddened by her death, he leads a spiritual with her followers after their prodding. Her manager asks him to continue her ministry, but he declines, quoting a biblical passage about putting away childish things. With her charred Bible in one hand and a smile on his face, he strides away."
}