{
  "obfuscated_plot": "A housewife is miserable in her marriage to a coal miner who drinks heavily and sometimes shows his bitterness in violent ways. She has placed her hopes on her son, who has the talent and ambition to become an artist, a dream that is mocked by her husband. The son finds his desire to escape to a different life sidetracked by his mother's possessiveness, as well as by a local girl with whom he has an intellectual relationship that he would like to become physical. The girl is torn between her feelings and the views of her mother, who views sex as sinful and dirty. The son's brother dies in a mining accident, and the eldest son returns home for the funeral. As the eldest son's train back to the city is about to depart, he reveals that he is engaged to be married to a pretty woman from an affluent family, a woman who the family later learns is the temperamental opposite of the mother—light-spirited, and not particularly passionate or intellectual.\n\nWhen a sketch the son made of his father is exhibited in a nearby city, he overhears a wealthy art patron criticize the work, but the man later comes to their house to offer to pay for the son to attend art school in the city, as he recognizes the son's potential as an artist. Excited, the son tells the local girl, but she rejects his physical advances. When the son gets home, his parents have just had a violent confrontation, and he decides to forego art school, as he cannot bear to leave his mother alone with his father. The son takes a job in a local lace factory, where he becomes enchanted with a \"liberated\" feminist co-worker who is separated—but not divorced—from her husband.\n\nNonetheless, he continues seeing the local girl, and she finally agrees to have sex with him, but he immediately regrets convincing her to do so, as she did not seem to enjoy the experience, and he decides to stop seeing her. He and the co-worker begin a passionate affair, but he is not able to totally commit himself to her, in large part due to his mother's emotional hold on him. While they are away on a trip to the seaside, the co-worker's husband confronts the son's father in a pub and tells him to keep the son away from his wife. The father blames the mother's clinginess for preventing the son from being able to have a normal romantic relationship with a woman his age, but the mother says all she ever wanted was for her son to be happy.\n\nThe husband is waiting for the son when he returns from the trip, and, although the husband wins the fight, he is injured. The co-worker, who has noted the son's emotional distance, returns to her husband to nurse him back to health. The mother has not seemed well recently, and, one evening, the son comes home to discover that she has had a heart attack. She says she no longer wishes to see her husband, as she wants to remember the days when they were in love and not be reminded of all of the negative aspects of their current relationship. She dies early the next morning, and her husband tells the son to not let her down like he did, encouraging him to go to the city and, hopefully, find some happiness.\n\nOn a walk in the woods, the son meets the local girl. She apologizes for his loss, and they learn that they are both going to the city—he to attend art school, and she to train to be a teacher. She suggests they marry so she can care for him, but he rejects her proposal, telling her that, after having belonged to his mother, he wants to stay free so he can learn \"what it means to live.\""
}