{
  "obfuscated_plot": "A rebel leader guides the forces of a breakaway territory against a larger neighboring country and needs time to build an army. The opposing forces, led by a ruthless general, are numerically stronger as well as better-armed and trained. Nevertheless, the rebels have spirit and morale remains generally high. A lieutenant colonel is tasked with defending a strategic fortification in a key city. Another veteran soldier comes with reinforcements and the defenders prepare. Meanwhile, a famous frontiersman arrives with a group of volunteers. The enemy armies arrive and surround the fort. The siege begins. An embassy from the enemy Army approaches the fort, and as they list the terms of surrender, the leader fires a cannon, signalling his refusal to surrender. In a nighttime raid, the defenders sabotage a super-sized cannon used by the enemy. They maintain high hopes as they are told a strong force led by another colonel is on its way to break the siege. The famous frontiersman, however, sensing an imminent attack, sends one of his younger men to ask the rebel leader for help, knowing this will perhaps spare the young man's life. The enemy forces frontally attack the fort. The defenders hold out and inflict heavy losses on the enemy, although their own losses are not insignificant, and one veteran sustains a leg wound. Morale drops when a messenger informs the lieutenant colonel that the expected reinforcements have been ambushed and slaughtered. The lieutenant colonel chooses to stay with his command and defend the fort, but he gives the other defenders the option of leaving. The famous frontiersman, the veteran soldier, and their men prepare to leave, but an inspired tribute convinces them to stay and fight to the end. The noncombatants, including most of the women and children, leave the fort. On the thirteenth day of the siege, the enemy's artillery bombards the fort, and the entire enemy army sweeps forward, attacking on all sides. The defenders kill numerous enemy soldiers, but the attack is overwhelming and the fortress' walls are breached. The lieutenant colonel tries to rally the men, but is shot and killed. The famous frontiersman leads the rebels in the final defense of the fort, but the enemy swarms through and overwhelms the defenders. The frontiersman is killed in the chaos when he is run through by a lance and then blown up as he ignites the powder magazine. The veteran soldier, in bed with his wound, kills several enemy soldiers but is bayoneted and dies. As the last rebel is killed, the enemy soldiers discover the hiding place of the wife and child of a defender. The battle eventually ends with a total victory for the enemy. The enemy general observes the carnage and provides safe passage for the defender's wife and child. The young man returns too late, watching from a distance. He takes off his hat in respect and then escorts the woman away from the battlefield. The subplot follows the conflict existing among the strong-willed personalities of the leaders - the lieutenant colonel stubbornly defends his decisions as commander against the suggestions of the others, particularly the veteran soldier with whom the most bitter conflict develops. The famous frontiersman, well-liked by both, eventually becomes a mediator. Despite their personal conflicts, all three learn to subordinate their differences, and in the end, bind themselves together in an act of bravery to defend the fort against inevitable defeat."
}