{
  "obfuscated_plot": "In 1943, the enemy powers plan an assault on a strategic island, where 2,000 soldiers are marooned, hoping to convince a neutral country to join them. Rescue by naval forces is prevented by two enormous radar-directed large-calibre guns on a nearby island. Aerial bombing fails to destroy the guns and military intelligence assigns a commando unit to infiltrate the island and destroy the guns. Led by a senior officer, the team is composed of a skilled ex-spy; a colonel from a national army; an explosives expert and chemistry professor; a local native of the island; and a renowned engineer and knife fighter. Disguised as local fishermen, they cross a sea and overwhelm the crew of an enemy patrol boat. The ex-spy confides to the senior officer that the colonel has sworn to kill him after the war, because he was inadvertently responsible for the deaths of the colonel's family. After being shipwrecked on the coast, the ex-spy leads the team up a cliff and the senior officer injures his leg. The ex-spy stops the officer's attempt to kill himself and lies that their mission has been scrubbed. They rendezvous with two resistance fighters, a local woman and her friend, who had been tortured before escaping. The group is captured while seeking medical help, but they overpower their captors and escape in enemy uniforms, leaving the injured officer behind. The officer is drugged and repeats the misinformation. The enemy redeploys forces from the fortress, anticipating a coastal landing. In a village, the explosives expert discovers his supplies have been sabotaged by a collaborator who confesses to being recruited by the enemy. The local woman shoots the collaborator. The ex-spy and explosives expert infiltrate the gun position while others create distractions in town. Two team members attempt to steal a boat for escape. A team member dies in a shootout, and another is wounded during the boat theft. The ex-spy and explosives expert plant explosives on the guns and prepare a booby trap. The enemy enters the gun emplacement but cannot prevent the eventual destruction. The team is rescued by naval forces. The colonel falls in love with the local woman and returns to the island with her. The ex-spy and explosives expert observe the aftermath of their success from a naval vessel."
}