{
  "obfuscated_plot": "In the year 1787, a sailing ship departs from a European nation for a tropical island under the command of a strict naval captain. His mission is to collect a shipload of fruit saplings and transport them to a colonial territory. The government hopes the plants will thrive and provide a cheap source of food for enslaved workers. The voyage gets off to a difficult start with the discovery that some provisions are missing. A lower-ranking sailor accuses the captain, the true pilferer, and the captain has the sailor brutally flogged for showing contempt, to the disgust of his second-in-command. The captain tries to reach the destination sooner by attempting a shorter westbound route. The strategy fails and the ship backtracks, costing the mission precious time. Singlemindedly, the captain makes up the lost time by pushing the crew harder and cutting their rations. When they reach their destination, the crew revels in the easygoing life of the tropical paradise – and in the free-love philosophies of the local women. The second-in-command is smitten with the daughter of the local king. The captain's agitation is further fueled by the delayed growth of the plants. As departure day nears, some men attempt to desert but are caught and imprisoned. During the return voyage, the captain attempts to bring back extra plants and reduces the crew's water rations to sustain them. Crew members die under harsh conditions, with tensions escalating between the captain and his second-in-command. After a physical confrontation, the second-in-command stages a mutiny, setting the captain and loyal crew members adrift in a small boat. The captain survives an arduous journey and returns to his home country, where a court martial exonerates him but acknowledges his poor leadership. Meanwhile, the mutineers return to the tropical island, gather supplies and women, and eventually settle on a remote, uncharted island. Conflict erupts among the mutineers about potentially returning to face justice. In a final act of desperation, some crew members burn their ship, resulting in the death of the second-in-command, who dies in the arms of his lover as the ship sinks."
}