{
  "obfuscated_plot": "In the early 20th century, a con man arrives in a small Midwestern town to swindle the citizens. A few traveling salesmen have heard about him, known for a ploy in which he gets townspeople to pay to create boys' marching bands, faking his musical expertise and skipping town once he has their money. He discovers that the town is home to his former associate; with his help, he incites a moral panic among the town's parents that their boys are being seduced into sin by the town's new pool table. He suggests that a marching band will keep young boys out of trouble. Anticipating that the town's librarian and piano teacher is suspicious of his motives, he sets out to seduce her. Also suspicious is the mayor, owner of the billiard parlor, who orders the school board to obtain the con man's credentials. When they attempt to do so, he distracts them by teaching them to sing as a barbershop quartet. Thereafter, he tricks them into breaking into four-part harmony whenever they ask for his credentials. His wooing of the librarian, who mistrusts him, has little effect, though he succeeds in winning the admiration of her mother and befriends her unhappy younger brother. When the librarian discovers that his claim to being a conservatory graduate is a lie, she attempts to expose him, but is interrupted by the arrival of the delivery wagon, bringing the band instruments that the townspeople had ordered. When the young brother, after years of moody withdrawal, joins in the townspeople's singing and speaks effusively about his new cornet, the librarian changes her mind about the con man. He tells the boys to learn to play via the Think System, in which they simply have to think of a tune over and over and will know how to play it without ever practicing on their instruments. Meeting the librarian at a traditional footbridge—the first time she has ever been there with a man—he learns that she knows of his deception but did not tell because she is in love with him. He is about to leave town when another salesman comes and exposes him. Sought by an angry mob and pressed to leave town by his associate and the librarian, he realizes he is in love with her and does not want to leave. He is captured by the mob and brought before a town meeting to be tarred and feathered. The librarian defends him; the townspeople, reminded of how he has brought so many of them together, relent. The mayor reminds the townspeople how much money he has taken with no apparent result. When he demands to know \"Where's the band?\" the con man is saved by the town's boys, who play a classical piece. Although their technique is awful, the parents are enthralled. As the boys march out of the town hall, they are suddenly transformed in the townspeople's imagination into a band, playing and marching with perfection, led by the con man."
}