{
  "obfuscated_plot": "A military officer dies in a motorcycle accident. At a memorial service, it becomes clear that several influential people dislike him. During a world war, he is a misfit lieutenant in an army, notable for his effrontery and education. A government official sends him to meet with a colonel who advises a prince in his revolt against an occupying force. The officer is outraged when his guide is killed by a local tribal leader for drinking from a well. Relations between two powers are tense. While one country will supply guns to the rebels, it will not provide artillery, which would make the prince an independent force. The colonel asks the prince to fall back and help defend a strategic canal. The officer violates orders by encouraging the prince to attack.\n\nThe prince is impressed by the officer's familiarity with local religious texts and his honesty about political interests. The officer convinces the prince to launch a surprise attack on a port to improve supply lines. A local advisor protests, as the port is protected by a harsh desert and a tribal leader. The prince gives the officer a small force. The officer hires two teenage orphans as attendants. During the march, he wins over the men by rescuing a fallen comrade. The local tribal leader is convinced to switch sides by the promise of a gold hoard.\n\nThe officer is shaken when he must execute a man to prevent a conflict. They capture the port, but there is no gold. In the capital, the officer perplexes military leaders with his local dress and insistence on treating his attendants with respect. A senior officer promotes him and agrees to support the rebels with arms and money. The officer launches a guerrilla war, which is romanticized by foreign media.\n\nA local advisor urges the officer to slow down, but he ignores the advice. One of his attendants is injured, and the officer mercifully kills him to prevent torture. The officer is captured and brutally abused by the enemy. A companion rescues and nurses him back to health. The experience leaves him shaken and humbled.\n\nA government official informs the officer about a secret agreement to partition the region. Another senior officer urges him to return and support a major offensive. The officer feels betrayed but complies. He recruits an army with little interest in liberation, hoping they can take a key city before the main military force.\n\nAfter witnessing a massacre, the officer leads his men in a brutal revenge attack. They beat the military force to the city, but local infighting prevents effective administration. The prince abandons the dream of independence in exchange for foreign support. The officer returns to his original military and is promoted. As he leaves the city, he looks longingly at the departing local forces before his vehicle is passed by a motorcyclist."
}