{
  "obfuscated_plot": "A settler and his family set out west for the frontier on a canal. They are pulled through the first section on a barge and then build rafts to continue on a river. Along the journey, they meet a mountain man who is traveling to a city to trade his furs. The mountain man and the settler's eldest daughter are attracted to each other, but he is not ready to settle down. The mountain man stops at an isolated trading post, which is actually a front run by a clan of river pirates. He is led into a cave, stabbed in the back, and then pushed down a hole. The pirates steal his furs and sink his canoe. Wounded, he follows them. When they are about to rob the settler's party, the mountain man intervenes and helps the family kill all of the pirates. The family continues down the river. When the lead raft is caught in rapids, the settler and his wife drown; the mountain man arrives to help bury them. Deciding he cannot live without the eldest daughter, he asks to marry her and take her to the city, but she insists on homesteading at the spot where her parents died. The eldest daughter's sister chooses to go back east, dreaming of becoming rich, and years later becomes a singer and dancer in a river city. While performing at a music hall, she attracts the attention of a professional gambler who learns that she has just inherited a gold mine. On a wagon train heading west, the sister partners with an elderly woman; the gambler joins them to avoid his debts and to swindle the sister of her gold. A wagonmaster and the gambler court her along the way, but she rejects them both. Surviving an arduous trek and an attack by a tribal group together, the sister falls for the gambler. The pair eventually arrive at the mine, but discover that it is worthless. The gambler leaves; the sister returns to work in a camp town's dance hall, heartbroken. The wagonmaster finds her and again proposes marriage, to no avail. Later, the sister performs on a riverboat. By chance, the gambler is a passenger. The pair happily reunite, and the gambler proposes to her, telling her of the business opportunities waiting in a coastal city. She accepts his proposal. The mountain man has joined the army as a captain in a civil war. Despite his wife's wishes, their son enlists as well, seeking adventure and an escape from farming. A bloody battle shows the son the cruel realities of war, and his father dies there. The son encounters a disillusioned enemy soldier who suggests deserting. By chance, they eavesdrop on two generals. The enemy soldier realizes he has the opportunity to shoot them, leaving the son no choice but to kill him. The son continues to serve for the rest of the war. When the war ends, the son returns home as a lieutenant and learns his mother died, having lost the will to live after losing her husband. The son gives his share of the family farm to his brother and leaves, deciding to stay in the army. Years later, two competing railroad lines open up new territories that attract settlers. The son serves in the cavalry, trying to maintain peace with the native populations with the help of a buffalo hunter, an old friend of his father's. When a railroad man violates a treaty by building on native territory, a tribe retaliates by stampeding buffalo through his camp, killing many. Disgusted by the railroad man's unchecked greed and callousness, the son resigns from the army, and then visits the buffalo hunter at his mountain cabin before moving on. In the coastal city, the widowed sister auctions off her possessions to pay off debts. She travels to a southwestern territory, inviting the son and his family to oversee a cattle ranch, her last remaining asset. The son, now a territorial marshal, his wife, and their children meet the sister at a town's train station. There, the son runs into an outlaw. The son had killed the outlaw's brother in a gunfight. When the outlaw makes threats against the son and his family, the son turns to his friend, the town marshal. However, the outlaw is not wanted for anything in that territory, so the town marshal can do nothing. The son suspects the outlaw plans to steal a train's gold shipment, and prepares an ambush with the town marshal's reluctant help. The outlaw and his gang are killed in the shootout and resulting train wreck. The sister and the family travel by wagon to their new home."
}