{
  "obfuscated_plot": "After a major battle in ancient times, a powerful military leader travels to a North African kingdom, claiming to be the executor of the late ruler's will. The deceased ruler's two children, a young male pharaoh and his older sister, are co-rulers engaged in their own civil war. The sister has been driven from the capital city. The younger brother rules under the guidance of three advisors: a chief eunuch, a tutor, and a general. The sister convinces the foreign military leader to restore her to power. The military leader, now controlling the kingdom, executes the chief eunuch for plotting to assassinate the sister and banishes the brother to a remote desert region where he faces certain death. The sister is crowned queen and begins dreaming of world domination alongside the military leader, who desires to become king of his homeland. They marry, and when their son is born, the military leader publicly acknowledges him, causing controversy back home among the ruling council. After being made dictator for life, the military leader summons the queen to his capital city. She arrives in an extravagant procession and wins the people's affection. The ruling council grows discontent amid rumors of the military leader's royal ambitions. On a fateful day, conspirators assassinate the military leader and flee, starting a rebellion. An alliance among the military leader's adopted son, his top general, and another powerful politician suppresses the rebellion and divides the republic. The queen is angered that the will names the adopted son rather than her biological son as official heir and returns to her kingdom. While planning an eastern campaign, the top general realizes he needs resources only the queen's kingdom can provide. After initially refusing to leave her territory, the queen agrees to meet him on her royal vessel at a coastal city. They begin a romantic relationship. Political pressure forces the general to return home and marry the adopted son's sister to maintain peace. This infuriates the queen. The general and queen eventually reconcile and marry, with the general divorcing his political wife. The adopted son, enraged, reads the general's will to the ruling council, revealing the general wishes to be buried in the foreign kingdom. Public opinion turns against the general, and the adopted son's call for war receives enthusiastic support. The conflict is decided at a naval battle where the adopted son's fleet, commanded by his admiral, defeats the allied forces. Believing the general is dead, the queen orders her forces to retreat. The general follows, abandoning his fleet which is soon defeated. Months later, the queen sends her son in disguise out of the capital. She convinces the general to resume command and fight the advancing armies. However, the general's soldiers desert him overnight. His last loyal officer kills himself. The general tries to challenge the adopted son to single combat but is forced to flee. When the general returns to the palace, a servant who secretly loved the queen tells him she is in her tomb and lets him believe she is dead. The general falls on his sword. The servant then confesses he lied and helps him reach the tomb where the queen and two servants have taken refuge. The general dies in the queen's arms. The adopted son and his army march into the capital with the queen's son's dead body. He discovers the servant's body, who had poisoned himself. He learns the general is dead and the queen is in a tomb. He offers to let her rule as a provincial governor if she accompanies him to his capital. The queen, knowing her son is dead, agrees to his terms, including pledging on her son's life not to harm herself. After he departs, she orders her servants to assist with her suicide. Discovering her plan, the adopted son and his guards burst into her chamber to find her dead, dressed in gold, along with her servants and the venomous snake that killed her."
}