{
  "obfuscated_plot": "A high-ranking government officer searches for the daughter of his half-brother, a doctor and poet. He believes a young dam worker may be his niece and explains her origin. After his mother's burial, an orphaned child is taken by family friends to a large city. In the early 20th century, the doctor becomes engaged to his adoptive parents' daughter after her schooling abroad. Meanwhile, a 17-year-old girl is seduced by her mother's older friend/lover. The girl's idealistic friend, who wishes to marry her, is wounded at a peaceful demonstration. She treats his wound and hides a gun he picked up. Discovering her relationship with the older man, her mother attempts suicide. The older man attempts to dissuade her from marrying her friend, and when she refuses, he rapes her. Traumatized, she later follows him to a party, shoots him, and is escorted out by her friend. They marry and leave the city.\n\nDuring a major war, the doctor, now married, becomes a battlefield medic. Her friend joins up but is reported missing. She enlists as a nurse to search for him and encounters the doctor. They serve together at a field hospital during a time of growing social unrest. They fall in love, but the doctor remains faithful to his wife. After the country leaves the war, he returns home to his wife, child, and father-in-law in a house now shared with many others.\n\nThe government officer warns the doctor that his poems are considered politically unacceptable. He helps the family travel to a country home in a remote region. Their guarded train travels through contested territory. The doctor is captured and meets a rebel commander who turns out to be her friend from years ago. The commander mentions she lives in a nearby town.\n\nThe doctor sees her in the town, and they begin an affair. When his wife is about to give birth, he breaks it off but is forcibly enlisted. After deserting, he returns to her. They learn his wife and family have been deported abroad. An influential older man offers them help escaping, but they initially refuse.\n\nEventually, they accept the escape plan. She leaves on a train, pregnant with the doctor's child. Years later, the doctor sees her in the street but suffers a fatal heart attack. She searches for their child, who disappeared during the civil war, but fails. She then vanishes, believed to have died in a prison camp.\n\nThe government officer believes the dam worker is their daughter. Her story involves being separated from her \"father\" during a bombardment. Her boyfriend arrives, and she leaves carrying a musical instrument. The officer notices her natural artistic talent and hints at her possible true parentage."
}