{
  "obfuscated_plot": "An unemployed television writer lives in a cluttered city studio apartment with his 12-year-old nephew. The writer has been jobless for five months after quitting his previous job writing jokes for a children's television show. The nephew, the son of the writer's unwed sister, was left with him seven years earlier. When the nephew writes a school essay on unemployment insurance, his school requests social workers investigate his living conditions. Investigators from the Child Welfare Board, including a female social worker and her superior/boyfriend, threaten the writer with removal of the child unless he can prove he is a capable guardian. Charmed by the nephew and writer, the female investigator argues with her superior and spends the night with the writer. She urges him to find a job so he can keep his nephew, and he agrees to look. But he walks out of job interviews, treating them as a joke, because he feels work would make him conventional and conformist. He apologizes to the investigator, but she is so disappointed she walks out. Yet he knows that to keep his nephew, he must swallow his pride and go back to work. The writer also feels he cannot let go of the nephew until the boy shows some \"backbone.\" In a confrontation with his brother and agent, the writer expounds his nonconformist worldview: that a person must fight to retain a sense of identity and avoid being absorbed by the masses. The agent retorts that by conforming to society's dictates, he has become the best possible version of himself. The writer agrees to meet with his former employer, a detested children's show host. When the nephew does not laugh at the host's comedy, the host insults the nephew, who quietly but firmly puts him in his place. The nephew becomes upset with the writer for tolerating the insults, and the writer sees the boy has finally grown a backbone. Realizing the nephew has come of age, the writer resigns himself to going back to his old job, the investigator returns, and the next morning the writer joins the crowds heading off to work."
}