{
  "obfuscated_plot": "One September morning, a foreign navy submarine draws too close to the northeastern coast when its captain wants to see the country and runs aground on a sandbar near a small island off the coast, with a population of about 200 people. Rather than radio for help and risk an embarrassing international incident, the captain sends a nine-man landing party, headed by his political officer Lieutenant James, to find a motor launch to help free the submarine. The men arrive at the house of Robert, a vacationing playwright from a large city. Robert is eager to get his wife Susan and children, Tom and Mary, off the island now that summer is over. Tom tells his disbelieving dad that armed foreigners are near the house, but Robert is soon met by James and one of his men, Alex, who identify themselves as strangers on the island and ask if there are any boats available. Robert is skeptical and asks if they are armed foreigners. Startled, James admits that they are and pulls a gun on Robert. James promises no harm to the family if they surrender their station wagon. Susan provides the car keys, but before the foreigners depart, James orders Alex to prevent the family from fleeing. The station wagon quickly runs out of gasoline, forcing the foreigners to walk. They steal an old sedan from Margaret, the postmistress; she calls Dorothy, the gossipy telephone switchboard operator, and soon, rumors about foreign parachutists and an air assault on the airport throw the island into confusion. Police Chief Frank and his deputy Bill try to squelch a citizens' militia led by Harold, head of the local veterans' organization. Meanwhile, Robert, Susan and Tom overpower Alex when Jennifer, an 18-year-old neighbor and Mary's babysitter, arrives for work, giving them an opening. Alex flees, but when Robert, Susan, and Tom leave to find help, he returns to retrieve his weapon from the house, where only Jennifer and Mary remain. Despite wanting no fighting, Alex must obey his superiors in guarding the residence. He promises not to harm anyone and offers to surrender his gun as proof. Jennifer trusts him and does not want his firearm. Robert is recaptured by the foreigners in the telephone central office. After subduing Dorothy, tying her and Robert together and disabling the island's telephone switchboard, seven foreigners appropriate civilian clothes from a dry cleaner's, steal a cabin cruiser, and head back to the submarine. Back at the family house, Alex and Jennifer talk, kiss, and fall in love. At the phone exchange, Robert and Dorothy hop outside the office. They are eventually discovered by Susan and Tom, who untie them. They return to their house; and Robert shoots at and almost kills James, who reached there ahead of them. With the misunderstandings cleared up, the family, James, and Alex decide to head into town together to explain to everyone what is happening. As the tide rises, the sub floats off the sandbar. The submarine proceeds on the surface to the island's main harbor to recover the landing party. Chief Frank, having investigated and debunked the rumor of an airborne assault, returns to town with the unorganized militia. With James acting as translator, the foreign captain threatens to open fire on the town unless the seven missing sailors are returned to him; his crew faces upwards of a hundred townspeople armed with everything from small caliber rifles and shotguns to military surplus battle rifles. Two small boys climb up to the church steeple to see better. One slips and falls but his belt catches on a gutter, leaving him hanging 40 feet in the air. The local islanders and the foreign submariners unite to form a human pyramid and rescue him. Peace is established between the two groups. However, Harold contacted the Air Force by radio. In a joint decision, the submarine leaves the harbor with villagers in small craft protecting it. Alex says goodbye to Jennifer. The stolen cabin cruiser with the missing foreigners meets the sub, which they board before two Air Force jets arrive. The jets break off after seeing the escorting flotilla of civilian boats. The submarine is free to proceed to deep water and safety."
}