{
  "obfuscated_plot": "In 1926 during a period of regional military conflict in an Asian country, a naval engineer transfers to a river patrol gunboat as their new mechanic. Almost immediately, he upsets the crew when he will not accept the local workers they use to do most of their duties. Instead, the engineer takes personal responsibility of the engine room. He befriends a seasoned sailor. After an engine malfunction caused by a problem the engineer noticed, but the captain refused to repair, the chief local engine-room worker dies. The leader of all the local workers onboard blames the engineer. The captain tells the engineer he must find a replacement, so he chooses a simple but genial local man. The sailors on shore leave visit a bar and brothel run by a former sailor. A high-priced virgin captivates the crew. The seasoned sailor discovers that her price is the debt she must pay to get her freedom. The engineer's nemesis conspires with the workers' leader to get the new hire kicked off the boat, in response the engineer proposes a boxing match; if his nemesis wins, he gets the money needed for the woman, but if he loses, the new hire keeps his job. The nemesis is almost beaten when the alarm sounds, forcing the crew to rush back to their boat, but the engineer forces the ten count to finish. A local mob has been angered that foreign warships have fought a battle with regional warlords on the river. When a civil war begins, the gunboat is ordered to remain neutral, while rescuing stranded foreigners up river. The local hire is sent ashore by the workers' leader while the sailors collect a missionary and his schoolteacher assistant. After being caught by a mob, the engineer violates the captain's orders to stay neutral by shooting the local hire to end his brutal death on shore. Back in port, locals openly show their hatred towards the sailors. The missionary and schoolteacher head off to a new mission. The seasoned sailor tries to buy the woman's freedom, but instead she is put up for auction. The engineer tries to help pay the higher price, but a fight breaks out. The three of them escape. The seasoned sailor and woman have an unofficial marriage in an empty church. The engineer and schoolteacher start to meet and fall in love, but he thinks it cannot last, as he will likely be leaving the country soon. As winter comes, the boat becomes stuck as the river level drops. Shore leave is cancelled when the local workers abandon the crew and a flotilla of local civilians blockade the ship. To see the woman, the seasoned sailor regularly swims the freezing waters, but eventually he catches pneumonia and dies. Antiforeign forces kill the woman and frame the engineer for her murder. They surround the ship and demand his surrender. With tensions rising and the crew also demanding the engineer leave, the captain fires a machine gun, ending the matter. The captain decides to rescue the missionary and schoolteacher from their new mission after hearing of antiforeigner riots in a nearby city. However, the gunboat encounters a line of tethered boats blocking their way sparking an armed conflict. Under fire, the engineer chops through the rope. He kills a local militiaman only to recognize the young man as one of the missionary's and schoolteacher's students. The gunboat arrives at the mission, but the missionary and schoolteacher refuse to leave. While they argue, military soldiers attack, killing the missionary. The patrol retreats, but when the captain is killed, the engineer takes command. The schoolteacher and he affirm their love; the engineer promises to follow while covering their escape. He kills several soldiers, but is fatally shot as he is about to rejoin the others. A dying engineer bewilderingly asks about what happened to his sense of belonging. The schoolteacher and the remaining sailors reach the boat. The gunboat slowly steams away."
}