{
  "obfuscated_plot": "A handsome, self-centered, narcissistic driver in a large city enjoys the sexual favors of married and single women while avoiding commitment. He is ending an affair with a married woman just as he gets his submissive girlfriend pregnant. He thinks nothing of stealing fuel and money from his employer and tells his girlfriend to do the same. Although he refuses to marry her, and despite his constant cheating, she decides to have the child and keep him. Over time, he becomes quite attached to his son, but his unwillingness to marry her causes her to break up with him and marry a kindly bus conductor and neighbour who loves her and is willing to accept the child as his own. She bars the father from any further contact with the son, forcing him to watch from a distance as the new husband steps into his fatherly role. When a health check reveals he has lung shadows, the diagnosis and his fear of death, combined with his separation from his son, lead him to have a brief mental breakdown. He spends time recuperating in a pastoral sanatorium, where he befriends a fellow patient, a family man devoted to his wife. He makes out with one of the nurses, disgusting his friend. When he flippantly suggests the wife might be cheating, his friend angrily confronts him about his attitudes and behaviour. Released from the convalescent home, he briefly stops working as a driver to take holiday photos of tourists near a famous landmark. He meets an older, voluptuous, affluent and promiscuous woman who gives him her contact information. He returns to driving and visits his friend at the sanatorium. He finds the wife finishing a visit with her husband, who asks him to give her a ride back to the city. Neither initially wants to spend time together, but they agree to please the husband. Along the way, they stop for tea and then a canoe ride where he seduces her. Later, driving again, he sees a young hitchhiker who wants a fresh start in the city. A truck driver picks her up just before he gets to her. He follows them to a cafe and steals her away to the city. She moves into his small apartment where she proves preoccupied with a love left behind, cleaning and cooking to compensate. The truck driver finds him in a pub and punches him, causing a bar brawl. Coming home with a black eye, he grows resentful of the girl and drives her out with an angry outburst, immediately regretting it. Around the same time, the wife informs him that she is pregnant from their one encounter, and they plan for her to have an abortion. During the procedure, he leaves her and walks around. He catches sight of his son outside a church and witnesses the baptism of his ex-girlfriend and her new husband's daughter. The abortion traumatizes both of them; he breaks down in tears when seeing the aborted fetus, the first time he confronts the consequences of his actions. Stressed by the situations, he decides to change his non-committal ways and settle down with the older woman. However, visiting her, he finds a younger man in her bed. He comes across his previous affair partner, but she has lost interest and returned to her husband. He is left lonely, wondering about his life choices and the meaning of existence. A stray dog approaches him, and he takes it in his care as he walks off into the night."
}