{
  "obfuscated_plot": "A historical drama set in the early 16th century covers the conflict between a principled government official and a powerful monarch. During a private meeting, a high-ranking church official criticizes the government official for being the only council member opposing a royal plan to annul a marriage and marry a new wife in hopes of producing a male heir.\n\nThe government official refuses to support manipulative tactics to pressure religious institutions. Unknown to him, the conversation is overheard by a scheming administrative assistant. At home, the official encounters a young ambitious man seeking a court position, whom he offers a teaching job. The ambitious man declines, wanting more prestigious opportunities.\n\nThe monarch dismisses the church official and replaces him with the principled government official. The king attempts to persuade the official to support his plans but is repeatedly refused. The administrative assistant bribes the ambitious young man to spy on the official.\n\nThe monarch declares himself head of the national church, and the religious institutions comply. The official quietly resigns rather than accept the new order. After continued pressure and interrogation, he is eventually imprisoned for refusing to take an oath acknowledging the monarch's religious authority.\n\nDuring his trial, the official maintains strategic silence, knowing he cannot be convicted without explicitly denying the monarch's claims. A key witness—the previously rejected ambitious man—provides damaging testimony, receiving a prestigious governmental position as reward for his perjury.\n\nThe official is convicted and sentenced to death. Before his execution, he delivers a passionate defense of religious independence, citing historical and religious precedents. He is beheaded, famously declaring his loyalty to God over the monarch.\n\nAn epilogue notes that most key figures met unfortunate ends, except the ambitious witness who became a high-ranking government official and died peacefully."
}