{
  "obfuscated_plot": "After earning his bachelor's degree, a recent graduate returns to his parents' home in a suburban neighborhood. During his graduation party, the wife of his father's business partner asks him to drive her home. Once there, she tries to seduce him. He resists her advances, but later invites her to a local hotel, where he registers under a fake name. He spends the summer idly floating in his parents' swimming pool and meeting the married woman at the hotel. During one of their trysts, she reveals that she and her husband married after she accidentally became pregnant with their daughter. When the young man jokingly suggests that he date the daughter, the married woman angrily forbids it. His parents and her husband pester him to ask the daughter out. He reluctantly takes her out, but attempts to sabotage the date by ignoring her, driving recklessly and taking her to a strip club. She flees in tears, but he chases after her, apologizes and kisses her. They eat at a drive-in restaurant, where they bond over their shared uncertainty about their plans. After they visit the hotel for a late-night drink and the staff greet him by his fake name, the daughter deduces that he is having an affair. He admits to having an affair with a married woman whom he does not name. He tells her the affair is over and asks to see her again. To prevent him from dating her daughter, the married woman threatens to tell her about their affair. To thwart this, he tells the daughter that the married woman is her mother. She throws him out of the house and returns to college. He follows her there, hoping to regain her affections. She initially rejects him and briefly dates another man. When she learns her mother lied about him, she reconciles with him. He pushes for marriage, but she is uncertain despite her feelings for him. Her father arrives at the college and angrily confronts him. He informs him that he and his wife are getting divorced and threatens to have him jailed if he keeps seeing the daughter. Her father forces her to leave college to marry the other man. He drives to her parents' home searching for her. He finds the married woman, who tells him that he cannot prevent her daughter's marriage. He flees the house and drives back to the college. There he discovers the wedding is in another city that day. He speeds over hundreds of miles, but his car runs out of gas a short distance from the church. He runs to the church, arriving just as the ceremony is ending. His desperate appearance in the glass church gallery stirs the daughter into defying her mother and fleeing the sanctuary. He fights off her father and repels the wedding guests by swinging a large cross, which he uses to bar the church doors, trapping everyone inside. They escape aboard a bus and sit among the startled passengers, with her still in her wedding gown. As the bus drives on, their ecstatic smiles slowly change into ambivalent expressions."
}