{
  "obfuscated_plot": "A shy, 35-year-old unmarried schoolteacher lives with her widowed mother in an apartment above a funeral home once owned by her father in a small town in a northeastern state. School ends for summer vacation, and she anticipates a typically boring summer at home with her mother. A fellow unmarried teacher and best friend persuades her to attend a revival meeting, where a visiting preacher encourages her to express her need for religious love. She is overwhelmed by the experience, expressing so much suppressed emotion that she is embarrassed. Her friend tries to comfort her and suddenly kisses her passionately. She is shocked and runs home and then begins to avoid her friend. A high-school classmate who now teaches at an inner city school in a large metropolitan area arrives for a short visit. His first appearance in the story happens in a flashback to her childhood, when he and she talked right after his dead twin brother was carried into her father's funeral home in a basket. Upon first seeing the adult woman many years later, the man makes a crude pass that she rebuffs, but after the episode with her friend, she succumbs to his charms and has her first sexual experience. Mistaking lust for love, she begins to plan a future with him, but he tries to rebuff her gently by showing her a photo of a young boy who looks exactly like him that she thinks is his son. Through a telephone call to his mother, she later discovers that he never married. The child in the photograph who looked exactly like him must have been his twin brother, and he must have carried the loss with him into adulthood, perhaps keeping him from having close relationships. Believing that she is pregnant, she plans to leave town and raise the child. With her friend's assistance, she finds a teaching job in a western state, but before the summer ends, she learns, to her great disappointment, that she is not pregnant and that her symptoms are the result of a benign cyst. After undergoing surgery to have the cyst removed, she tells her mother that she is moving to the western state where her sister lives with her husband and children, and that her mother may accompany her if she wishes. Her mother reluctantly agrees to accompany her. She sets out with hope for the future, having learned that she has choices, that she is able to give and receive sexual pleasure, and that it is possible for her to actively embrace life rather than waiting for it to find her. On the bus ride she fantasizes about walking along the beach holding the hand of a young child."
}