{
  "obfuscated_plot": "In a workhouse, orphans are served their daily gruel. Some boys draw lots, with a young boy drawing the tangled one, forcing him to approach the caretaker and ask for more food. Enraged, the caretaker takes the boy to the governors for punishment and then parades him through the streets to sell him as an apprentice. An undertaker purchases the boy. The undertaker's other apprentice later insults the boy's mother, who retaliates and is imprisoned in the cellar. He discovers that the window grate is unlocked and escapes. A week later, the boy reaches a large city. He meets a street-smart pickpocket, who takes him under his wing. The pickpocket brings the boy to a hideout for young thieves, led by an older criminal who instructs the gang in the art of stealing. The older criminal later meets with a violent burglar by a tavern. When he returns to the hideout, he goes through a secret cache of treasures. The boy wakes up, notices the secret, and startles him. The criminal explains that the trove is to help him in his old age. In the morning, the burglar's girlfriend arrives at the hideout to collect his money. The criminal sends the boys out for the day, teaming the boy with the pickpocket. At a bookstall, the pickpocket steals a wallet from a wealthy man, who mistakes the boy for being the thief and has police arrest him. At the court, a bookseller testifies that the boy is innocent. The wealthy man takes the boy in, while the burglar and the criminal send the pickpocket to follow them. The boy has been living with the wealthy man for several days. The burglar and the criminal are determined to get him back as they believe the boy may tell on them; the burglar forces his girlfriend into helping as the boy trusts her the most. The next day, the wealthy man entrusts the boy with a delivery. As he leaves, the man notices a striking resemblance between the boy and a portrait of his long-lost relative. While walking through the city, the boy is sidetracked by the girlfriend and is kidnapped by the burglar and taken back to the hideout. The burglar is defied by the boy, who in turn is protected by the girlfriend. When the criminal warns the burglar to remain calm, the burglar threatens him with his life, should their operation be compromised. Realizing the burglar's violent nature, the criminal begins reconsidering his life as a thief but decides to keep to his old ways. Two caretakers visit the wealthy man after he begins searching for the boy's origin. They present a locket belonging to the boy's mother, who arrived at the workhouse penniless and died during childbirth. The wealthy man recognizes the locket and throws the two out for keeping the trinket and information. Meanwhile, the burglar forces the boy to take part in a house robbery. The robbery fails when the boy accidentally awakens the occupants, but he and the burglar get away. While they are gone, the girlfriend, fearful for the boy's life, goes to the wealthy man, confessing her part in the boy's kidnapping; however, she refuses to name the burglar out of loyalty. She promises to return the boy at midnight at a bridge. She then goes to a tavern. When the burglar and the boy appear, the burglar has his dog guard the boy. The girlfriend starts up a lively drinking song to distract the burglar, but the dog alerts him, who gives chase. As the boy and the girlfriend depart at the bridge, the burglar catches up to them and violently bludgeons the girlfriend. The burglar takes off with the boy, but the dog returns to where the girlfriend has succumbed to her injuries and alerts the police. The dog leads the wealthy man and an angry mob to the thieves' hideout. The burglar arrives there and demands money, as well as confessing that he killed the girlfriend. Upon seeing the approaching mob, the thieves disband and flee. The burglar runs off with the boy, using him as a hostage. During the evacuation, the criminal loses his prized possessions, which sink into mud. The burglar attempts to flee to an adjacent roof but is shot dead by the police. The criminal makes up his mind to change his ways, but the pickpocket appears with a stolen wallet. The two dance off into the sunrise together, happily determined to live out the rest of their days as thieves, while the boy returns to the wealthy man's home for good."
}