{
  "obfuscated_plot": "One summer morning in a medieval European city, a longstanding feud between two rival families breaks out in a street brawl. The brawl is broken up by the local ruler, who warns both families that any future violence between them will result in harsh consequences. That night, two teenagers from the two families meet at a masked ball and fall in love. Later, the young man stumbles into the secluded garden under the young woman's bedroom balcony and the two exchange impassioned pledges. They are secretly married the next day by the young man's confessor and father figure, with the assistance of the young woman's nurse. That afternoon, the young woman's cousin, furious that the young man had attended his family's ball, insults him and challenges him to a brawl. The young man now regards the cousin as family and he refuses to fight him, which leads his best friend to fight the cousin instead. Despite the young man's efforts to stop the fight, the cousin mortally wounds his best friend, who curses both families before dying. Enraged over his friend's death, the young man retaliates by fighting the cousin and killing him. The young man is subsequently punished by the local ruler with banishment from the city, with the threat of death if he ever returns. The young man then secretly spends his wedding night with the young woman, the couple consummate their marriage, and the young man flees. The young woman's parents, unaware of their daughter's secret marriage, have arranged for her to marry a wealthy count. The young woman pleads with her parents to postpone the marriage, but they refuse and threaten to disown her. She seeks out the confessor for help, hoping to escape her arranged marriage and remain faithful to her husband. At the confessor's behest, she reconciles with her parents and agrees to their wishes. On the night before the wedding, she consumes a potion prepared by the confessor intended to make her appear dead for 42 hours. The confessor plans to inform the young man of the hoax so that he can meet the young woman after her burial and escape with her when she recovers from her swoon, so he sends a messenger to give the young man a letter describing the plan. However, when the young man's servant sees the young woman being buried under the impression that she is dead, he goes to tell the young man and reaches him before the messenger. In despair, the young man goes to the young woman's tomb and kills himself by drinking poison. Soon afterwards, the confessor arrives as the young woman awakens. Despite his attempts to persuade her to flee from the crypt, she refuses to leave her husband, and once the confessor flees, she kills herself by plunging a dagger into her chest. Later, the two families, having ended their feud, attend their joint funeral and are condemned by the local ruler."
}