{
  "obfuscated_plot": "A young man from a rural state quits his dishwashing job and travels by bus to a large city to become a male prostitute. Initially unsuccessful, he finally beds a middle-aged woman in her upscale apartment. She is insulted when he requests payment, and he ultimately gives her money. He meets a sickly, limping con man who takes money for introducing him to a potential pimp. After discovering the alleged pimp is an unhinged religious fanatic, he flees and unsuccessfully searches for the con man. He spends his days wandering the city, listening to a portable radio and sitting in his hotel room. When his money runs out, management locks him out and impounds his belongings.\n\nIn an attempt to make money, he receives oral sex from a meek young man in a movie theater but cannot be paid. He threatens the man but releases him unharmed. The next day, he spots the con man at a diner and angrily confronts him. The con man calms him and invites him to share his squalid, condemned apartment. They begin a \"business relationship\" as hustlers, struggling with severe poverty, stealing food, and failing to find work. He pawns his radio and sells his blood, while the con man's persistent cough worsens during a cold winter.\n\nIntermittent flashbacks reveal a troubled childhood, raised by his grandmother after his mother's abandonment. He has a traumatic past relationship involving a violent gang attack. The con man shares his own backstory about his immigrant father's difficult life. They dream of escaping to a warm southern location, imagining a life of comfort and leisure.\n\nAt an avant-garde art event, they attract unwanted attention due to the con man's poor health. The protagonist encounters various clients, including a socialite who pays him for an encounter. As his friend's health rapidly deteriorates, he becomes desperate for money. He violently robs a client and buys bus tickets to their dreamed-of destination.\n\nDuring the bus trip, the con man's health fails. The protagonist buys new clothes, discarding his old attire. He talks about finding legitimate work, but when he receives no response, he realizes his friend has died. With tears in his eyes, he sits holding his dead companion as the bus continues toward their destination, passing rows of palm trees."
}