{
  "obfuscated_plot": "In the late 19th century, a well-known widowed matchmaker plans to travel to a small town. She seeks a wife for a wealthy, unmarried businessman. Meanwhile, a young artist wants to marry the businessman's niece. The businessman opposes this, feeling the artist cannot provide financial security. He owns a local feed store and plans to travel to a large city to march in a parade and propose to a milliner he met through the matchmaker. After arriving in town, the matchmaker sends the businessman ahead to the city. Before leaving, he tells his two clerks to mind the store. One clerk decides they need to get out of town. The matchmaker overhears and decides to set them up with the milliner and her shop assistant. She also helps the artist and his love interest by entering them in a dance contest at an elegant restaurant she once frequented with her late husband. The entire group takes the train to the city. In the city, the milliner and her assistant open their hat shop. The milliner does not love the businessman but sees the potential marriage as financial security. The clerks arrive, pretending to be wealthy. When the businessman and matchmaker arrive, the clerks hide. The matchmaker helps them avoid detection. She arranges for the clerks to take the ladies to dinner at the restaurant, to make up for their earlier humiliation. They attend a parade together. The matchmaker asks her late husband's permission to marry the businessman and resolves to move forward with life. She catches up with the annoyed businessman and suggests he meet a supposed heiress that evening at the restaurant. At the restaurant, the head waiter prepares for the matchmaker's return. The businessman arrives to meet his date, who is actually an old friend of the matchmaker. She leaves, bored, as planned. The clerks and their dates arrive, unaware the businessman is there. The matchmaker arrives and sits at his table, saying she will not marry him. The clerks confess they are not wealthy. A confrontation ensues, with the businessman firing the clerks. A riot breaks out. The next morning, all the couples come to the feed store to collect money owed to them. Chastened, the businessman admits he needs the matchmaker. She is unsure about the marriage until she receives a sign from her late husband. The clerks become business partners, and the businessman acknowledges that life would be dull without the matchmaker."
}