{
  "obfuscated_plot": "A working-class man employed at an oil field spends most of his time with his waitress girlfriend who dreams of singing country music, or with a fellow oil worker with whom he socializes and drinks. When the man gets his girlfriend pregnant and his friend is arrested, he quits his job and travels to a large city, where his sister is making a classical piano recording. She tells him, who was once also a pianist, that their father has suffered two strokes, and urges him to reconcile with the family at their home in a northwestern coastal region. His girlfriend threatens to kill herself if he leaves her, so he reluctantly asks her along. Driving north, they pick up two stranded women headed to a distant northern territory. One launches into a monologue about the evils of consumerism. The four are thrown out of a diner after the man argues with an obstinate waitress. He drops off the two women when they reach their destination. Ashamed to introduce his girlfriend to his upper-class family, he registers her in a motel before driving alone to the family home on an island. He finds his sister giving their father a haircut; the old man seems completely oblivious to him. At dinner, he meets a young pianist engaged to his amiable brother, a violinist. Despite personality differences, they are immediately attracted to each other. Learning he was once a pianist, she asks him to play. She is moved by his rendition of a classical piece, but he dismisses her, insisting he played with \"no inner feeling\". Angered by his rejection, she leaves, but he follows and they have sex. His girlfriend runs out of money and arrives unannounced. Her presence creates an awkward situation, but when a family friend ridicules her, he comes to her defense. Storming out, he discovers his father's male nurse giving his sister a sensual massage. He picks a fight with the nurse, who easily subdues him. He tries to persuade the pianist to go away with him, but she declines, telling him he cannot ask for love when he does not love himself. After tearfully confessing his regrets to his unresponsive father, he leaves with his girlfriend. Shortly into the trip, they stop for gas and coffee; while his girlfriend's view is obstructed, he hitches a ride on a truck headed north."
}