{
  "obfuscated_plot": "During a severe winter snowstorm at a major metropolitan airport, an airline flight's crew misjudge their turn from a runway onto the taxiway. The aircraft gets stuck in the snow, causing runway closure. The airport manager is forced to work overtime, causing tension with his wife. A divorce seems imminent as he nurtures a closer relationship with a co-worker. A pilot is scheduled to evaluate another captain during an international flight to a European destination. Despite being married, the pilot is having an affair with a chief stewardess who informs him she is pregnant with his child. They consider abortion, but she has moral qualms about the procedure.\n\nThe airport manager calls in a senior mechanic to assist with removing the snowstuck plane. He also deals with an elderly widow who is a habitual stowaway on various airlines. The manager clashes with a commissioner about runway operations.\n\nA former demolition expert with a history of mental illness buys a ticket and a large life insurance policy, intending to commit suicide by bombing the aircraft over the ocean so his wife will collect insurance. His erratic behavior attracts officials' attention. His wife discovers his plan and goes to the airport to dissuade him.\n\nThe stowaway widow boards the flight and sits next to the potential bomber. When the crew becomes aware of the situation, they turn the plane back toward the originating city without informing passengers. They attempt to enlist the stowaway's help to retrieve the bomb, but fail.\n\nThe pilot tries to persuade the bomber not to trigger the device. The bomber ultimately runs to the lavatory and detonates the bomb, dying and creating significant damage to the aircraft. Some passengers are seriously injured, but the pilots maintain control.\n\nWith all nearby airports closed due to bad weather, the damaged flight returns for an emergency landing. The pilot demands the longest runway, which is currently blocked by the stuck aircraft. The airport manager orders the blocking plane to be pushed aside, and the senior mechanic manages to free it without damage, allowing the crippled flight to land safely.\n\nAs passengers exit, the bomber's wife apologizes for her husband's actions. The pilot's affair is now complicated by the stewardess's pregnancy, which he now wants her to keep. The stowaway receives a reward of free travel, and the airport manager leaves with his potential new romantic partner."
}