{
  "obfuscated_plot": "In the early 1950s, two high school seniors and best friends live in a small oil town. One is dating the prettiest girl in town, who comes from the wealthiest family. The other breaks up with his girlfriend due to a secret crush on her. At a Christmas dance, the girl is invited to a skinny-dipping party by another boy, a seemingly better prospect. At the dance, the first boy kisses a depressed middle-aged woman who is married to his high school coach. The friends take their mentally disabled friend to a prostitute to lose his virginity. A local businessman, respected by the town, is angered by their treatment of the disabled friend and bans them from his businesses, which are the only entertainment in town.\n\nLater, the businessman catches the first boy visiting the disabled friend and a waitress at a café, apologizes, and lifts the ban. Another young man makes an advance on the girl but refuses to have sex because she is a virgin. On a New Year's Eve weekend, the two friends impulsively drive to another country. Before leaving, the nostalgic businessman gives them extra money to enjoy themselves. When they return, they learn he died suddenly of a stroke. He leaves the first boy his pool hall in his will.\n\nThe girl invites her boyfriend to a motel room for sex to be accepted into a libertine social circle. Unable to perform initially, they eventually do, and she breaks up with him by phone, hoping to become involved with another boy. However, she learns he has married someone else. Out of boredom and feeling rejected, she has sex with her father's foreman, who is also her mother's lover.\n\nUpset over the breakup, the boyfriend enlists in the military and is scheduled to serve in an ongoing war. In his absence, the girl pursues the first boy, who drops his previous romantic interest and dreams of marrying her. The boyfriend returns home on leave and fights with the first boy, injuring him. They elope to a nearby state, but the marriage is quickly annulled.\n\nOn the boyfriend's last night of leave, they make amends. The next morning, their disabled friend is killed while sweeping the road. Grief-stricken, the first boy becomes angry and depressed. He initially drives away but returns, ultimately seeking comfort from his previous romantic interest. She lets him in, and after an emotional confrontation, she comforts him with the words, \"Never you mind, honey. Never you mind.\""
}