{
  "obfuscated_plot": "In a southern European coastal city, a police detective follows a drug lord who runs a heroin-smuggling syndicate. The syndicate's hitman murders the detective. The drug lord plans to smuggle a massive quantity of heroin into a large North American country by hiding it in the car of his unsuspecting friend, a television personality, who is traveling by ship. In a major urban neighborhood, two police detectives disguised and undercover stake out a bar known for drug trafficking. They later observe a local couple entertaining criminal mobsters involved in narcotics. The detectives establish a link between the couple and a lawyer who is a buyer in the narcotics underworld. The detective learns that a heroin shipment will arrive soon.\n\nThe detectives and federal agents begin surveillance. The vehicle arrives in the large city. The local criminal is eager to make the purchase, but the lawyer urges patience, knowing they are being watched. The drug lord realizes he is under surveillance, identifies one detective, and escapes via public transit. To evade detection, he arranges a meeting in another major city, where the local criminal requests a delay to avoid police. The drug lord wants to complete the deal quickly.\n\nDuring transit, the hitman offers to eliminate the detective, but the drug lord initially refuses. The hitman eventually attempts to snipe the detective but fails. A dramatic chase ensues involving a subway train, with the detective pursuing the hitman through city streets. The hitman hijacks the train, shoots an intervening officer, and causes chaos. The detective ultimately kills the hitman.\n\nAfter a lengthy stakeout, the detectives impound the television personality's vehicle. In a police garage, mechanics meticulously search the car and discover hidden heroin packages. They re-hide the contraband and return the car to the television personality, who delivers it to the drug lord.\n\nThe drug lord meets with the lawyer and his associates at an industrial location to complete the drug transaction. After confirming the heroin's quality, he plans to hide the money in another vehicle to transport back to his home country. A massive police operation intercepts them, resulting in a shootout where the local criminal is killed and most others surrender.\n\nDuring the final confrontation in an abandoned building, the detective accidentally kills a federal agent while pursuing the drug lord. The plot concludes with various legal outcomes: the lawyer's case is dismissed, some criminals receive reduced sentences, the television personality serves prison time, and the drug lord reportedly escapes back to his home country. The detectives are reassigned from the narcotics division."
}