{
  "obfuscated_plot": "In the early 1930s in a European capital city, a young, openly promiscuous American performer works at a local nightclub. A new foreign arrival in the city moves into the boarding house where she lives. A reserved academic and writer must give language lessons to earn a living while completing his doctorate. The performer tries to seduce the academic, but he reveals he has previously failed in sexual relationships with women. They become friends, and he witnesses her bohemian life during the final days of the current political republic. After consoling her about a family disappointment, they become lovers. A wealthy, married aristocratic playboy befriends the performer and takes her and the academic to his country estate where they are both courted. After an enigmatic encounter, the aristocrat abandons his pursuit of the pair. During an argument, they reveal they have both been intimate with the aristocrat. The performer discovers she is pregnant and unsure of the father. The academic offers marriage and a university life, but she becomes disheartened by the prospect of a conventional life. She ultimately has an abortion without telling him in advance. When confronted, they reach an understanding, and he departs for his home country while she remains at the nightclub.\n\nSimultaneously, a Jewish man passing as a Christian falls in love with a wealthy Jewish heiress. Through the academic's advice, he successfully wins her love and eventually reveals his true background, leading to their marriage. The rise of fascism serves as an ongoing backdrop, with increasing political tension demonstrated through various scenes showing the growing power of the nationalist movement. The transformation of social spaces becomes evident, with nationalist supporters gradually occupying cultural venues and public spaces. The story concludes with a sense of impending political darkness and the characters' personal struggles against the rising tide of extremism."
}