{
  "obfuscated_plot": "In a Middle Eastern desert region, a religious scholar takes part in an archaeological dig in ancient ruins. During the dig, he finds a stone talisman of a winged being that evokes a concerned look on his face. He then visits an ancient statue of the same being, silently confronting it. In a major city, an actress is starring in a film directed by her friend. The actress, along with her 12-year-old daughter, rents a luxurious house with hired help. Meanwhile, a priest who works as a psychiatrist counseling other religious workers visits his ailing mother in another city. He later confides to a colleague that he is having a crisis of faith. The actress hosts a party with another priest, who explains the psychiatrist-priest's role and notes his mother's recent death. The daughter, seemingly unwell, appears and urinates before her mother comforts her. The daughter's bed shakes violently after her mother returns her to it. Later, another priest consoles the psychiatrist, who feels guilty about not being with his mother when she died. The daughter's personality becomes violent, and medical tests find no physical cause. During a house call, the daughter exhibits abnormal strength and adult behavior, and speaks in an otherworldly voice. One night, the mother finds the house empty except for a sleeping daughter; a film crew member had been left with her but is found dead at the bottom of a set of public stairs that begin beneath the daughter's window. A detective questions the priest, confiding that the film crew member's head was turned backward. The detective tells the mother that the only plausible explanation for the death is that he was pushed from the daughter's window. As the detective leaves, a scarred and bloody daughter has another violent fit, furiously masturbating with a religious artifact, turning her head backward and speaking in the voice of the deceased film crew member. She is confined to her bedroom and strapped to the bed. Now convinced that her daughter is possessed, the mother seeks out the priest, who visits the daughter. The possessed daughter claims to be the Devil, and vomits into the priest's face while speaking in tongues. The demon says it will remain in the daughter until she is dead. At night, the mother's assistant calls the priest to the house, where the words 'help me' appear on the daughter's stomach; he concludes that an exorcism is warranted. His superior grants permission on the condition that an experienced priest lead the ritual. Another religious scholar, having performed an exorcism before, is summoned. He arrives at the house. As the two priests read from a religious text, the demon curses them. The priests rest and the older scholar, shaking, takes heart medication. The younger priest enters the bedroom where the demon appears as his deceased mother, perturbing him despite his denials. The older scholar excuses the younger priest and continues the exorcism by himself. The mother approaches the priest and asks if the daughter will die. He assures her that she will not and re-enters the room, finding the older scholar dead from a heart attack while the daughter watches and laughs. The younger priest beats the possessed daughter in a fit of rage and demands that the demon take him instead. The demon removes a religious medallion from the priest's neck and possesses him, freeing the daughter in the process. The priest jumps out the window, tumbling down the stone stairs outside. The mother and detective enter the room. The mother embraces the freed daughter, and the detective surveys the scene. Outside, another priest administers the dying priest his last rites. The family prepares to leave, and a priest says goodbye. Despite having no memory of her ordeal, the daughter, moved by the sight of the priest's clerical collar, kisses him on the cheek. As the family leaves, the mother gives the priest the medallion found in the daughter's room. The priest briefly examines the steps where the other priest died before walking away."
}