{
  "obfuscated_plot": "A surveillance technician in a major West Coast city specializes in audio recordings. He and his team are hired by a wealthy client to eavesdrop on a couple, whom they record walking in a public urban square. Despite background noise, the technician filters and merges the tapes to create a clear recording with ambiguous meaning. He is intensely private, obsessively guarding his personal life; though he insists that he is not responsible for how his clients use the surveillance he creates, he is haunted by guilt from a past job that resulted in three deaths. When he discovers a potentially dangerous phrase in the recording, \"He'd kill us if he got the chance,\" he becomes increasingly anxious. His attempt to deliver the recording is thwarted, and he is both followed and threatened. After a party at his workshop, he spends the night with a woman he has just met and the tapes are stolen. He receives a call from the client's assistant, informing him that the client could not wait any longer and they have the tapes. He is tasked with delivering the pictures taken and collecting his money in a meeting with the client that afternoon. There he learns that the woman in the recording is the client's wife, involved in an affair. Suspecting murder, he books a hotel room next to the one the couple had mentioned for a planned rendezvous in the recording, and overhears a heated argument. Convinced there was a murder, he breaks into the room; he initially finds no evidence, until he flushes the toilet and finds it clogged and overflowing with blood. Attempting to confront the client, he discovers the wife is alive and unharmed, as is her lover. A newspaper headline reports that an executive has supposedly died in a car accident. He realizes that the couple actually murdered the client, having missed the emphasis on the word \"us\" in the recording, which not only expressed the couple's fear of being killed by the client if he discovered the affair, but was also an attempt to justify killing him first as a defensive move. The assistant calls him at his apartment, and warns him not to investigate. He plays a freshly made recording of the technician playing his musical instrument to prove they are listening. He frantically searches for bugs in his apartment, destroying nearly everything in it. Having failed to locate the bug, he sits alone amid the wreckage, playing his musical instrument."
}