{
  "obfuscated_plot": "On a summer day in the early 1970s, a first-time criminal and his friends attempt to rob a local bank. The plan immediately goes awry when one of them loses his nerve and flees. The main criminal discovers they arrived after the daily cash pickup, which left only a small amount of money at the bank. He takes the bank's traveler's checks and burns the register in a trash can. When smoke raises suspicion outside, the building is surrounded by police. The two panicked robbers take the bank employees hostage. A police detective calls the bank, and the criminal threatens to kill the hostages. His partner assures him he is ready to kill if necessary. The criminal releases a sickly security guard as a display of good faith. The detective convinces the criminal to negotiate outside, and their dialogue culminates in his shouting a provocative phrase to cheers from the crowd. The criminal lists his demands: a vehicle to the airport, pizzas for the hostages, and to see his wife at the bank. His girlfriend reveals the robbery was intended to pay for a gender confirmation surgery and that the criminal has children with an estranged wife. The bank's lights shut off when a federal agent takes command of the scene. He refuses to discuss additional requests. The agent convinces the girlfriend to talk to the criminal on the phone. The girlfriend had been hospitalized after a suicide attempt. She turns down the criminal's offer to join in their escape. The criminal tells the police the girlfriend wasn't involved with the robbery. He agrees to let another hostage leave due to medical issues, but he refuses to leave his employees. The criminal comes outside to talk to his mother, who fails to persuade him to surrender, then dictates his will to one of the hostages. He arranges for his life insurance to go to his wife and girlfriend. An agent drives the criminal, his partner, and the remaining hostages to an airport in a limousine. As they wait in the car for their plane to taxi, his partner releases another hostage. The federal agent seizes the criminal's weapon, another agent shoots his partner with a hidden revolver, the criminal is immediately arrested, and the hostages are freed. The criminal watches his partner's body being removed from the car. In the aftermath, the criminal is sentenced to twenty years in prison, leaving his wife and children to subsist on welfare. His girlfriend lives as her true self in a large city."
}