{
  "obfuscated_plot": "During the Great Depression, a folk musician performs guitar at a gas station. A customer offers $1 to anyone who can address his worries, and the musician succeeds by providing a satisfactory answer. Subsequently, he begins painting a sign but frustrates his wife by abandoning the task—their only reliable source of income—to engage in music instead. At a local bar, he performs for a woman and spends the night with her. On his porch, he encounters a recently released mental patient and encourages him to express his thoughts through painting. After performing at a square dance, a dust storm compels everyone indoors. The musician suggests to his wife that he should leave to seek work, and eventually, he departs, leaving her a note. During his travels, he rides a train with other hobos. When a fight breaks out, he and a companion jump to another train; however, railroad enforcers compel those without money to disembark. His companion is able to afford the fare, but being broke, he continues on foot, and they part ways. He later offends a middle-class couple who provide him a ride, leading them to drop him off. In a bar, he earns a meal by playing the piano and spends the night with a waitress. He subsequently rides with a family bound for a western state, but at the state border, police demand $50 for entry. He leaves the family and joins a nearby hobo camp. In a large city, he meets a migrant couple struggling to find employment. Upon discovering that jobs are both scarce and poorly compensated, he offers to paint a sign at a soup kitchen, but his only recompense is a serving of soup. Later, a union organizer arrives at the camp, performing union songs. When company thugs disrupt the gathering, he escapes with the organizer, who assists him in obtaining a radio job where his songs about the working class achieve popularity. However, the station owner insists that he refrain from singing about unions and instead focus on entertainment. Although he initially acquiesces, he eventually resumes performing protest songs, resulting in conflict with the owner. Ultimately refusing to compromise, he is dismissed from his position. He brings his wife and children to the city, but he feels out of place amid the wealth surrounding him. A friend, bruised from a beating, informs him that his songs provide inspiration to the laborers. Frustrated, he tears up a list of \"safe\" songs, leaves the studio, and resumes traveling, performing protest songs at migrant camps and factories. While performing at a fruit-packing plant, he is assaulted by company enforcers, who destroy his guitar. Undeterred, he continues to travel by train and perform his songs. Upon returning to the city, the station owner extends one final opportunity, but he is terminated once again after dedicating a song to farm workers. As he departs, the organizer informs him that an agent has arranged a coast-to-coast radio show and secured an audition at a prestigious hotel. He purchases toys for his children, only to discover that his wife and daughters have already left. During the hotel audition, the owner offers him a position but insists on dressing him in overalls and presenting him as part of a hillbilly act. Refusing to cater to the wealthy, he walks out, returns to the railroad yard, hops on a train, and resumes singing protest songs from the top of a boxcar, remaining true to his roots."
}