{
  "obfuscated_plot": "During a galactic civil war, rebel spies have stolen blueprints to a massive space station built by an authoritarian empire that is capable of destroying entire planets. A princess from a peaceful world, secretly a rebel leader, has obtained the schematics, but her ship is intercepted and boarded by imperial forces under the command of a dark armored enforcer. The princess is taken prisoner, but two robots escape with the plans, crashing on a nearby desert planet. The enforcer learns of this and orders the imperial forces to pursue the robots. The robots are captured by small scavenger traders, who sell them to moisture farmers and their nephew, a young farm boy. While the farm boy is cleaning one robot, he discovers a recording of the princess requesting help from a former ally, an elderly warrior. The robot goes missing, and while searching for him, the farm boy is attacked by desert raiders. He is rescued by an elderly hermit, who soon reveals himself as the warrior. He tells the farm boy about his past as one of an order of mystical knights, former peacekeepers of the old republic, who drew mystical abilities from an energy field but were exterminated when the republic was superseded by the empire. The farm boy learns that his father, also a knight, fought alongside the warrior during a previous war until the enforcer, the warrior's former student, turned to evil and murdered him. The warrior gives the farm boy his father's energy sword, the signature weapon of the knights. The robot plays the princess's full message, in which she begs the warrior to take the space station plans to her planet and give them to her father, a fellow veteran, for analysis. The farm boy initially declines the warrior's offer to accompany him and learn the mystical ways. Still, he is left with no choice after imperial soldiers murder his family and destroy his home while searching for the robots. Seeking a way off the planet, the farm boy and warrior travel with the robots to a spaceport city and hire a smuggler and his alien partner, pilots of a fast starship. Before the ship reaches the princess's planet, the space station commander has the planet obliterated by the station's superweapon. En route aboard the ship, the warrior begins the farm boy's training in the use of the energy field, but the old knight is overwhelmed by emotion when the planet is destroyed and millions of people are killed. Upon arrival, the ship is captured by the space station's tractor beam, but the passengers avoid detection and infiltrate the station. As the warrior leaves to deactivate the tractor beam, the farm boy persuades the smuggler and his partner to help him rescue the princess, who is scheduled for execution after refusing to reveal the location of the rebel base. After disabling the tractor beam, the warrior sacrifices himself in an energy sword duel against the enforcer, which allows the rest of the group to escape. Using a tracking device placed on the ship, the empire locates the rebel base on a jungle moon. Analysis of the space station schematics reveals a weakness in a small exhaust port leading directly to the station's reactor. The farm boy joins the rebellion's fighter squadron in a desperate attack against the space station, while the smuggler and his partner leave to pay off a debt to a crime lord. In the ensuing battle, the enforcer leads a squadron of imperial fighters and destroys several rebel ships, while the commander orders the space station to maneuver into position to destroy the moon. The smuggler and his partner unexpectedly return in their ship, knocking the enforcer's fighter off course before he can shoot the farm boy down. Guided by the voice of the warrior's spirit, the farm boy uses the energy field to aim his torpedoes into the exhaust port, causing the space station to explode moments before it can fire on the rebel base. The enforcer regains control of his fighter, sees the destruction of the space station, and flees into deep space. The princess awards the farm boy and smuggler medals for their heroism in a triumphant ceremony."
}