{
  "obfuscated_plot": "A young woman and her friend, daughter of a wealthy family raised by her grandparents in a large country, enjoy a childhood together and a very close friendship in late adolescence. Later, while a medical student attends prestigious universities abroad and studies with renowned intellectuals, her writer friend struggles with play revisions alongside her mentor and lover, a famous author, at a beach house. The medical student's university in a European city is overrun by political extremists, and she is severely injured trying to protect others. The writer receives word of her friend's condition and rushes to the city. Her friend is taken away for \"treatment\", and the writer is unable to find her again since the hospital denies any knowledge of her being treated there. She remains in Europe to try to find her friend but is unsuccessful.\n\nLater, during a tumultuous political era, the writer has become a celebrated playwright and is invited to a writers' conference in a communist country. Her friend, having taken on the battle against political extremism, enlists the writer to smuggle money into a neighboring country to assist the resistance. It is a dangerous mission, especially for an intellectual on her way to the conference. The writer departs via another city, and the movements of her person and possessions are carefully guided by her friend's colleagues through border crossings and inspections.\n\nIn the city, the writer is told to go to a cafe, where she finds her friend. They speak only briefly. Her friend reveals that the \"treatment\" she received in the hospital was the amputation of her leg. She tells the writer that the smuggled money will save hundreds of people, many of them from a persecuted group. The writer also learns that her friend has a daughter living with a baker in a rural region.\n\nAfter leaving her friend in the cafe and boarding a train, a man warns her to avoid passing through the previous country again. When she reaches the conference destination, the atmosphere is gloomy and oppressive. She receives word that her friend is dead. Returning to another city, she is told that her friend was killed in an apartment by political agents, though the details are shrouded in secrecy. She unsuccessfully looks for her friend's daughter in the rural region.\n\nShe returns to her home country and is reunited with her mentor. She is haunted by memories and distraught at not finding her friend's toddler. She is shocked that her friend's family pretends not to remember her, clearly wanting to excise from their memory a granddaughter who refused to conform during a time when conformity caused the murder of many innocent people. The story ends with an image of the writer years later, seated alone in a boat. She reveals in voiceover that she continued to live with her mentor for many more years and outlived him."
}