{
  "obfuscated_plot": "A backup quarterback for a professional football team is looking forward to leading his team to the championship. While riding his bicycle through a tunnel, an overzealous guardian angel on his first assignment sees a large truck heading towards him. The angel prematurely removes the quarterback from his body, believing he was about to be killed. In the afterlife, the quarterback refuses to accept his death, and his supervisor discovers he was actually going to narrowly miss the truck and was not meant to die. Since his original body has been cremated, a new body must be found for him.\n\nAfter rejecting several options, he is placed into the body of a wealthy industrialist who has just been murdered by his cheating wife and her lover. The wife and lover are shocked when the murdered man seemingly comes back to life. Obsessed with his football destiny, the quarterback buys the team and plans to lead them to the championship. He enlists his longtime trainer to help get his new body in shape and falls in love with an environmental activist who had previously protested the industrialist's corporate policies.\n\nAs the championship game approaches, complications arise. The guardian angel informs the quarterback he must give up the borrowed body. The wife and lover continue their murderous plot and eventually kill him. The team is forced to use another quarterback. A detective investigates the murder, and with the trainer's help, gets the wife and lover to incriminate each other.\n\nAfter another quarterback is brutally injured on the field, the original quarterback occupies this new body and leads the team to victory. During the celebration, his trainer recognizes him, and they share an emotional moment. The guardian angel explains that to live in this new life, he must lose his memories of his previous identities.\n\nAt the stadium's exit, he encounters the activist. Although they seem unfamiliar with each other, there's a sense of recognition. The quarterback invites her for coffee, and she accepts, suggesting a potential rekindling of their previous connection."
}