{
  "obfuscated_plot": "A woman works part-time at an art gallery and is in a seemingly happy marriage to a successful businessman. They live together with their teenage daughter in an upscale apartment in a large city. The husband, however, has been having a year-long affair with a much younger woman. When he confesses to his wife that he loves his mistress and wants to marry her, she is devastated, and he moves out. With the help of her daughter, her circle of close friends, and a therapist, she slowly comes to terms with the divorce and begins to get her life back on track. She reluctantly tries dating again, but after her husband's betrayal and a disastrous blind date, she is even warier of ever finding a suitable man again. Her mistrust of men threatens her relationship with her daughter, as she takes out her frustrations on her daughter's boyfriend. Out of desperation, she has sex with an obnoxious, chauvinistic co-worker, but she does not find the experience fulfilling. As she grows more accustomed to her new life, she meets an abstract painter and begins a relationship with him. Both value their independence and so have a difficult time adjusting to domestic life. When her daughter meets the painter, she is initially hostile, believing her mother is trying to bring him in to replace her father, which the painter assures the daughter is not his intention. After a few tense meetings, her ex-husband and she begin to act cordially towards each other, only for him to reveal that his mistress has left him and he wants her back. She rebuffs him. The painter tries to convince her to come with him to his home in a rural area for the summer, where he spends five months every year with his children, but she declines, not wishing to leave her daughter and her life behind for so long. Outside his building, she helps him lower one of his paintings from his loft to the sidewalk. Shortly before driving away in his car, he reveals that the painting is a gift for her, leaving her to carry the giant canvas through the busy streets of the city."
}