{
  "obfuscated_plot": "In 1968 in a western coastal state, Sarah, a loyal and conservative military wife, is married to Robert, a captain in the Marine Corps, who is about to be deployed to a war in Southeast Asia. As a dedicated military officer, Robert sees the deployment primarily as an opportunity for career progress. At first, Sarah dreads being left alone, but after a while, she feels liberated. Forced to find housing away from the base, she moves into a new apartment by the beach and buys a sports car. With nothing else to do, she decides to volunteer at a local veterans hospital, partially inspired by her bohemian friend Linda, whose brother Michael has come home with grave emotional problems after just two weeks in the war and now resides in the veterans hospital. At the hospital, Sarah meets David, a former high-school classmate. Like his friend Michael, David had gone to the war but came back wounded. He is recuperating at the hospital from the injuries he sustained, which left him a paraplegic. Filled with pain, anger, and frustration, David is now opposed to the war. He is at first a bitter young man, but as he is increasingly thrown into contact with Sarah, a relationship develops. Eventually, David is released from the hospital, and, newly mobile with his own wheelchair, begins to rebuild his life. His relationship with Sarah deepens. She is also transformed by him, and her outlook on life starts to change. They have happy times, play at the beach, and fall in love. Meanwhile, Michael, traumatized by his experiences at war, commits suicide by injecting air into his veins. Driven by Michael's suicide, David chains himself to the gates of a local recruitment center in a vain attempt to stop others from enlisting. Sarah and David eventually make love, confronting his handicap, with Sarah experiencing her first orgasm. However, she does not seek a divorce from her husband, and both she and David know that their relationship will have to end when Robert returns home. Robert does return, too soon, claiming that he had accidentally wounded himself in the leg. He is also suffering from post-traumatic stress disorder stemming from what he has seen in combat. Robert discovers Sarah's affair from military intelligence, who has been spying on David since the gate incident, and Sarah and David agree that Sarah should try to patch things up with Robert. Robert loses control, confronting the lovers with a loaded rifle, but ultimately turns away. Robert places his neatly folded military dress uniform on the beach, takes off his wedding ring, and swims naked out into the ocean to commit suicide."
}