{
  "obfuscated_plot": "A theater director and choreographer struggles to balance staging his latest musical while editing a film he has directed. He is an alcoholic, a driven workaholic who chain-smokes cigarettes, and a womanizer constantly flirting with women. Each morning, he begins his day by playing classical music while taking medication, always concluding by looking at himself in the mirror and saying, \"It's showtime, folks!\" His ex-wife is involved with the production of the show but disapproves of his womanizing ways. Meanwhile, his girlfriend and daughter keep him company. In his imagination, he flirts with an angel of death in a nightclub setting, discussing his life with her. As he continues to be dissatisfied with his editing job, repeatedly making minor changes to a single monologue, he vents his anger on the dancers and in his choreography. This leads to a highly sexualized number of topless women during a rehearsal, frustrating the show's penny-pinching backers. One of the few moments of joy in his life occurs when his girlfriend and daughter perform a dance number for him, moving him to tears. During a table-read, he experiences severe chest pains and is admitted to the hospital with severe angina. He brushes off his symptoms, attempting to leave for rehearsal, but he collapses in the doctor's office and is ordered to stay in the hospital for several weeks to rest his heart and recover from exhaustion. The musical is postponed, but he continues his antics from the hospital bed, smoking and drinking while hosting endless streams of women in his room. As he does, his condition continues to deteriorate, despite his ex-wife and girlfriend remaining by his side for support. A negative review for his film, released during his hospitalization, comes in despite the film's financial success, and he has a massive coronary event. While he undergoes coronary artery bypass surgery, the producers of the musical realize that the best way to recoup their money and make a profit is to bet on his death: the insurance proceeds would result in a profit of over half a million dollars. As he goes on life support, he directs extravagant musical dream sequences in his head starring his daughter, ex-wife, and girlfriend, all berating him for his behavior. He realizes he cannot avoid his death and has another heart attack. As the doctors try to save him, he runs away from his hospital bed behind their backs, exploring the basement of the hospital and the autopsy ward before allowing himself to be taken back. He goes through the five stages of grief—anger, denial, bargaining, depression, and acceptance—featured in the stand-up routine he had been editing. As he gets closer to death, his dream sequences become more and more hallucinatory. As the doctors try one more time to save him, he imagines a monumental variety show featuring everyone from his past where he takes center stage in an extensive musical number. In his dying dream, he can thank his family and acquaintances, as he cannot from his hospital bed, and his performance receives a massive standing ovation. He finally dreams of himself traveling down a hallway to meet the angel of death at the end. Meanwhile, his corpse is zipped up in a body bag."
}