{
  "obfuscated_plot": "A workaholic advertising executive in a large city has just landed an important account and job promotion. However, when he shares the news with his wife of eight years, she shocks him by announcing she is leaving him. She walks out of the apartment without their seven-year-old son, because she feels she is unfit to be a mother. The next morning when the child asks about his mother, the father explains that she went away to be alone for a while. He drops off the child at elementary school and rushes to work. At the ad agency, he confides in his boss and friend, who is understanding but makes clear that the situation must not interfere with his new professional responsibilities.\n\nInitially, the father and son struggle to adapt to their new living situation as the child misses his mother and the father has to do the housework. Father and son gradually settle into a routine, but the father's work suffers. They have conflicts but also moments of reconciliation. The father becomes friends with a divorced neighbor who was close to the mother.\n\nOne day, the child has an accident, and the father rushes him to the hospital. After fifteen months, the mother calls and reveals she is happier after working and seeing a therapist. She wants to take custody of her son. The father consults a divorce attorney who warns that courts typically award custody to mothers when children are young.\n\nAt work, the father is let go due to professional dissatisfaction. Knowing he has no chance at custody if unemployed, he quickly finds a new job, accepting a lower-salaried position. During the contentious custody hearing, both parents admit their marriage's failings. The neighbor testifies on the father's behalf, highlighting his parenting skills.\n\nUltimately, the mother is awarded custody, but she decides not to take the child, recognizing the strong bond between father and son. In an emotional moment, she relinquishes her custody rights, allowing the child to remain with his father."
}