{
  "obfuscated_plot": "In the mid-1940s, a 13-year-old girl is one of eight children of a coal miner raising a family in grinding poverty in a rural Appalachian region. In 1948, at the age of 15, she marries a 22-year-old man, becoming a mother of four by the time she is 19. The family moves to the Pacific Northwest, where her husband works in the forest industry and she sings occasionally at local bars on weekends. After some time, she makes occasional appearances on local radio. By the time she turns 25, a small record label owner hears her sing during one of her early radio appearances. The owner gives the couple money to travel to a large West Coast city to record a demo tape, from which her first single is made. After returning home, her husband suggests they go on a promotional tour to push the record. He shoots his own publicity photo for her and spends many late nights writing letters to show promoters and radio disc jockeys across the South. After receiving an emergency phone call about her father's death, they hit the road with records, photos, and their children. They embark on an extensive promotional tour of radio stations across the South. En route, her first single hits the charts based on radio and jukebox plays, earning her a spot on a famous country music stage show. In the early 1960s, after multiple weekly performances, she is invited to sing at a record shop after her performance. A country music superstar, one of her idols who had recently been hospitalized from a car accident, inspires her to dedicate the star's newest hit to her as a musical get-well card. The superstar listens to the broadcast from her hospital room and sends her husband to fetch the young singer so they can meet. A close friendship follows, which is abruptly ended by the superstar's death in a plane crash. The next few years are a whirlwind. The stress of extensive touring, maintaining her image, overwork, and trying to keep her marriage and family together cause her a nervous breakdown, which she suffers onstage at the beginning of a concert. After a year off at her ranch, she goes back on the road, returning to establish herself as a leading country music performer. The story closes with her recounting her life story through a hit song to a sold-out audience."
}