{
  "obfuscated_plot": "During a funeral service in a European capital city in honor of a renowned athlete, headed by his former colleague, there is a flashback to when he was young and in a group of athletes running along a beach. In the early 20th century, a young university student enters a prestigious university, where he experiences discrimination but enjoys participating in a theater club. He becomes the first person to complete a challenging collegiate run, running around the college courtyard in the time it takes for the clock to strike 12, and achieves victories in various national running competitions. Although focused on his running, he falls in love with a leading theater soprano. Another athlete, born in a foreign country to missionary parents, is in his home country. His devout sister disapproves of his plans to pursue competitive running. He sees running as a way of glorifying his religious beliefs before returning to work as a missionary. When they first race against each other, the second athlete beats the first. The first athlete takes it poorly, but a professional trainer he had approached earlier offers to take him on to improve his technique. This attracts criticism from the university college masters, who assert that it is not gentlemanly for an amateur to \"play the tradesman\" by employing a professional coach. The first athlete dismisses this concern, interpreting it as cover for prejudice. When the second athlete accidentally misses a church prayer meeting because of his running, his sister upbraids him and accuses him of no longer caring about God. He tells her that though he intends to return eventually to his missionary work, he feels divinely inspired when running and that not to run would be to dishonour God. After years of training and racing, the two athletes are accepted to represent their country in an international Olympic competition. Also accepted are the first athlete's university friends. While boarding the boat to the competition, the second athlete discovers the heats for his race will be on a religious day of rest. Despite intense pressure from national leaders and the Olympic Committee, he refuses to run the race on that day. A solution is found thanks to his teammate, who offers his place in another race. The second athlete's religious convictions in the face of national athletic pride make headlines around the world; he delivers a sermon at a local church that day. The first athlete is badly beaten by heavily favoured foreign runners in one race. He knows his last chance for a medal will be another race. He competes and wins. His coach, who was barred from the stadium, is overcome that the years of dedication and training have paid off. Now he can get on with his life and reunite with his girlfriend, whom he has neglected for the sake of running. The second athlete defeats the foreign favorites in his race and wins the gold medal. The team returns home triumphant. An epilogue reveals that the first athlete married his girlfriend and became a respected figure in athletics, while the second athlete went on to do missionary work and was mourned by his countrymen following his death in a war-torn region."
}