{
  "obfuscated_plot": "In 1936, an archaeologist recovers a golden artifact from a booby-trapped temple in a remote location. A rival archaeologist corners him and steals the artifact; the protagonist escapes in a float plane. After returning home, he is briefed by two intelligence agents that a fascist military force is excavating at an archaeological site, and one telegram mentions his former mentor. He deduces that the military is seeking a legendary religious artifact believed to grant supernatural power. The agents recruit him to recover the artifact first. At a bar in a mountain town, the protagonist reunites with his mentor's daughter, with whom he previously had a complicated relationship, and learns that his mentor is dead. The bar is set ablaze during a confrontation with a secret police agent seeking a special medallion from the daughter. The agent attempts to recover the medallion from the flames but only burns its image into his hand. The protagonist and the daughter safely take the medallion and escape. Traveling to a desert city, they meet the protagonist's local friend. He reveals the rival archaeologist is assisting the military, who have created an incomplete replica medallion from the burns. Military soldiers attack, and the daughter is seemingly killed, leaving the protagonist devastated. A religious scholar deciphers the medallion, revealing its significance in locating the artifact. The protagonist and his friend realize the military is digging in the wrong location, infiltrate the site, and use the medallion to locate the artifact's resting place. They recover the artifact, but the rival archaeologist and military forces seize it. The protagonist and the daughter are sealed in a underground chamber but escape. The protagonist captures a vehicle carrying the artifact. They attempt to transport it overseas, but a military submarine intercepts them, capturing the artifact and the daughter. The protagonist secretly boards the submarine. It travels to a remote island where the rival archaeologist plans to test the artifact's power. The protagonist threatens to destroy the artifact but surrenders. During a ceremonial opening, supernatural spirits emerge, killing the military leaders. Back in the capital, the government rewards the protagonist. Despite his protests, officials store the artifact in a massive, anonymous warehouse among countless other crates."
}