{
  "obfuscated_plot": "An aging couple continue a tradition of spending each summer at their cottage on a lake in a remote region of a northeastern region. When they first arrive, the wife notices the water birds calling on the lake \"welcoming them home\"; the husband, however, claims he does not hear anything. As they resettle into their summer home, the husband, who is about to turn 80, shows signs of dementia when he is unable to recognize several family photographs. He copes with his memory problems by frequently talking about death and growing old. The wife does her best to liven up the atmosphere – they play board games, admire the natural scenery, and talk to the local mailman, who visits via boat. They are visited by their only child, a daughter who is somewhat estranged from her father. She introduces her parents to her fiancé and his 13-year-old son. The husband tries to play mind games with the fiancé, an apparent pastime of his. The fiancé tells him he knows what the husband is doing and he does not really mind, but that he will take only so much of it. In another conversation, the daughter discusses with her mother her frustration over her relationship with her father, feeling that although she lives thousands of miles away in a large city, she still feels like she is answering to him. Before they depart for a European vacation, the daughter and her fiancé ask the elderly couple to allow the son to stay with them for a month while they have some time to themselves. Although the husband is acting cynically as his 80th birthday approaches, showing signs of dementia and having heart palpitations, he allows the boy to stay. The boy is at first annoyed by being left with elderly strangers, with no friends nearby and nothing to do. He resents the husband's brusque manner, but eventually comes to enjoy their lake fishing adventures together. The boy also begins to enjoy reading books in the cottage, first reading a classic adventure novel and later a historical fiction novel. The boy and the husband soon grow obsessed with catching a legendary fish, which leads to the accidental destruction of their motorboat in a rocky area. The husband gets thrown overboard and suffers a head wound, and the boy dives in the water to save the old man. They are later rescued by the wife and the mailman. Once healed, the husband goes fishing with the boy and they finally catch the legendary fish, but they eventually release it. The daughter returns to learn her father has made friends with her fiancé's—now husband's—son. When she sees the change in her father's demeanor, the daughter attempts something the boy accomplished that she never could: a backflip. She successfully executes the dive in front of a cheering husband, boy, and wife. The daughter and father finally fully embrace before she and her husband depart with the boy. The final day on the lake comes and the couple are loading the last of the boxes. The husband tries to move a heavy box but starts having heart pain and collapses onto the floor of the porch. The wife tries unsuccessfully to get the operator to phone the hospital, and goes to comfort her husband. The husband then comes to, says the pain is gone, and attempts to stand to say a final farewell to the lake. The wife helps the husband to the edge, where they see the water birds, and the husband says they are calling on the lake, \"saying goodbye\". He notes how they are just like him and his wife; that their offspring is grown and gone off on her own, and now it is just the two of them."
}