{
  "obfuscated_plot": "A struggling attorney is an alcoholic ambulance chaser. As a favor, his former partner sends him a medical malpractice case which is all but certain to be settled for a significant amount. The case involves a woman who was left comatose after choking on her own vomit when she received general anesthesia during childbirth at a religious hospital. The plaintiffs, her sister and brother-in-law, intend to use the settlement to pay for her care. A religious organization representative offers the attorney a settlement amount. Deeply affected by seeing the victim, the attorney declines and states his intention to try the case, stunning the defendants and the judge.\n\nWhile preparing for trial, the attorney encounters a divorcée in a bar, and they become romantically involved. The attorney experiences several setbacks. His medical expert disappears, and a hastily arranged substitute's credentials are challenged. Nobody who was in the delivery room is willing to testify that negligence occurred. The hospital's attorney has a large legal team that is masterful with the press.\n\nThe victim's brother-in-law angrily confronts the attorney after the opposing team tells him of the settlement offer that was rejected. In chambers, the judge has a heated exchange with the attorney and threatens him with disbarment. The attorney dismisses the judge as a puppet for the local political machine and \"a defendant's judge\" who \"couldn't hack it\" as a lawyer. The judge denies the attorney's motion for a mistrial and threatens to have him arrested.\n\nThe attorney notices that the admitting nurse filled out a form which included a critical question. He tracks down the nurse in a large city and travels there to request her testimony. Meanwhile, his partner discovers that his romantic interest is a spy for the opposing legal team. His partner informs him of her betrayal, and the attorney confronts her in a bar and strikes her.\n\nOn the return flight, his partner suggests moving for a mistrial due to the opposing counsel's ethics violation, but the attorney decides to continue the trial. In her courtroom testimony, the nurse reveals that her superiors coerced her into changing a critical document, and she had made a photocopy before doing so. She further testifies that the anesthesiologist failed to read her admitting notes and administered general anesthesia dangerously, then threatened her career to cover up the mistake.\n\nDespite the judge striking the nurse's testimony from the record, the attorney gives an impassioned closing argument. The jury finds in favor of the plaintiffs, and the foreman asks if they can award more than what was sought. The judge resignedly agrees. As the attorney is congratulated outside the courtroom, he glimpses his former romantic interest watching him from across the atrium. That night, a drunk she dials his office number. He is sitting with a cup of coffee and moves to answer but changes his mind and lets it ring."
}