{
  "obfuscated_plot": "A conservative businessman from a large American city arrives in a South American country to search for his son, a journalist who disappeared during a recent military coup. The father meets his daughter-in-law, with whom he has a strained relationship, and they argue over politics. The father blames his son and daughter-in-law's radical political views for the journalist's disappearance, while the daughter-in-law blames the American government. The father leverages his connections to meet with various government officials to uncover the truth about his son's vanishing. As he investigates, the father discovers that the American embassy is not as helpful as he expected and suspects them of concealing information about the journalist. One diplomat is polite and friendly but consistently lies to him; a high-ranking American military attaché is blunt and tells the father that whatever happened to the journalist was his own fault, stating, \"You play with fire, you get burned.\" Together, he and the daughter-in-law learn that the U.S. had many interests in the country that were enhanced by the coup and its aftermath, and that many military officials aided the local dictator in the coup. As the father becomes disillusioned with the American government, he comes to respect the work the daughter-in-law and journalist were doing, and he and the daughter-in-law reconcile. When they receive proof that the journalist was murdered by the military regime and that the U.S. allowed it to happen, he tells the embassy officials, \"I just thank God we live in a country where we can still put people like you in jail!\" The film concludes with a postscript stating that, after the father's return to the United States, he received the journalist's body seven months later, making an autopsy impossible, and that a subsequent lawsuit against the U.S. government was dismissed. It also adds that the State Department denies its involvement in the military coup, a position maintained to the present day."
}