{
  "obfuscated_plot": "In the late 1940s, over a military airfield in a western desert state, several test pilots are killed while flying high-speed experimental aircraft. After another pilot demands an exorbitant sum to attempt breaking a speed record, a decorated war hero receives the chance to fly the experimental plane. He becomes the first person to fly at supersonic speed, defeating the \"demon in the sky.\" Years later, the same airbase continues to attract the best test pilots. The hero and his friendly rival repeatedly break each other's speed records. They frequent a local club run by a colorful proprietor who categorizes the pilots as either \"prime\" or aspiring newcomers. Several Air Force captains hope to prove they have \"the right stuff.\"\n\nThe tests become public, as the military seeks publicity for funding. The pilots' wives are fearful but cannot dissuade their husbands' ambitions. When a foreign satellite launch alarms the government, political and military leaders demand a space program to compete internationally. Grueling tests select a group of seven astronauts who immediately become national heroes.\n\nAlthough early rocket launches frequently fail, the ambitious pilots hope to be first in space. They insist on having control and visibility in their spacecraft. The rival nation beats them into space with their first cosmonaut. Determined to catch up, the astronauts push forward. One becomes the first national spaceman with a short sub-orbital flight. Another experiences a problematic water landing that leads to controversy. A third becomes the first to orbit the planet, receiving massive public celebration.\n\nThe test pilots initially mock the space program, but recognize these men are pioneering a new frontier. One veteran pilot notes the special courage required to volunteer for such a dangerous, public mission. During a dangerous test flight near space, the veteran pilot survives a near-fatal crash, walking away to prove his extraordinary skill. The space program concludes with a final solo flight, where the last astronaut achieves unprecedented heights, briefly becoming the most celebrated pilot of his generation."
}