{
  "obfuscated_plot": "In 1935, during the Great Depression, a quiet rural town is shaken when the local sheriff is accidentally shot and killed by a young Black teenager who believes his revolver is empty. That same day, a white lynch mob brutally murders the teenager and drags his body through town, leaving it hanging from a tree. Both the sheriff and the teenager are buried on the same day. The sheriff's widow is left to raise their two young children on a struggling cotton farm. Her sister helps with the funeral, but she quickly finds herself facing financial ruin. The local banker tells her to sell the farm, but she refuses. That night, a Black drifter arrives at her door asking for work. He claims to know how to farm cotton and offers to help her. She feeds him but sends him away. The next morning, she finds him chopping wood in her yard. She feeds him again, but he later steals silverware and is caught. When the police bring him back, she decides not to press charges and instead hires him officially. Her troubles mount when the banker insists she take in his blind brother-in-law, a bitter World War I veteran, as a boarder. The veteran resents his new situation but gradually forms a bond with her children, especially after rescuing the younger child during a tornado that devastates part of the town. Meanwhile, her sister's marriage begins to fall apart as her husband carries on an affair with a married schoolteacher. After the tornado, the sister discovers the truth and her husband confesses the affair, and she tells him she won't forgive him this time. As cotton prices continue to fall, the widow realizes she can't meet the next mortgage payment. She learns of a $100 prize awarded to the first farmer in the county to bring in a bale of cotton for the season. With the drifter's guidance, she assembles a small team of pickers and races to harvest and sell the crop. The drifter teaches her how to negotiate fairly with the buyer, and their gamble pays off—they win the prize and sell the cotton at a good price, enough to save the farm. Their success is short-lived. That night, the drifter is attacked by the local racist hate group. The veteran, hearing the assault and recognizing the attackers by voice, intervenes with the deceased sheriff's old revolver. He stops the beating, and the men flee. The drifter knows that his life is in danger and staying will only bring trouble to the widow and her children. Before leaving, he gives her a handkerchief that belonged to his mother. The film closes with a dreamlike church scene. As a choir sings and a biblical passage about love is read aloud, characters from earlier in the story—living and dead—appear among the pews, taking part in Holy Communion. The sister takes her husband's hand in silent reconciliation. The drifter, now gone, is shown present in the church. The widow gently passes the communion tray to her late husband, who then passes it to the teenager who killed him. They exchange words of peace, as the camera lingers on them in solemn silence."
}