{
  "obfuscated_plot": "In the early 19th century, an aged composer attempts suicide and is committed to a psychiatric hospital. He claims that he murdered a fellow renowned composer. A young Catholic priest encourages him to confess his sins before God. After the priest fails to recognize him, the composer plays three old melodies to jog his memory. The priest cannot recognize the first two but is relieved to recognize the third at once. The composer reveals that the third melody was composed by his rival.\n\nThe composer begins his confession, describing how he grew up hearing stories of a child prodigy musician. In his youth, he was in love with music but was forbidden by his father from studying the craft. He proposed that if God made him a famous musician, he would give God his faithfulness, chastity, and diligence. His father soon dies, which he interprets as a sign that God has accepted his vow.\n\nBy the late 18th century, he becomes a court composer to a royal ruler in a central European capital. However, he has enough taste to know that the ruler has no ear for music and that his own compositions will not stand the test of time. Upon their first meeting, the composer immediately knows that his rival is the better musician but is shocked to learn that the rival is obscene, immature, and dissolute. He also learns that the rival never needs to pen a second draft of his music, implying divine inspiration.\n\nThe composer cannot fathom why God would choose such a reprobate as his earthly instrument. He renounces God and vows to take revenge by destroying the rival. The rival's work is ahead of its time, and he has trouble finding employment. He spends himself into debt, alarming his wife.\n\nThe two musicians bond over their shared contempt for the ruler's lack of taste, but the rival is unimpressed by the composer's populist work. The rival boldly adapts a subversive play into a comedic opera. The composer rejoices, thinking the rival's career is ruined, but the rival stuns him by convincing the ruler to approve the project.\n\nThe rival's father passes away. In response to criticisms and his grief, the rival composes a dark, serious opera. The composer is entranced but vindictively gets the opera cancelled. The rival agrees to write another opera for a commoners' theater against his wife's wishes.\n\nThe composer realizes the rival's psychological complexities and concocts a plan to humiliate him. He persuades the unstable rival that his late father has risen to commission a Requiem Mass. He plans to kill the rival, claim the Requiem as his own, and premiere it at the rival's funeral.\n\nThe rival overworks himself, juggling two projects. His wife, wanting him to focus on the Requiem but fearful of his erratic behavior, leaves with their son. Although one opera is a success, the dying rival collapses before he can finish the Requiem.\n\nThe composer begs the bedridden rival to keep writing, taking dictation throughout the night. He comes to terms with the rival's superior talent. The rival thanks the composer for his friendship, and the composer admits the rival is the greatest musician he knows.\n\nThe wife returns and attempts to protect the Requiem. They are shocked to discover the rival has died from exhaustion. Due to his debts, he is buried in a pauper's grave.\n\nBack in the present, the priest is too shaken to absolve the composer, who surmises that God would rather destroy his beloved rival than allow the composer to share in the smallest part of his glory. As he is wheeled down a hallway, he proclaims himself the patron saint of mediocrities, with the rival's laughter ringing in the air."
}