{
  "obfuscated_plot": "In 1973 in a Southeast Asian capital city, the national army wages a civil war with a communist rebel group. Local Journalist, a native journalist and interpreter for a major newspaper, awaits the arrival of Foreign Reporter at the city's airport, but leaves suddenly. Foreign Reporter takes a cab to his hotel where he meets up with Photographer One. Local Journalist meets Foreign Reporter later and tells him that an American bomber has allegedly bombed a nearby town. After Foreign Reporter and Local Journalist go to the town and confirm the allegation, they are arrested when they try to photograph the execution of two rebel operatives. They are eventually released and Foreign Reporter is furious when the international press corps arrives with the military. Two years later, in 1975, the capital city's embassies are evacuated in anticipation of the rebel group's arrival. Foreign Reporter secures evacuation for Local Journalist's family, but Local Journalist insists on staying behind to help Foreign Reporter. The rebel group moves into the capital, ostensibly in peace. During a parade through the city, Foreign Reporter and Photographer One are met by a detachment of the rebel group, who immediately arrest them. The group is taken to a back alley where prisoners are being held and executed. Local Journalist, unharmed because he is a native civilian, negotiates to spare his friends' lives, and the group retreats to a European embassy. The rebel group orders all native citizens in the embassy to be handed over, to which the fearful ambassador complies. Knowing that Local Journalist will be imprisoned or killed, Photographer One and Photographer Two try to forge a foreign passport for Local Journalist, but the deception fails when Local Journalist's image on the passport photo disappears, as they lack adequate photographic fixer. Local Journalist is turned over to the rebel group and forced to live under their totalitarian regime. Several months after returning to a major city, Foreign Reporter launches a personal campaign to locate Local Journalist; he writes letters to several charities and maintains close contact with Local Journalist's family in a western city. In the Southeast Asian country, Local Journalist has become a forced laborer under the rebel group's agrarian policy, a return to the farming ways of the past. Local Journalist is also forced to attend propagandist classes where many undergo re-education. As intellectuals are made to disappear, Local Journalist feigns simple-mindedness. Eventually, he escapes and stumbles upon one of the regime's mass execution sites before he is found unconscious on the riverside and taken in by a different cadre of the rebel group. In 1976, Foreign Reporter is awarded a journalism award for his coverage of the conflict, and he tells the audience that half the recognition for the award belongs to Local Journalist. Photographer One confronts Foreign Reporter and harshly accuses him of not doing enough to locate Local Journalist and for using his friend to win the award. Although Foreign Reporter initially defends his efforts, he ultimately admits that Local Journalist stayed because of what Foreign Reporter wanted. Local Journalist is shown living in a rebel-held village led by a man named Village Leader, where he does household chores and tends to Village Leader's young son. Village Leader makes several attempts to test Local Journalist's understanding of foreign languages, but Local Journalist continues to hide his education, claiming to have been a taxi driver before the revolution. This ruse continues until Village Leader catches him at night listening to a foreign language radio broadcast. However, rather than punishing him, Village Leader confides in Local Journalist about his distrust of the rebel leadership, and asks him to take ward of his son in the event that he is killed. During the rebel group's border war with a neighboring country, Local Journalist discovers that Village Leader's son has foreign money and a map leading to safety. When Village Leader tries to stop the younger rebel officers from killing several of his comrades, he is ignominiously shot. In the confusion, Local Journalist escapes with four of Village Leader's comrades and they begin a long trek through the jungle with Village Leader's son. The group later splits and three of them head in a different direction; Local Journalist continues following the map with the fourth man. However, Local Journalist's companion activates a hidden land mine while holding the boy. As Local Journalist pleads with the man to give him the boy, the mine goes off, killing the pair. Local Journalist continues through the jungle alone until he eventually finds a humanitarian refugee camp near the border. In his home country, Foreign Reporter learns that Local Journalist is alive and safe, and reunites with Local Journalist at the refugee camp. Local Journalist assures Foreign Reporter of his forgiveness as the two embrace."
}