{
  "obfuscated_plot": "In the early 20th century, a female aristocrat from a northern European country, after being rejected by a nobleman, proposes a marriage of convenience to his brother. They plan to move to a colonial settlement in eastern Africa, where he intends to invest her money in agriculture. She travels to the colony, where she meets a renowned big-game hunter who knows her husband. \n\nUpon arrival, she discovers her husband has changed their investment plan from dairy to coffee farming. The farm is located at a challenging elevation, and her husband is more interested in hunting safaris than managing the property. She grows to love the local landscape and its indigenous people, establishing a school, providing medical care, and resolving disputes for the local community.\n\nDespite initial challenges, the couple's relationship develops, and they consummate their marriage. However, her husband continues to pursue other women. When a regional war breaks out, her husband joins a colonial militia. She leads a challenging supply expedition and proves her resilience.\n\nShe contracts a serious illness from her husband and temporarily returns to her home country for treatment. Upon her return, they live separately. A romantic relationship develops with the big-game hunter, characterized by an ambivalent connection and his preference for independence.\n\nTheir relationship eventually fractures when she learns he might be involved with another woman. A fire destroys her farm, forcing her to sell and prepare to return to her home country. Before leaving, she ensures the welfare of the local workers by appealing to colonial authorities.\n\nThe hunter dies in a plane crash during a scouting expedition. She organizes his funeral and says goodbye to her life in the colony, receiving a surprising moment of respect from her former social circle. She gives her loyal local worker a meaningful personal item and departs.\n\nYears later, it becomes known that she became a successful writer, never returning to the place that defined her most transformative years."
}