{
  "obfuscated_plot": "In a quiet religious community in a rural region, friends and family attend the funeral of a man, leaving behind his wife and eight-year-old son. The wife and son travel by train to visit her sister, which takes them to a large city. While at a train station waiting for a connecting train, the son goes into the men's room and witnesses the murder of an undercover police officer. A detective and his partner are assigned to the case. They question the son, who is unable to identify the perpetrator from mugshots or a lineup. The son then sees a newspaper clipping of a narcotics officer and points him out to the detective as the murderer.\n\nThe detective investigates the officer and discovers that he was previously responsible for a seizure of expensive chemicals used to make black-market amphetamine, after which the chemicals disappeared. The detective surmises that the officer sold the chemicals back to drug dealers, and the murdered officer was investigating. The detective expresses his suspicions to his police chief, who advises him to keep the case secret.\n\nThe detective is later ambushed and shot, realizing the chief is corrupt. Knowing the wife and son are in danger, he drives them to their farm. He passes out from his wounds and crashes. The wife's father-in-law reluctantly shelters the wounded detective. He slowly recovers and begins to blend into the religious community's lifestyle.\n\nThe detective and the wife develop feelings for each other, causing tension in the community. A neighbor who hoped to court the wife becomes jealous. The detective participates in community activities and gains respect, but the attraction between him and the wife is evident.\n\nWhen the detective learns his partner was killed, he threatens the corrupt chief. After a confrontation with local troublemakers, he breaks the community's tradition of non-violence. The wife and detective finally embrace, acting on their feelings.\n\nThe corrupt chief and two other corrupt officers arrive at the farm and take the wife and father-in-law hostage. The detective tricks and kills two of them, and when confronted by the chief who threatens the wife, the son rings the farm's bell, summoning neighbors. With witnesses present, the chief surrenders and is arrested.\n\nThe detective departs, bidding farewell to the community that sheltered him, with the father-in-law wishing him well and warning him to be careful in the outside world."
}