{
  "obfuscated_plot": "A passionate new teacher arrives at a school for deaf and hard of hearing in a northeastern region. He soon sees a young deaf woman working as a janitor. She, a former top student, is not well regarded by the hearing staff, but seems to integrate well with the deaf students. The teacher begins to try to talk with her, arranging a meeting through her boss, pursuing her after school while she is attempting to clean, and persisting despite being rejected several times. She eventually agrees to go to dinner, and from the sidelines he watches her dance as she feels the music. She does not want to use her voice, and he eventually agrees not to try to force her to—a promise he later breaks. He finds out that she refuses to visit her home, and assumes her mother has stopped reaching out. Through her mother, he learns that she and her sister were popular, and according to her mother her peers treated her as if she was not different from other women. Unfortunately, she later reveals that she was sorely used by unnamed men, and may have been a victim of sexual abuse. Such treatment has led her to mistrust men and resist interacting with anyone. Later, in a pool scene, he walks in on her swimming nude. The teacher confesses that he is falling in love with her. She seems to be afraid. He falls into the pool on purpose, which changes the mood of the interaction. They share a passionate kiss in the water, then he undresses. It is implied that they have sex that night for the first time. The relationship between them develops. The school superintendent warns the teacher that he does not believe the relationship will work, but he is adamant that he will stay with her because he loves her. The teacher choreographs a dance with his deaf students, in which they lip-sync to a song on a stage in front of their parents. She sees this performance and becomes upset over the fact that the students use their voices. The conflict between them persists as she thinks he hates her for not speaking. He convinces her to leave her job and move in with him, although it is not clear what her plans for the future are. His determination to hear her speak and his inability to help her develop individual pursuits frustrates her, and she feels he is patronizing her. They split up shortly after. She leaves him and goes to live with her estranged mother, reconciling with her in the process. He chases her, but she refuses to see him. After inquiring about her, he learns she is working as a manicurist. Eventually, they reconcile at the school prom. They decide to learn how to stay connected in between the worlds of silence and sound."
}