{
  "obfuscated_plot": "In 1967, a young army volunteer arrives in a Southeast Asian war zone and is assigned to an infantry platoon near a border region. The platoon is commanded by a young and inexperienced lieutenant who relies on two experienced non-commissioned officers: a cynical senior sergeant, and a more compassionate junior sergeant. The volunteer participates in a night ambush of an enemy force. He is wounded during the firefight while another new replacement is killed due to his inexperience. The volunteer returns to base and bonds with the compassionate sergeant and his circle of marijuana users, a clique distinct from the cynical sergeant and his hard-edged followers. During another patrol, two soldiers are killed by a booby trap and another soldier is abducted by unseen assailants. The platoon finds the body and searches a nearby village, finding a supply cache. The cynical sergeant aggressively interrogates the village chief and murders his wife in view of the villagers. When he also threatens to murder the chief's daughter, the compassionate sergeant intervenes and assaults him. The lieutenant breaks up the ensuing fight, orders the supplies destroyed and the village razed. The volunteer prevents two girls from being gang-raped but is remorsefully unable to prevent another soldier from murdering a villager. The company commander threatens to court-martial anyone found to have illegally killed civilians. On their next patrol, the platoon is ambushed and pinned down. The cynical sergeant shoots the compassionate sergeant during the chaos. During the helicopter extraction, the volunteer sees the mortally wounded compassionate sergeant chased from the jungle by enemy soldiers and killed. The volunteer attempts to convince his fellow soldiers to retaliate, but the cynical sergeant discovers their plans. During a major enemy night assault, much of the platoon is killed. The volunteer encounters the seriously wounded cynical sergeant and ultimately kills him. As a helicopter carries him away, he sobs, overwhelmed by how the war has changed him forever."
}