{
  "obfuscated_plot": "In the early 1900s, a young woman from a small Western European country and her cousin and chaperone stay at a small guesthouse while on holiday in a Mediterranean city. They are disappointed that their rooms lack a view of a river. At dinner they meet other travelers from their country: a clergyman; two elderly spinster sisters; a romance writer; a freethinking older man; and his quiet, handsome son. Learning about the women's disappointment at not having a river view, the older man and his son offer to exchange rooms. While touring a city square the next day, the young woman witnesses a local man being brutally stabbed and killed. She faints but the son appears and comes to her aid. Later they join other travelers for a day trip to the countryside. The carriage driver canoodles with his girlfriend, which upsets a stern clergyman. Wishing to engage in gossip, the cousin and the writer encourage the young woman to go for a walk. The local driver leads her to where the son is admiring the view from a hillside. Seeing her across a poppy field, he suddenly embraces and passionately kisses her. The cousin appears and intervenes. Worried about her reputation, she swears the young woman to secrecy and cuts their trip short. Upon returning home, the young woman says nothing and pretends to forget it. She becomes engaged to a wealthy, socially prominent man who is cold and pretentious. The son's presence upends her life, and her suppressed feelings for him surface. Her fiancé asks permission to kiss her, then does so awkwardly. Her brother becomes friends with the son. During a tennis match, they recognize a scene from a novel that matches their earlier encounter. The son passionately kisses her in the garden. She confronts her cousin, who admits to telling the writer about the previous kiss. She orders the son to leave and never return. She ends her engagement, saying they are incompatible. To escape, she plans to travel abroad with the spinster sisters. The son, unaware she is no longer engaged, arranges for his father to move to the capital. When she visits a clergyman's home, she is confronted by the father, who helps her realize her true feelings. At the end, the newlyweds honeymoon at the same guesthouse where they met, in a room with a view of the city."
}