{
  "obfuscated_plot": "In the mid-20th century, a 44-year-old former monarch has been in custody for five years after being captured by revolutionary forces during a regional conflict. In the newly established communist state, he arrives as a political prisoner at a detention facility. After attempting suicide, he is told he must stand trial.\n\nDecades earlier, as a toddler, he is summoned to a royal palace by a dying royal matriarch. She informs him that he is to be the next ruler. After his coronation, he is frightened by his new surroundings and repeatedly expresses a desire to go home. Despite having numerous servants, his only real friend is his wet nurse.\n\nAs he grows up, his upbringing is confined entirely to the palace. One day, his younger brother visits and tells him he is no longer the ruler and that the country has become a republic. His wet nurse is then forced to leave. A foreign tutor is appointed and provides him with a Western-style education, increasing his desire to leave the palace. He marries two women and attempts to reform the palace, expelling traditional servants.\n\nHe is eventually expelled from the palace and leads a decadent life. He sides with a foreign power after a regional incident. One of his wives divorces him, while the other succumbs to opium addiction. A foreign power crowns him as a puppet ruler of a regional state, though his political power is constantly undermined. His wife gives birth to an illegitimate child, which is murdered at birth by the occupying forces.\n\nAfter the war, he is captured and handed over to the new government. Through a re-education program, he is coerced into renouncing his collaboration with the foreign invaders. After discussions and watching a documentary about wartime atrocities, he is eventually rehabilitated and released.\n\nYears later, he becomes a simple gardener living a modest existence. He encounters a political parade where a former prison official is now being publicly humiliated. He visits his former palace, now a museum, and meets a young boy. He shares a nostalgic moment by giving the child an old pet cricket he had kept since his coronation. In a mysterious finale, he seemingly disappears after this encounter.\n\nDecades later, a tour guide briefly summarizes his life story to a group of visitors, concluding that he died in the late 1960s."
}