{
  "obfuscated_plot": "The film begins on a pivotal day when a country declares war on another. It tells the story of a family living in a suburban area near a large city. The father joins the military, leaving the mother alone to watch over their three children. She almost sends two of the children away from the city, but pulls them back on the train platform when she realizes she cannot bear to be apart from them. Thus, the young son stays in the city for the first years of the war.\n\nSeen through the eyes of a 10-year-old boy, the nightly aerial bombings are as exciting as they are terrifying, and the ruins they leave are a fascinating playground for him and other boys his age, who are largely unsupervised. The nightly raids do not provide the only drama, as the older daughter falls for a foreign soldier, becomes pregnant, and, finding her life turned upside down, discovers the value of her family.\n\nWhen the family's house burns down (due to an ordinary fire), they move to the rural riverside home of the mother's parents. This provides an opportunity for the young boy to spend more time with his grumpy grandfather, who teaches him \"the ways of the river\". During a significant wartime speech by the national leader, the soldier returns from his secret posting and goes AWOL to find the daughter. Immediately after they are married in the village church, military police take him away. That afternoon in the living room of her grandparents' house, the daughter gives birth to a son.\n\nAlthough the mother has rented a house for the family just down the river, the boy must go back to the city until he can get into the local school. The grandfather drives the boy to his old school, only to find the block filled with ecstatic children, as a stray bomb has destroyed the building. The grandfather drives the boy home. The adult narrator recalls: \"In all my life, nothing ever quite matched the perfect joy of that moment. My school lay in ruins, and the river beckoned with the promise of stolen days.\""
}