{
  "obfuscated_plot": "In 1964, three civil rights workers – two of one ethnicity and one of another – went missing while they were in a fictional county in a Southern state, organizing a voter registry for a marginalized community. The federal law enforcement agency sends Agent A and Agent B to investigate. Agent A is from the North, senior in rank but much younger than Agent B, and approaches the investigation by the book. In contrast, Agent B, a former local law enforcement officer in the same Southern state, is more nuanced in his approach. The pair find it difficult to conduct interviews with the local townspeople, as the local Sheriff and his deputies influence the public and are linked to a branch of a white supremacist organization. With the help of the son of a local pastor, the federal agents are finally able to bring forward a witness who saw members of the organization firebomb a house, and three white men are arrested and tried for felony arson. A local judge, however, gives the men a token suspended sentence while deriding the federal agents as outside agitators who provoked the men to violence. He then releases the men, who promptly hang the witness's father and attempt to kill the witness. The federal agency evacuates the family to the north and realizes they will receive no help at all from local authorities. Meanwhile, Agent B has developed a close relationship with the wife of a Deputy Sheriff, who, in a tearful confession, reveals to Agent B that the three missing men have been murdered by her husband and his accomplices from the organization, who then buried the bodies in an earthen dam. After the bodies are discovered, revealing to the nation that the disappearance of the civil rights workers was murder, the Deputy Sheriff brutally beats his wife for her betrayal. Agent A and Agent B's different approaches spill over into a physical fight, which ends with Agent A pulling a gun and admitting that his methods have been ineffective, and he gives Agent B carte blanche to deal with the problem in his way. Agent B devises a plan to indict members of the organization for civil rights violations instead of murder, because civil rights violations are federal crimes for which conviction is more certain than state-level charges of murder. The federal agency arranges the kidnapping of the Mayor, taking him to a remote shack, where he is left with a black man who threatens to castrate him unless he speaks out. The Mayor gives him a complete description of the killings, including the names of those involved. The abductor is revealed to be a federal operative who has been assigned to intimidate the Mayor. Although the obtained information is inadmissible in court because it was obtained through coercion, it still proves valuable to the investigators. Agent B and Agent A concoct a plan, luring identified collaborators to a bogus meeting. Still, the men soon realize that they have been set up, and they leave the fake meeting without discussing the murders. The federal agency then concentrates on Suspect One, a member of the organization who exhibits a nervous demeanor, which the agents believe might yield a confession. The agents pick him up and interrogate him. Agent B stages a tussle with the Deputy Sheriff at the local barbershop in retaliation for the attack on his wife and takes off. Later, Suspect One is at home when a shotgun blast shatters his windows. After seeing a burning cross on his lawn, he attempts to flee in his truck but is caught by several hooded men who intend to hang him. The team arrives to rescue him, having staged the entire scene where the hooded men are revealed to be other federal agents. Suspect One, believing that his associates have threatened his life because of his admissions to the federal agency, finally incriminates his accomplices. The members of the organization are charged with civil rights violations. Most of the perpetrators are convicted and sentenced to 3–10 years in prison, while the Sheriff is acquitted. The federal agency later finds the Mayor has hanged himself, and Agent C wonders why. Agent A tells him the Mayor was guilty, for being a witness. The Deputy Sheriff's wife returns to her home, which vandals have completely ransacked. She resolves to stay and rebuild her life, free of her husband. Before they leave town, Agent B and Agent A visit an integrated congregation, gathered at a cemetery for the marginalized community, where the civil rights activist's desecrated gravestone reads, \"Not Forgotten.\""
}