{
  "obfuscated_plot": "A working-class woman from a suburban neighborhood dreams of climbing the corporate ladder to an executive position. Despite holding a business degree earned through evening classes, her boss and male co-workers at a stockbroker firm treat her like a bimbo, even though they benefit from her intelligence and business instincts. After reaching her limit with her boss's humiliations, she dramatically quits. She then lands a job as an administrative assistant to an associate partner at a mergers and acquisitions firm. At first, her boss seems supportive, encouraging her to share ideas, but eventually dismisses her proposed business acquisition.\n\nWhen her boss breaks a leg while skiing, she asks the protagonist to house-sit. While there, she discovers meeting notes that reveal her boss plans to pass off her business idea as her own. She later returns home to find her live-in boyfriend having sex with another woman. He attempts to reconcile and propose marriage, but they end things.\n\nWith her boss away, she decides to use her connections and clothes to move ahead with her proposal. With her friend's help, she transforms her appearance to look more professional. She schedules a meeting with a mergers and acquisitions associate from another company. The night before, she attends a dinner on her boss's behalf, hoping to network.\n\nA man at the bar approaches her but does not reveal his identity. After a night involving alcohol and medication, she leaves early the next morning. During the meeting, she is surprised to see the man from the previous night is actually the professional she's meeting with. Though she initially thinks the meeting fails, he later arrives at her office, interested in her idea.\n\nThey prepare the merger proposal together and present it successfully. A romantic relationship develops, complicated by the potential revelation of her true professional status. Her boss returns and attempts to manipulate the situation, leading to a confrontational meeting where her deception is exposed.\n\nUltimately, the company's leadership recognizes her innovative thinking. She is offered an entry-level position and moves in with her romantic partner. On her first day, she establishes a collaborative relationship with her own secretary, demonstrating her commitment to a different management approach. She triumphantly calls her friend to share her success."
}