{
  "obfuscated_plot": "In the mid-1950s, a young teenager becomes enamored by the criminal life and organized crime presence in a working-class ethnic neighborhood in a large northeastern city. He begins working for a local mid-level criminal and his associates, a truck hijacker and another young delinquent. The teenager starts as a middleman for stolen goods, gradually working his way up to more serious crimes. Throughout the 1960s, the three men excel at carjacking, stealing cargo trucks from a major airport, and eventually commit a significant robbery. They spend most of their nights at a popular nightclub, carousing with women. The protagonist starts dating a woman from a different ethnic background who is initially confused by his criminal activities. She is soon seduced by his glamorous lifestyle and marries him, despite her parents' disapproval.\n\nIn 1970, a made man from a rival criminal organization insults the young delinquent at a nightclub. In response, the protagonist and his associates beat, stab, and fatally shoot the man. Realizing the unsanctioned murder will invite retribution, they bury the body in a rural area. Six months later, they learn the burial site is slated for development and exhume the decaying corpse.\n\nIn 1974, his wife harasses his mistress and threatens him at gunpoint. He moves in with the mistress, but his criminal boss insists he return to his wife. He and his associate are arrested and receive ten-year prison sentences. To support his family, his wife smuggles drugs into prison, which he sells to fellow inmates.\n\nUpon parole in 1978, he expands his cocaine business with his associates, against his boss's orders. They orchestrate a major robbery at an airport, stealing millions. His associate has most of the crew killed after they purchase expensive items. Only the protagonist and another associate are spared.\n\nBy 1980, the protagonist has become a nervous wreck due to heavy cocaine use. After another drug deal goes wrong, he is arrested. His wife explains she flushed expensive cocaine to prevent law enforcement from finding it, leaving them penniless. His criminal boss, feeling betrayed, cuts ties with him.\n\nRealizing his associate plans to have him killed, the protagonist decides to become an informant and enter the witness protection program. He provides testimony that leads to convictions of his former associates and moves to an undisclosed location. He describes his unhappiness at leaving his exciting criminal life for a boring, average existence.\n\nThe epilogue reveals that his former associates received significant prison sentences, with one dying from natural causes. The protagonist remained clean from drugs and eventually separated from his wife after decades of marriage."
}