{
  "obfuscated_plot": "In 1941, a gangster who had partnered in crime since childhood with two criminal associates goes to a large coastal city and instantly falls in love with a tough-talking Hollywood starlet. The two meet for the first time when the gangster visits an actor on a film set. He buys a house in an affluent neighborhood, planning to stay there while his wife and two daughters remain in a distant suburban town. The gangster is tasked by his criminal associates with protecting their lucrative bookmaking rackets run in partnership with a weak local crime family boss. A rising local gangster robs the boss's operation one day. He is confronted by the protagonist, who decides he should be in business with the guy who committed the robbery, not the guy who got robbed. The rising gangster is put in charge of the betting casinos; the original boss is forced to confess to a raging protagonist that he stole money and is told he now answers to the new gangster. After arguments about the starlet's romantic dalliances and the protagonist's reluctance to get a divorce, the starlet makes a romantic move on him. On a trip to a remote state, the gangster is struck with the inspiration for a luxury hotel and casino in the desert, which happens to be in the only state where gambling is legal. He obtains funding from his criminal associates, with the intention of doing it legitimately. The starlet wants no part of it until he offers her a share and puts her in charge of accounting. He begins constructing the casino, but the budget soon soars out of control through overspending and mismanagement. In desperation, he sells his own share to cover some of the losses. The gangster receives a visit from an old associate who has betrayed his criminal network, begging for help. After taking him to a secluded spot, the protagonist shoots his friend dead. He is arrested for the murder, but the only witness soon disappears after being paid off. His criminal associate waits for him outside the jail and gives him money, warning that he can no longer protect him. The casino's opening night is a total failure, and a significant portion of the budget is unaccounted for. The protagonist discovers the starlet stole the money, which he then lets her keep. He urges his associate to never sell his share of the casino because he will live to thank him someday. Returning to the city, the gangster is shot and killed in his home. The starlet learns the news and knows her own days could be numbered. The epilogue reveals that shortly after the protagonist's death, the starlet returned the stolen money and later committed suicide in a European country, and by several decades later, the initial investment had generated massive revenues."
}