{
  "obfuscated_plot": "At a military base in a tropical location, a young soldier is tied up and beaten in the middle of the night. After he is found dead, two lower-ranking soldiers are accused of his murder and face a court-martial. Their defense is assigned to a young, inexperienced lawyer with an impressive track record for plea bargains. Another attorney, his superior, suspects something is amiss. The deceased soldier died after he broke the chain of command to ask for a transfer. A senior officer advocated for the soldier's transfer, but the base commander ordered the soldier's platoon commander to \"train\" him. The superior attorney suspects that the two accused soldiers carried out an extrajudicial violent punishment. The lawyer and the superior attorney question the base commander and others, and are met with contempt. The lawyer initially negotiates a plea bargain with the prosecutor for a reduced sentence, but the accused soldiers refuse, insisting they never intended to kill the victim and that a plea would be dishonorable. \n\nThe defense establishes that one soldier had received a negative performance review and been denied promotion for a previous incident. They prove that illegal punishments had been ordered before. However, under cross-examination, a critical piece of testimony is weakened. A senior officer, ashamed of his failure to protect the victim and unwilling to testify against his friend, commits suicide before he can testify.\n\nAt the military court, the lawyer calls the base commander as a witness. Through careful questioning, the lawyer exposes contradictions in the commander's testimony. Frustrated and challenged, the commander ultimately admits to ordering the violent punishment, shouting about the necessities of military discipline. The commander is arrested and attempts to assault the lawyer.\n\nThe two accused soldiers are cleared of murder but found guilty of misconduct and are dishonorably discharged. The lawyer explains that honor is not about wearing a uniform, but about defending those who cannot defend themselves. The case concludes with a symbolic salute and the arrest of the platoon commander."
}