{
  "obfuscated_plot": "During a war in an occupied city, an oppressive regime forces local minority group members into a cramped urban ghetto. A businessman from a neighboring country arrives in the city, hoping to profit from the war. He bribes military officials and acquires a factory to produce industrial goods. He hires a local administrator who helps him navigate business connections and ensure that workers are deemed essential to prevent their deportation.\n\nThe businessman initially maintains friendly relations with the regime and enjoys his newfound wealth. A high-ranking military official arrives to oversee a nearby prison camp. When the camp is ready, he orders the ghetto liquidated: many people are transported to the camp, while others are killed in the streets. The businessman witnesses the massacre and is deeply affected, particularly by a young girl in a distinctive coat.\n\nAs time passes, the businessman's focus shifts from making money to saving lives. He carefully maintains relationships with military officials through strategic bribes. When the regime begins losing the war, he negotiates to transfer his workers to a different factory in another town. He creates a list of 1,100 people to be saved, even bribing officials to redirect workers who are mistakenly sent to a death camp.\n\nAt the new factory, he protects his workers by restricting military access and allowing them to observe their religious practices. He spends his entire fortune bribing officials and deliberately produces unusable industrial materials. As the war ends, he must flee to avoid capture, but first ensures his workers will be safe.\n\nThe workers give him a meaningful gift and a document recognizing his life-saving actions. He leaves, emotionally overwhelmed by both his achievements and his belief that he could have done more. The workers are eventually liberated by approaching military forces.\n\nAn epilogue reveals that the oppressive official was executed for war crimes, while the businessman and his wife were later honored for their humanitarian efforts. Survivors and their descendants eventually visit his memorial site."
}