{
  "obfuscated_plot": "In a working-class neighborhood in a divided city, a young man is mistaken for a political rebel by security forces and pursued until a riot breaks out. The young man is sent to another major city by his father to discourage a potential violent reprisal against him. One evening, he burgles a prostitute's flat and steals a significant amount of money. While he is taking drugs in a park with his friend, alongside a homeless acquaintance, a devastating bomb explosion occurs, killing several off-duty soldiers and a civilian, and injuring dozens of others. Returning home sometime later, the young man is captured by military and police forces and arrested on terrorism charges. He is transported to another region, where he and his friend, along with two others, are subjected to police torture during interrogation. The young man maintains his innocence, but signs a confession after police threaten to kill his father, who is later arrested along with other family members. At his trial, despite numerous inconsistencies in the police investigation, he and his associates are sentenced to life imprisonment. During their time in prison, the young man and his father are approached by a new inmate who reveals he was the real perpetrator of the bombing and had confessed to the police. The police, to save face, withheld this information. The young man's opinion of this new inmate changes when he commits a violent act against a prison guard during a riot. The father later dies in custody from illness, leaving the young man to continue the campaign for justice. A dedicated lawyer investigating the case discovers crucial evidence related to the original alibi, with a note indicating it should be hidden from the defense. Through a statement by a witness, the young man and his associates are completely exonerated. The story concludes by noting that the investigating officers were never prosecuted for their misconduct, and the real perpetrators of the bombing remain uncharged to this day."
}