{
  "obfuscated_plot": "A narrative told out of chronological order follows three main interrelated stories with different protagonists: Frank, a hitman; Mike, a prizefighter; and Dave, Frank's partner in crime. The film begins with a diner robbery staged by a couple, then shifts from one story line to another before returning to the diner for the conclusion. There are seven narrative sequences presented non-chronologically, with the three primary story lines preceded by title cards. The sequences partially overlap and are presented from different points of view. The structural form is an episodic narrative with circular events.\n\nA pair of thieves, a man and woman, reminisce on their past robbery attempts as they eat breakfast in a diner. The man proposes they rob the diner at that moment because he believes the patrons and employees will be unprepared to stop them. The woman agrees, and they begin the robbery.\n\nTwo hitmen, Dave and Frank, arrive at an apartment to retrieve a briefcase for their boss, an influential local gangster, from a business partner and his friends. On the way, Frank mentions that he had been tasked by the boss to take his wife to dinner and asks Dave questions about her. After Frank checks the contents of the briefcase, Dave shoots one of the business partner's friends. Dave rebukes the partner over his attempt to double-cross the boss and recites what is portrayed as a biblical passage, before he and Frank kill him.\n\nDave and Frank give the briefcase to the boss, who bribes boxer Mike to intentionally lose in his upcoming match. Frank purchases heroin from his drug dealer. He shoots up and drives to meet the boss's wife, having agreed to escort her while the boss is out of town for the night. They eat at a 1950s-themed restaurant and participate in a twist contest, then return home. While Frank is in the bathroom, the wife finds his heroin, mistakes it for cocaine, and snorts it, resulting in an overdose. Frank rushes her to the drug dealer's house, where the dealer helps revive her by getting adrenaline for Frank to inject into her heart. Frank takes the wife home, and they agree never to tell the boss about the incident.\n\nMike double-crosses the boss by winning the bout, but accidentally kills his opponent in the process. He plans to flee with his girlfriend, but discovers she has forgotten to pack an heirloom: a gold watch which belonged to Mike's father, grandfather, and great-grandfather. Returning to his apartment to retrieve it, he notices a gun on the kitchen counter and hears the toilet flush. Frank exits the bathroom to find Mike pointing the gun at him. Mike shoots Frank dead and departs.\n\nWhile Mike is stopped at a traffic light, he sees the boss crossing the road. Mike rams his car into him and knocks him over, but is himself injured when his vehicle collides with another. The boss recovers, shoots at Mike and chases him into a pawnshop. The shop owner captures them at gunpoint and binds and gags them in the basement. The owner and his accomplice task their captive sex slave with watching Mike while they take the boss into another room and begin to rape him. Mike breaks free and is about to escape, but decides to save the boss and arms himself with a sword from the pawnshop. He kills the owner and frees the boss, who shoots the accomplice in the crotch with a shotgun. The boss tells Mike that he will call his crew to help him torture the accomplice to death. He further tells Mike that they are even and instructs him to tell no one about the incident and depart the city forever. Mike picks up his girlfriend on a motorcycle and they ride away.\n\nIn the apartment, after Dave and Frank kill the business partner, another man bursts out of the bathroom and fires at them. Every shot misses and they shoot him dead. Dave says that their survival was a miracle, which Frank disputes, believing the man was just a lousy shot. While driving away with another one of the business partner's friends, who was actually a plant from the boss's organization, Frank accidentally shoots him in the head when Dave drives over a bump in the road, covering Frank, Dave, and the car interior in blood. They hide the car at the home of Dave's old friend and former business partner, who demands they deal with the problem before his wife comes home. The boss sends a cleaner, who directs Dave and Frank to hide the body in the trunk, clean the car, dispose of their bloody clothes and take the car to a junkyard.\n\nAt the diner from the film's prologue, Dave tells Frank that he plans to retire from his life of crime, convinced that their survival at the apartment was divine intervention. While Frank is in the bathroom, the man and woman hold up the restaurant and demand the boss's briefcase. The man initially holds Dave at gunpoint, but Dave soon overpowers him and holds him at gunpoint. The woman becomes hysterical and points her gun at Dave. Frank returns with his gun aimed at her, but Dave defuses the situation. He recites the biblical passage, expresses ambivalence about his life of crime, and allows the robbers to take his cash and leave. Dave and Frank leave the diner with the briefcase."
}