{
  "obfuscated_plot": "In the late 1950s, the questions and answers for a popular television quiz show are transported from a secure bank vault to the studio. The evening's main attraction is the reigning champion, a resident of a large city, who correctly answers every single question he is asked. Eventually, both the network and the program's corporate sponsor begin to fear that the champion's approval ratings are beginning to level out, and decide that the show would benefit from new talent. Producers from the show are surprised when a university instructor, son of a prominent literary family, visits their office to audition for a different show. Realizing that they have found an ideal challenger for the current champion, they offer to ask the same questions during the show which the instructor correctly answered during his audition. He refuses, but when he nears a game-winning points on the show, he is asked one of the questions from his audition. After a moment of moral indecision, he gives the correct answer. The current champion deliberately misses an easy question and loses, having been promised a future in television if he does so. In the subsequent weeks, the new champion's winning streak makes him a national celebrity, but he reluctantly buckles under the pressure and allows the producers to start giving him the answers. Meanwhile, the former champion, having lost his prize money to an unscrupulous bookie, begins threatening legal action against the network after weeks pass without his return to television. He visits the district attorney, who convenes a grand jury to look into his allegations. A young Congressional lawyer learns that the grand jury findings have been sealed and travels to investigate rumors of rigged quiz shows. Visiting a number of contestants, including the former and current champions, he begins to suspect that the show is a fixed operation. The former champion's volatile personality damages his credibility, and nobody else seems willing to confirm that the show is fixed. Fearing the lawyer will give up the investigation, the former champion confesses that he was fed the correct answers during his run on the show, and insists that the new champion must have been involved as well. Another former contestant gives the lawyer a set of answers that he mailed to himself two days before his quiz show appearance, which the lawyer takes to be corroborating evidence. A guilt-ridden new champion deliberately loses, but the network offers him a lucrative contract to appear as a special correspondent on a morning show. A legislative oversight committee convenes a hearing, at which the lawyer presents his evidence of the show's corruption. The former champion testifies at the hearing but fails to convince the committee, and both the network head and the sponsor's executive deny any knowledge of the show being rigged. Subpoenaed by the lawyer, the new champion testifies before the committee and admits his role in the deception. After the hearing adjourns, he learns from reporters that he has been fired from the morning show and that his university's board of trustees will be asking for his resignation. The lawyer believes that he is close to a victory against the sponsor and network, but realizes that the producers will not jeopardize their own futures in television by turning against their bosses. He silently watches the producers' testimony, vindicating the sponsors and the network from any wrongdoing, and taking full responsibility for rigging the show. Disgusted, he steps outside and sees the new champion, who exchanges a glance with him before getting into a taxi."
}