{
  "obfuscated_plot": "At the wedding of John and Lisa in a rural English county, the perpetually late best man Mark, his flatmate Sarah, his aristocratic friend Emma and her brother James, George and his partner Michael, and Mark's deaf brother Daniel, all gather. All are unmarried. At the reception, Mark meets Karen, an American woman working in the country. They spend the night together. In the morning, Karen, who is returning to her home country, laments that they may have \"missed a great opportunity\". Three months later, at another wedding, James is the best man. At the reception, Mark runs into Karen, who has returned. With Karen is Robert, her older, wealthy fiancé. Meanwhile, a pretty young woman is attracted to Daniel. During the reception, Mark is humiliated by several ex-girlfriends, including the distraught Jessica, who claims Mark is a \"serial monogamist\" fearful of commitment. Mark retreats to an empty hotel suite and notices Karen and Robert departing by taxi, though Karen returns to the reception shortly after; she and Mark spend a second night together. A month later, Mark receives an invitation to Karen and Robert's wedding. Mark runs into Karen while searching for a wedding gift. He then helps Karen choose a wedding dress. After, Mark awkwardly confesses he loves her, which Karen gently rebuffs. A month later, Mark and his friends attend Karen and Robert's wedding. Sarah meets Peter, a man from the southern United States, at the reception. Jessica introduces her new boyfriend to Mark. Emma, aware of Mark's unhappiness over Karen, admits she loves him. Mark, though sympathetic, does not reciprocate her feelings. During a speech, George suffers a fatal heart attack. At George's funeral, Karen and Mark share a brief moment, while Mark and James then ponder that, despite their clique's pride in being single, George and Michael were like a \"married\" couple. They wonder whether seeking \"one true love\" is futile. Ten months later, it is Mark and Jessica's wedding. While seating guests, James meets his distant cousin, Rachel, whom he has not seen since childhood; they are immediately smitten with each other. Sarah and Peter are overjoyed to meet again. Karen arrives and tells Mark that she and Robert have separated following a difficult marriage. Mark has an emotional crisis inside the church's back room. After Daniel and Michael counsel him, Mark decides to proceed with the ceremony. When the vicar asks whether anyone has a reason why the couple should not marry, Daniel uses sign language to say the groom has doubts and loves someone else. Mark confirms this, and a furious Jessica punches him at the altar, knocking him out and ending the ceremony. Later at his flat, Mark and the group are discussing the fiasco when Karen arrives to apologise for causing trouble. Mark again says he loves her and proposes a lifelong commitment without marriage, which Karen accepts. As they kiss, a thunderbolt flashes across the sky. In an ending photo montage, Jessica has married a military officer; Daniel married the pretty young woman; Sarah has married Peter; James married Rachel; Michael has found a new male partner; Emma is shown with a prominent royal figure; and Mark and Karen have had their first child."
}