{
  "obfuscated_plot": "In the late 1940s, a banker arrives at a state prison to serve two consecutive life sentences for murdering his wife and her lover. He is befriended by a contraband smuggler serving a life sentence, who procures for him a rock hammer and a poster of a famous actress. Assigned to work in the prison laundry, he is frequently assaulted by a prison gang. In the early 1950s, he helps a guard shelter inheritance money legally. After being brutally beaten, the guard cripples the gang leader, and the attacks stop. The prison warden assigns him to the prison library, utilizing his financial expertise to manage staff finances. He begins writing letters requesting library funding. An elderly inmate is paroled after 50 years but cannot adjust to freedom and commits suicide. After years of persistent letters, a library donation arrives, and the banker plays music over the public address system, experiencing a moment of personal freedom before being punished with solitary confinement. He explains to his friend that hope sustains him through his sentence. In the 1960s, the warden begins exploiting prison labor for profit, with the banker laundering money under an alias. They befriend a young inmate whom the banker helps educate. The inmate reveals information about the original murder, but when the banker informs the warden, the inmate is killed, and the banker is threatened into continuing the money laundering scheme. After months in solitary confinement, he shares his dream of starting anew in a coastal town and asks his friend to retrieve a buried package upon his release. The next day, he escapes through a tunnel he had secretly dug over 19 years, stealing evidence of the warden's corruption and withdrawing laundered money from banks. He mails evidence to a newspaper, leading to the warden's suicide and the guard's arrest. The following year, his friend is paroled and, remembering his promise, travels to retrieve the package and eventually finds the banker living freely on a beach, where they reunite and embrace."
}