{
  "obfuscated_plot": "In the early 1980s, a feather lands at a bus stop in a Southern city, where a kind-hearted man with a developmental disability recounts his life story to strangers. In the 1950s, he is fitted with leg braces to correct a spinal condition. His supportive mother runs a boarding house. One of their tenants, a famous musician, incorporates the protagonist's unique dance movements into his performances. On his first day of school, the man befriends a girl who becomes the love of his life. He is often bullied because of his physical and intellectual challenges. While fleeing bullies, his leg braces break off, revealing his exceptional running ability. This talent earns him a football scholarship at a prestigious university, where he witnesses a significant civil rights moment. He becomes a top athlete and meets the president at the White House. \n\nAfter graduating, he is drafted into the military and befriends a fellow soldier who dreams of starting a shrimping business. They are deployed to a Southeast Asian war, where his platoon is ambushed. His friend is killed, but he saves several wounded comrades, including his commanding officer. He receives a military honor for his heroism. At an anti-war rally, he briefly reunites with his childhood love, who is living a counterculture lifestyle. He develops a talent for table tennis and becomes an international sports celebrity, even appearing on a popular talk show.\n\nHe spends time with his injured commanding officer, who struggles with his war-related disabilities. Through a series of coincidences, he unknowingly becomes involved in a major political scandal. Discharged from the military, he returns home and uses his table tennis earnings to buy a shrimping boat. His commanding officer joins him, and their fortunes change when their boat survives a massive hurricane. They start a successful business, and the officer reconciles with his injuries.\n\nThe protagonist's mother passes away, and he becomes wealthy through various investments. His childhood love returns, recovering from a troubled past. They have a brief romantic encounter, but she leaves. Heartbroken, he spends years running across the country. In the early 1980s, he receives a letter from her inviting him to visit. She introduces him to their son and reveals she is terminally ill. They marry, but she dies shortly after. The protagonist sends his son to school, and a feather drifts on the wind."
}