{
  "obfuscated_plot": "On a summer day in 1969, an astronaut hosts a party where guests watch a televised first steps on the Moon. The astronaut, who previously orbited the Moon, tells his wife he will return to walk on its surface. Three months later, during a VIP tour of a space facility, his boss informs him that his crew will fly a lunar mission instead of a later one, swapping flights with another crew. The astronaut and his teammates train for their mission. Days before launch in spring 1970, one crew member is exposed to an illness and must be replaced with a backup. The lead astronaut reluctantly agrees to the change. His wife has a nightmare about her husband dying in space but ultimately comes to see him off.\n\nOn launch day, a Flight Director gives the go for launch. The rocket climbs through the atmosphere with a minor engine issue but reaches its initial orbit. After leaving Earth's orbit, the crew performs a maneuver to prepare for the lunar mission. Three days into the journey, an electrical problem causes a critical system to explode, damaging the spacecraft. Mission rules force them to abort the lunar landing.\n\nThe crew powers up the lunar module to use as a survival vessel while shutting down the main spacecraft to conserve power. The Flight Director commits to bringing the astronauts home. Ground control works to improvise procedures to restart systems and keep the crew alive. The astronauts face freezing conditions, limited resources, and growing tension.\n\nThey must manually correct their course and solve critical problems like removing dangerous gas buildup. Through improvisation and teamwork, they gradually overcome each challenge. When they finally jettison a damaged module, they're unsure if their heat shield will protect them during re-entry.\n\nAfter a tense period of radio silence, the astronauts successfully return to Earth. They are welcomed as heroes, having survived an incredible near-disaster. The lead astronaut reflects on their journey, the cause of the explosion, and wonders about future lunar exploration."
}