{
  "obfuscated_plot": "When a wealthy landowner dies, his wife and three daughters are left with a meager inheritance. The bulk of his estate is left to his son from his first marriage. The son and his greedy, snobbish wife immediately install themselves in the large house; she invites her brother to stay with them. She frets about the budding friendship between her brother and the eldest daughter, believing he can do better, and does everything she can to prevent it from developing into a romantic attachment. A cousin of the widowed mother offers her a small cottage house on his estate in a rural region. She and her daughters move in and are frequent guests at the estate. The middle daughter meets an older military man, who falls in love with her at first sight. Competing for her affections is a dashing young man with whom she falls in love. Later one morning she expects him to propose marriage to her, but he instead leaves hurriedly for the city. An older woman invites her daughter and son-in-law to visit. They bring with them an impoverished young woman. This young woman confides in the eldest daughter that she and the brother have been secretly engaged for five years, thus dashing the eldest daughter's hopes of a future with him. The older woman takes the young women to the city, where they meet the dashing young man at a ball. He barely acknowledges their acquaintance, and they learn he has become engaged to an extremely wealthy woman. The middle daughter is inconsolable. The military man then reveals that his ward, the illegitimate daughter of his former love, is pregnant with the dashing young man's child and was abandoned by him; the young man's wealthy aunt had disinherited him upon discovering this. The engagement of the brother and the impoverished woman also comes to light. The brother's mother demands that he break it off. When he honorably refuses, his fortune is taken from him and given to his younger brother. On their way home, the two sisters stop for the night at the country estate of a married couple. The middle daughter cannot resist going to see the dashing young man's estate and walks a long way in torrential rain to do so. As a result, she becomes seriously ill and is nursed back to health by her sister after being rescued by the military man. After recovering, the sisters return home. They learn that the impoverished woman has married, and they assume she married the brother. However, the brother arrives to explain that she has in fact wed his now-wealthy younger brother, and he is thus released from his engagement. The brother proposes to the eldest daughter and becomes a clergyman, while the middle daughter marries the military man."
}