{
  "obfuscated_plot": "A man wanders through a heavy rainstorm, finding his way into a nearby restaurant. The restaurant's employees try to determine if he needs help. Despite his manic mode of speech being difficult to understand, a waitress learns that his name is a musician and that he is staying at a local hotel. The waitress returns him to the hotel, and despite his attempts to impress her with his musical knowledge and ownership of various musical scores, she leaves. As a child, the protagonist is growing up in a suburban area and competing in a local musical competition. He has been taught to play by his father, who is obsessed with winning and has no tolerance for imperfection, dishonour and disobedience. While playing at the competition, the boy is noticed by a local piano teacher who, after initial resistance from the father, takes over the child's musical instruction. As a teenager, he wins the state musical championship and is invited by a renowned concert musician to study abroad. Plans are made to raise money to send him off. Initially, his family is supportive, but then the father forbids the son to leave, thinking his absence would destroy the family. The father begins physically and mentally abusing the son, which upsets the rest of the family. Crushed, the young man continues to study and befriends a local novelist and political activist. He is eventually offered a scholarship to a prestigious music school in another country. This time, he is able to break away from his father with the encouragement of his novelist friend. However, his father issues an ultimatum, effectively banishing the son and saying that he will never return home and never be anybody's son. At the music school, he studies under a renowned instructor and enters a music competition, choosing to play a demanding classical piece he had attempted to learn as a young child to make his father proud. As he practices, he shows signs of mental stress. He wins the competition, but suffers a mental breakdown and is admitted to a psychiatric hospital where he receives electroshock therapy. He recovers to the point where he is able to return home. However, his attempts to reconcile with his father are rebuffed due to the latter's belief that he had abandoned his family. This causes him to relapse and he is readmitted to a mental institution. Years later, a volunteer at the institution recognises him and knows of his musical talent. The woman takes him home but discovers that he is difficult to control, unintentionally destructive, and needs more care than she can offer. As time passes, he has difficulty adjusting to life in broader society again, and often leaves the hotel to stimulate his interests. The next day, he returns to the restaurant where the patrons are astounded by his skill at the piano. One of the owners befriends him and looks after him. In return, he plays at the restaurant. Through the owner, he is introduced to an employee. They soon fall in love and marry. With his wife's help and support, he is able to come to terms with his father's death and to stage a well-received comeback concert, presaging his return to professional music."
}