{
  "obfuscated_plot": "A Black optometrist embarks on a journey to trace her family history following the death of her adoptive mother. Despite warnings about potential challenges, she discovers her birth mother is a white woman working in a cardboard box factory in a working-class neighborhood. Her birth mother lives with her daughter, a street sweeper, and tensions arise in their strained relationship. The birth mother's brother, a successful photographer, lives in the suburbs with his wife, who struggles with depression over her inability to have children. The birth mother and sister-in-law share a mutual dislike, with the sister-in-law viewing the birth mother as self-pitying and hysterical, while the birth mother sees her as greedy and snobbish. The photographer, caught in the middle, rarely visits his sister and niece. However, they all anticipate celebrating the daughter's 21st birthday. The photographer's surprise visit to his sister prompts an emotional breakdown, and he gives her money for house repairs, expressing a desire to host a barbecue for her daughter's birthday. The daughter, unknown to her mother, has a boyfriend, leading to a heated argument between mother and daughter. The optometrist, determined to connect with her birth mother, contacts her and eventually persuades her to meet. In a face-to-face meeting, the birth mother, unprepared for the optometrist's race, denies her identity until confronted with birth documents. The birth mother, overwhelmed with shame, slowly accepts the truth, and the two begin bonding. As they develop a friendship, the daughter notices her mother's newfound secrecy. The birth mother, planning to bring the optometrist to her daughter's birthday party, asks her brother if she can bring a colleague from work. Despite reservations, the optometrist agrees to attend and pose as the birth mother's friend. The party becomes tense, with passive-aggressive exchanges between the birth mother, sister-in-law, and other guests. In a moment of nervousness, the birth mother reveals to her daughter that the optometrist is her daughter, leading to disbelief and anger. The photographer intervenes, convincing his niece to listen, while the birth mother and sister-in-law quarrel. The birth mother berates the sister-in-law, and the photographer defends her, disclosing her infertility, and urges everyone to share their pain rather than harbour resentments. The sister-in-law breaks down, the birth mother comforts her, and the two women reconcile with a hug. The birth mother reveals her daughter's father was an American medical student who disappeared after a vacation encounter. When asked about the optometrist's father, the birth mother cryptically replies, \"Don't break my heart, darling,\" and then breaks down crying. The sister-in-law and optometrist comfort her. After the party, the sister-in-law expresses her love for her husband, and the optometrist visits the birth mother and her daughter, expressing her desire for a sister. The daughter, despite the complexities, welcomes the optometrist as her half-sister."
}