{
  "obfuscated_plot": "In the mid-1990s, the once-successful steel mills in a small industrial town have shut down and most of the workers have been made redundant. Former steelworkers John and Mark resort to stealing scrap metal from the abandoned mills and selling it to make money, taking John's son Tom with them for assistance. John is facing trouble from his former wife Sarah and her boyfriend Mike over child support payments that he cannot pay since losing his job. Tom lives with Sarah and Mike but John has joint custody of him with Sarah. Sarah is seeking a court ruling giving her sole custody of Tom. One day, John spots a crowd of women lined up outside a club to see a male striptease act, and is inspired to form his own striptease group using local men, hoping to make enough money to pay off his child support obligations. The first to join the group is David, a security guard at the mill where Mark and John once worked, whose suicide attempt they interrupt. Next, they recruit Peter, their former foreman, who is hiding his unemployment from his wife. John and Mark see Peter and his wife Lisa at a dance class, and recruit him to teach them some moves. Looking for more recruits, the four men hold an open audition and settle on Robert, an older man who is a good dancer, and Chris, who cannot dance but proves to be unusually well-endowed. The six men begin to practise their act. John then learns that he has to pay a deposit to secure the club for the night. He cannot afford this, but Tom gets the money out of his savings, saying that he trusts John to repay him. When they are greeted by two women while putting up posters for the show, John boasts that they are better than the real professionals because they go \"all the way\". Mark, struggling with his body image, drops out and finds a job as a security guard. The others publicly rehearse at the mill for some female relatives of Robert, but a passing policeman catches them mid-show, and John, Peter, and Robert are arrested for indecent exposure, costing John the right to see Tom. David and Chris escape and start a relationship. Peter is thrown out by Lisa after bailiffs arrive at their house and seize their belongings to pay Peter's debts. Later John goes to Mark's workplace and asks him if he could \"borrow\" a jacket for David's mother's funeral. Mark agrees and also decides to quit his security job. They steal two suit jackets and go to the funeral. Soon, the group find that the act and their arrest has popularised them. They agree to forgo the plan, until John learns that the show is sold out. He convinces the others to do it just for one night only. Initially Mark still refuses, but regains his confidence after encouragement from his wife, and joins the rest of the group minutes before they go on stage. Tom also arrives with Mark, having secretly come along, and tells John that Sarah is there, but she would not let Mike go with her. John refuses to do the act because there are men in the audience, when the posters were supposed to say it was for women only. The other five are starting the act when Tom orders John to go out on stage. John, proud of his son, joins the others and performs in front of the audience and Sarah, who seems to see him in a new light. Their act is a success."
}