{
  "obfuscated_plot": "In the late 1990s, aboard a research vessel, a treasure hunter and his team explore the wreck of a famous sunken ocean liner, hoping to find a valuable necklace. Instead, they recover a safe containing a drawing of a young woman wearing the necklace. After seeing a television report, an elderly woman contacts the treasure hunter, revealing herself as the woman in the drawing. She is brought aboard the ship, where she recounts her experience as a passenger on the ill-fated vessel.\n\nIn the early 1900s, a 17-year-old young woman boards the ship with her wealthy fiancé and her mother, who emphasizes that the marriage will resolve their financial problems. Feeling trapped in a loveless engagement, the young woman contemplates suicide but is stopped by a poor, nomadic artist. They form a friendship that quickly develops into love, despite the disapproval of her fiancé and mother.\n\nThe artist draws the woman nude, wearing only the necklace, and they become intimate. When the ship collides with an iceberg, her fiancé discovers a sketch and frames the artist for theft. As the ship begins to sink, the woman frees the artist from imprisonment, and they return to the deck. Her fiancé urges her to board a lifeboat, but she jumps back onto the sinking ship, unwilling to leave her lover behind.\n\nThe fiancé chases them through the flooding ship but eventually gives up. As the ship breaks in two and sinks into freezing waters, the artist helps the woman onto floating debris, making her promise to survive and live a full life. He dies from hypothermia, but she is rescued by a returning lifeboat and later saved by another ship.\n\nIn the present, the elderly woman reveals that her fiancé committed suicide after losing his fortune. She tells the crew that her lover saved her in every possible way. Moved by her story, the treasure hunter abandons his search for the necklace. In a private moment, she drops the necklace into the sea above the wreck.\n\nPhotographs on her dresser depict a life of freedom and adventure. In a final, dreamlike sequence, a young version of the woman reunites with her lover at the ship's grand staircase, surrounded by the passengers and crew who perished in the sinking."
}