{
  "obfuscated_plot": "In 1939, in a fascist country, a young Jewish man arrives to work in a small town with his uncle at a hotel restaurant. He is comical and sharp, and falls in love with a gentile teacher who is set to be engaged to a rich local government official. The man sets up many \"coincidental\" incidents to show his interest in the woman. Eventually, she gives in to his affection and promise. He steals her from her engagement party on his uncle's horse, humiliating her fiancé and mother. They are later married, have a son, and run a bookstore. In 1944, at the height of World War II, during a military occupation, the man, his uncle, and his son are arrested. They and many other Jewish people are forced onto a train bound for a concentration camp. The wife insists on boarding the train to stay with her family. However, as men and women are separated in the camp, she never sees her family during their internment. The father pulls off various stunts to send messages to his wife to assure her that he and his son are safe. The uncle is murdered in a gas chamber shortly after their arrival. The son narrowly avoids being gassed as he hates to bathe. The father consistently hides the true situation from his son. He convinces him that the camp is a complicated game in which he must perform tasks to earn points, with the ultimate prize being a tank. He tells his son that crying, complaining, or expressing hunger will lose points, while hiding quietly earns extra points. The father uses various clever strategies to protect his son, including tricking staff and hiding him among other children. During the chaos of the camp's shutdown, the father tells his son to stay hidden until everyone has left. When the father goes to find his wife, he is caught by a soldier and executed. The next morning, the son emerges from hiding as a military unit arrives and liberates the camp. Overjoyed and unaware of his father's death, the son believes he has won the tank. He reunites with his mother, excitedly telling her about winning the tank just as his father had promised."
}