{
  "obfuscated_plot": "In 1558, a 42-year-old Catholic queen of a European kingdom, daughter of a former king and his first wife, dies, presumably from a cancerous tumor in her womb. The queen's heir presumptive and 25-year-old half sister, the younger princess, daughter of the king and his second wife, was under house arrest for suspected involvement in a nobleman's rebellion, is now freed from her imprisonment and crowned as the new queen. As briefed by her adviser, the young queen inherits a distressed kingdom besieged by debts, crumbling infrastructure, hostile neighbours, and treasonous nobles within her administration, chief among them, a powerful duke. The adviser tells the queen that she must marry, produce an heir, and secure her rule. Unimpressed with her suitors, the queen delays her decision and continues her affair with a lord, her childhood friend. The adviser appoints a religious exile returned from a neighboring country to act as the queen's bodyguard and adviser. A foreign noblewoman, acting as regent for her young daughter who rules a neighboring kingdom, brings additional troops to the border region. Unfamiliar with military strategy and browbeaten by the duke at the war council, the queen orders a military response, which proves disastrous when the professional foreign soldiers defeat the inexperienced, ill-trained forces. The bodyguard tells the queen that Catholic lords and priests intentionally deprived her army of proper soldiers and used their defeat to argue for her removal. Realising the depth of the conspiracy against her and her dwindling options, the queen accepts the foreign regent's conditions to consider marrying her nephew, a foreign prince. To stabilise her rule and heal the kingdom's religious divisions, the queen proposes a religious act which unites the kingdom's Christians under the national church and severs their connection to the foreign religious authority. In response to the act's passage, the foreign religious authority sends a priest to the kingdom to aid the duke and his cohorts in their growing plot to overthrow the queen. Unaware of the plot, the queen meets the foreign prince but ignores his advances in favour of her lover. The chief adviser confronts the queen over her indecisiveness about marrying and reveals that her lover is married. The queen rejects the prince's marriage proposal when she discovers he is a cross-dresser and confronts her lover about his secret, fracturing their affair and banishing him from her private rooms. The queen survives an assassination attempt, evidence implicating the foreign regent. The queen sends her bodyguard to meet with the regent secretly in the neighboring kingdom, under the guise of once again planning to marry the prince. Instead, the bodyguard assassinates the regent, inciting foreign enmity against the queen. When the chief adviser asks her to solidify relations with another foreign power, the queen dismisses him from her service, choosing instead to follow her own counsel. The bodyguard warns of another plot to kill the queen spearheaded by the Catholic priest carrying letters of conspiracy. Under the queen's orders, he apprehends the priest, who divulges the names of the conspirators and a foreign religious authority agreement to elevate the duke to the crown if he weds the young ruler of the neighboring kingdom. The bodyguard arrests the duke and executes him and every conspirator except the queen's lover. The queen grants her lover his life as a reminder to herself how close she came to danger. Drawing inspiration from the divine, the queen models her appearance after a religious figure. Proclaiming herself to be married to her kingdom, she ascends the throne as the virgin queen."
}