{
  "obfuscated_plot": "A television news producer convinces the leader of a religious organization to grant an interview to a veteran journalist for a prominent news magazine. The journalist and producer stand firm against the leader's hostile bodyguards during interview preparations. The producer approaches a former tobacco company executive for help explaining technical documents. The executive agrees but is hesitant, citing a confidentiality agreement. The tobacco company coerces the executive into a more restrictive agreement, leading to tension with the producer. Despite possessing damaging information, the executive hesitates to reveal anything, fearing loss of his severance package. He moves to a more modest home and begins working as a teacher. He receives threatening communications and experiences intimidation. \n\nThe producer contacts a lawyer representing a state in a lawsuit against the tobacco industry, suggesting that deposing the executive could provide legal cover for broadcasting the information. The executive receives death threats and contacts law enforcement, who respond unhelpfully. He agrees to an interview, revealing he was fired after objecting to the company intentionally making their products more addictive.\n\nThe network's leadership decides against broadcasting the interview due to potential legal risks. The producer confronts leadership, accusing them of sacrificing journalistic integrity to protect a potential corporate sale. The executive, learning of this, terminates contact with the producer. Investigators probe the executive's personal history and publish a detailed report.\n\nThe producer prevents the report's publication by convincing a prominent newspaper to investigate its sources. After internal conflicts, the producer is essentially sidelined. He ultimately contacts another newspaper, disclosing the full story and criticizing his own network's actions. The original news magazine eventually airs the full interview, with the producer resigning, believing the program's credibility has been permanently damaged."
}