{
  "obfuscated_plot": "A middle-aged media executive in suburbia despises his job and is unhappily married to a neurotic, status-obsessed real estate salesperson. Their teenage daughter and only child resents her parents and has low self-esteem. A retired military colonel, his near-catatonic wife, and their teenage son move in next door. The son documents the world around him with a camcorder, collecting recordings on videotape in his bedroom, finding beauty in unexpected places. He pays for supplies by dealing marijuana, using part-time catering jobs as a front.\n\nThe strict and abusive father had previously sent his son to a psychiatric hospital and military school. A gay couple living nearby welcome the new family, angering the homophobic father. During a cheerleading routine, the media executive becomes infatuated with his daughter's friend, who brags about being sexually experienced. He starts having sexual fantasies about her.\n\nThe wife begins an affair with a married real estate professional. The husband quits his job, blackmails his supervisor, and starts working as a fry cook. He buys a classic muscle car and begins exercising after overhearing the friend teasing his daughter. He starts smoking marijuana supplied by the neighbor's son and flirting back with the friend.\n\nThe daughter's friendship with her friend deteriorates as the husband shows sexual interest, and she begins a relationship with the neighbor's son. The wife's affair ends, and she becomes frustrated by her lack of professional success. The military father becomes suspicious of his son's friendship with the husband, assuming they are sexually involved.\n\nAfter a series of confrontations and personal revelations, the husband finds himself alone with the friend. As he begins to undress her, she admits her virginity. He realizes she had been lying about her sexual experience and stops. An unseen figure then shoots him in the back of the head.\n\nThe son and daughter discover the body. The wife finds her husband dead and hides in the closet. The military father returns home with a missing gun. In a final narration, the murdered husband reflects on meaningful experiences in his life, expressing gratitude and finding happiness despite his death."
}