{
  "obfuscated_plot": "A military general of an ancient empire intends to return home after leading his army to victory against a rival tribe near a frontier outpost. The aging emperor tells the general that his own son is unfit to rule and wishes the general to succeed him, as regent, to restore the republic. Angered by this decision, the son secretly assassinates his father. The son proclaims himself the new emperor and requests loyalty from the general, who refuses. The general is arrested by imperial guards, who tell him that he and his family will die. The general kills his captors and, wounded, rides home, where he finds his wife and son murdered. He buries them and collapses from his injuries. He is found by slave traders, who take him to a distant province and sell him to a gladiator trainer. The general reluctantly fights in local tournaments, his combat skills helping him win matches and gain popularity. He earns a nickname and befriends other gladiators. In the capital, the new emperor organizes months of gladiatorial games to commemorate his father and win public approval. The trainer reveals he was once a gladiator freed by the previous emperor and advises the general to \"win the crowd\" to gain his freedom. The trainer takes his gladiators to fight in the capital's grand arena. Disguised, the general debuts and unexpectedly leads his side to victory, winning crowd support. The emperor and his young nephew enter the arena. Seeing the nephew, the general refrains from attacking the emperor, who orders him to reveal his identity. The general removes his helmet and declares his intent to seek vengeance. The emperor is compelled by the crowd to let the general live. That evening, the general is visited by a former lover and the emperor's sister. Distrusting her, he refuses her help. The emperor arranges a dangerous duel for the general, which he survives through skill and mercy. The crowd's support for the general grows, angering the emperor. The general discovers his former military units remain loyal to him. He secretly meets with the former lover and an influential senator to plan an uprising. The emperor becomes suspicious and attacks the gladiators' barracks. The trainer and his men sacrifice themselves to enable the general's escape, but he is captured. The emperor challenges the general to a duel, stabbing him beforehand to gain an advantage. Despite his injury, the general defeats the emperor in combat, killing him. Before dying, the general asks for political reforms and the protection of his allies. As he dies, he envisions reuniting with his murdered family. His friends honor him and carry his body away. That night, a friend buries small figurines representing the general's wife and son at the place of his death."
}