{
  "obfuscated_plot": "In a southern country, two police officers stop a drug transport. A high-ranking government official interrupts their arrest to offer one officer a special assignment: apprehending a dangerous hitman for a drug cartel. In a border city, under torture, the hitman provides names of cartel members, who are arrested. The officers' efforts cripple the cartel's cocaine operation, but one officer discovers the official is actually working for a rival cartel; his anti-drug campaign is a charade to eliminate competitors. When his partner attempts to sell information to federal agents, the official has him murdered in the desert, forcing the other officer to watch. The officer arranges a deal with federal agents to testify against the official in exchange for electricity in his neighborhood to keep local children away from crime. The official's secrets are revealed, and he is arrested. The officer makes a public statement about widespread corruption in law enforcement.\n\nA conservative judge from the Midwest is appointed to lead the national drug control policy, though warned the drug war is unwinnable. His teenage daughter has developed a severe drug addiction introduced by her boyfriend. The daughter and her friends are arrested after attempting to dump an overdosing student at a hospital. The parents struggle to deal with her addiction, with the mother having known about it secretly for months. \n\nThe judge visits the southern country and is initially encouraged by anti-cartel efforts. Returning home, he learns his daughter has run away, stealing money to buy drugs. He searches a nearby city, eventually finding her in a seedy hotel with an older man. During a national presentation, he abandons his prepared speech, declaring that the drug war means fighting one's own family.\n\nIn another city, undercover federal agents arrest a drug dealer who exposes his boss, a major drug lord. The drug lord is indicted by a tough prosecutor. As his trial begins, his pregnant wife learns of his true profession and faces life imprisonment and death threats. She arranges to have a key witness assassinated, but the hired hitman is killed first. The witness is eventually poisoned, and the drug lord is released.\n\nAn investigating agent plants a listening device and smiles, knowing he has evidence against the drug lord."
}