{
  "obfuscated_plot": "In 1947, a young mathematician arrives at a prestigious university as a scholarship recipient. He meets fellow graduate students in mathematics and science, and his roommate, a literature student. Determined to publish an original idea, the mathematician is inspired during a discussion with classmates about approaching a group of women at a bar. He develops a new theoretical concept about cooperative dynamics. His theory earns him an appointment at a prominent research institution where he brings two of his colleagues with him. In 1953, the mathematician is invited to a military facility to work on encrypted communications. Bored with his academic work, he is recruited by a mysterious government agent for a classified assignment: identifying hidden patterns in publications to thwart an enemy plot. He is given what he believes is an implanted device that gives him access to a secret drop location. The mathematician becomes increasingly obsessive and paranoid. He falls in love with a student and they marry. After witnessing a shootout between the agent and enemy operatives, he tries to quit but is forced to continue. While delivering a guest lecture at another university, he believes enemy agents are pursuing him and is forcibly sedated. He awakens in a psychiatric facility under a doctor's care. The doctor tells his wife that the mathematician has a mental illness and that his roommate, the roommate's young niece, and the government agent exist only in his imagination. His wife and colleagues investigate his study and discover unopened documents. His wife reveals the truth to him, and he attempts to locate the implanted device, which doesn't exist. He undergoes treatment and is eventually released. Frustrated with medication side effects, he secretly stops taking it and encounters the hallucinated agent again. In 1956, his wife discovers he has relapsed after finding he had left their infant son unattended, convinced his imaginary roommate was watching the child. During a crisis, he accidentally strikes his wife and baby, believing he's protecting them. His wife flees, and he realizes his hallucinations haven't aged over the years. He chooses to manage his symptoms without hospitalization with his wife's support. He returns to the university, approaching his former rival, now department head, who allows him to work in the library. Over the next two decades, he learns to ignore his hallucinations and is eventually allowed to teach again. In 1994, he is awarded a major prize for his theoretical work and is honored by his colleagues. At the ceremony, he dedicates the prize to his wife. He encounters his hallucinations after the ceremony but ignores them as he leaves with his family."
}