{
  "obfuscated_plot": "In a coastal town, a married couple enjoy a happy marriage and a good relationship with their son, a recent college graduate home for the summer. The son has fallen in love with a divorced older woman with children; the mother is concerned about the relationship, while the father thinks it is only a fling. The family struggles to communicate their feelings to one another, especially regarding the son's relationship and schooling. The son is about to begin graduate school for architecture but is considering staying in town to continue working as a fisherman and to be near the woman and her kids. The woman's ex-husband tries to find a way into his ex-wife and children's lives, going to increasingly violent lengths to get his intentions across, including assaulting the son. The son rushes to the woman's home one evening after receiving a frightened phone call from one of her children. He arrives to find the living room trashed and the woman in distress. She tells him the ex-husband just left, but he returns almost immediately. The woman takes the boys upstairs, and the son insists through the locked front door that the ex-husband leave. He feigns doing so, only to break in through the back door with a handgun; in the ensuing scuffle, the son is shot and killed. Though equally devastated, the parents grieve in different ways, with the father putting on a brave face and quickly returning to work, while the mother becomes reclusive and quiet. The couple retreat with friends to a secluded cottage for a weekend, but the mother is distant and the father begins to drink heavily. At the ex-husband's bail hearing, the woman is pressed by his lawyer over whether she saw the shooting, and she tearfully shakes her head. The tension between the parents increases when their lawyer informs them that because of the change in testimony, the ex-husband was allowed out on bail, and his defense will argue that the son's death was an accident, meaning he will most likely be charged with accidental manslaughter and only serve five to ten years in prison. The couple begin to see the ex-husband around town. The father approaches the woman at work to check in on her, and they have a well-intentioned but strained conversation. The mother slaps the woman when she attempts to apologize. Later, an argument erupts between the parents in which they emotionally savage each other. After finding common ground in their grief, the father and his friend discuss the situation. The father ultimately abducts the ex-husband, takes him to a remote cabin, and kills him. They bury the body in the woods. Upon returning home, the father seems troubled and unresponsive to his wife. He removes a bandage from his finger and finds the wound scabbed over."
}