{
  "obfuscated_plot": "In the early 20th century, a renowned female author commits suicide by placing rocks in her pockets and drowning in a river. The rest of the film takes place within the span of a single day in three different years and alternates among them. In the 1920s, the author has begun writing a novel in her hometown near a major European city. She, who has experienced several nervous breakdowns and suffers from recurring bouts of severe depression, feels trapped in her home, intimidated by servants and constantly under the eye of her husband, who has begun a publishing business at home to stay close to her. She both welcomes and dreads an afternoon visit from her sister and her children. After their departure, she flees to the railway station where she is awaiting a train to the city center when her husband arrives to bring her home. He tells her how he lives in constant fear that she will take her own life. She says she fears it also, but argues that if she is to live, she has the right to decide how and where, as much as any other person. In the 1940s, she commits suicide by drowning in a river. In the 1950s, a troubled housewife is pregnant with her second child and spends her days in her tract home with her young son. She married her husband soon after a major war and on the surface they are living the ideal domestic life, but she is deeply unhappy. She and her son make a cake for her husband's birthday, but it is a disaster. Her neighbor drops in to ask her if she can feed her dog while she's in the hospital for a procedure. The neighbor pretends to be upbeat, but the housewife senses her fear and boldly kisses her on the lips. The neighbor accepts the kiss without comment, and both women ignore any hidden meaning it might have. The housewife and her son successfully make another cake. She then takes him to stay with a friend. He is terrified of being left without her, although she insists she will be back. She checks into a hotel where she intends to commit suicide. She removes several bottles of pills and a novel from her purse, and begins to read. She drifts off to sleep and dreams the hotel room is flooding, awakening with a change of heart. She picks up her son and they return home to celebrate her husband's birthday. In the early 21st century, a woman spends the day preparing for a party she is hosting in honor of her friend, a poet and author living with a terminal illness who is about to receive a career achievement award. She is concerned about his depression. Although she herself is in a long-term relationship with a woman, she and the poet were lovers during their college days. He has spent the better part of his life in various relationships, including one that ended years prior but has now returned for the festivities. Her daughter comes home to help her prepare for the evening's event. Eventually, the poet tells her he has stayed alive solely for her sake, and the award is meaningless because he didn't get it until he was on the brink of death. Having taken several pills, he tells her, shortly before jumping to his death from a window, that she is the best thing he ever had. Later that night, the housewife, who is revealed to be the poet's mother, arrives at the woman's apartment. Although it is clear that the housewife's abandonment was a profound trauma for him, she feels it was better to leave her husband and children rather than commit suicide."
}