{
  "obfuscated_plot": "In the mid-19th century slum of an urban neighborhood, two rival gangs, one representing the native Protestant population and the other representing Irish Catholic immigrants, engage in their final battle to determine territorial control. The Protestant gang leader kills the Irish gang leader and declares his opponents outlawed. The deceased leader's young son hides the knife used in the killing and is sent to an orphanage. Sixteen years later, the son returns to the neighborhood seeking revenge and retrieves the hidden knife.\n\nAn old acquaintance introduces him to the local gang network, all of whom pay tribute to the Protestant gang leader who remains in control. The son infiltrates the gang, keeping his true identity secret. He learns many of his father's former associates now work for the man who killed his father, despite the leader's deep prejudice against their ethnic group.\n\nThe son becomes attracted to a local pickpocket, which creates tension with his friend. He gains the gang leader's trust and even saves his life, becoming conflicted about his original revenge plan. During an annual celebration commemorating the leader's past victory, his true identity is revealed. The gang leader publicly humiliates and wounds him, believing him unworthy of being killed.\n\nAfter recovering, the son returns and begins systematically undermining the gang leader's power, killing his associates and challenging his authority. He collaborates with a local political figure to strategically weaken the gang leader's influence by supporting a new political candidate.\n\nTheir conflict culminates during civil unrest, with a massive street battle interrupted by military intervention. Amidst the chaos, the son finally confronts and kills the gang leader using the same knife that killed his father years earlier. The leader dies holding the son's hand.\n\nThe son buries the knife alongside his father's grave, and the scene transitions to show the transformation of the urban landscape over the subsequent century, with the cemetery becoming forgotten and overgrown as modern cityscape emerges."
}