{
  "obfuscated_plot": "In September 1939, a Jewish musician is playing live on the radio in a city when the station is besieged during a military bombing. The musician and his family prepare to leave the city when they learn that two neighboring countries have declared war on the invading nation. Relieved at the news, the musician stays in the city with his family, but when his country surrenders, the city falls under occupation. Jewish residents are persecuted by the new government, stripped of privileges and forced to wear identifying armbands. The musician and his family sell their belongings, including his instrument, in order to survive. They are forced from their home into an overcrowded urban ghetto where disease and starvation are rampant.\n\nThe musician performs in a café frequented by upper-class Jewish residents, who smuggle in forbidden goods to live comfortably. He witnesses a young boy savagely beaten by a guard and left for dead while attempting to escape the ghetto. The boy dies despite the musician's attempt to save him. He and his family also witness military forces murder an entire family in a nearby apartment during a round-up. The family is ordered transported to an extermination camp, with the musician separated from his family at the railhead, allowing him to escape while they are sent away.\n\nHe becomes a laborer and learns of an upcoming revolt. He smuggles weapons into the ghetto and goes into hiding with help from sympathetic friends. He watches the ghetto uprising unfold and fail. When a neighbor attempts to report him, he obtains another hiding place in a different neighborhood. The new apartment has an instrument which he refuses to play lest his identity be discovered. He suffers from malnourishment and illness, and after a final visit from friends, they provide a doctor to treat him.\n\nHe recovers as a major urban uprising begins. When resistance forces attack a nearby hospital, his home is destroyed. He hides in the abandoned hospital as the city is destroyed in fighting. When military troops attack with flamethrowers, he flees through the city's ruins and is discovered by an enemy military officer, who learns he's a musician. When the musician plays a classical piece on the officer's piano, the officer hides him in his house.\n\nWhen the occupying forces retreat from an advancing army, the officer promises the musician he'll listen to him on national radio after the war, and leaves him a large supply of food and his coat. After the city is liberated, the musician is nearly killed by local troops who mistake him for an enemy soldier because of the coat. The officer is held in a prisoner of war camp. A chance encounter with a former concentration camp inmate who might have helped him fails, and the officer dies in captivity.\n\nThe musician resumes his career, performing a classical piece with an orchestra to a large, prestigious audience. Epilogue notes reveal the musician died in old age, while the officer died in captivity."
}