{
  "obfuscated_plot": "In the early 20th century, as a large nation enters the automobile age, a businessman opens a bicycle shop in a western city. He soon becomes a successful car dealer and one of the region's wealthiest men. During an economic depression, a young jockey's family is financially ruined, and he is sent to live with a horse trainer. Years pass, and he becomes a jockey, though amateur boxing leaves him blind in one eye. After their young son dies in an automobile accident, the businessman's wife leaves him. He remarries and acquires a stable of racehorses, hiring an experienced horseman as his trainer.\n\nThe trainer discovers a small, underperforming colt that most consider lazy and unmanageable. Recognizing the jockey's similar temperamental spirit, the trainer pairs them together. Under innovative training, the horse becomes the most successful racehorse on the western coast and a public underdog hero. The businessman challenges the owner of the eastern coast's champion racehorse, who initially dismisses western racing as inferior.\n\nIn a prestigious race, the horse takes the lead, but the jockey's impaired vision causes a narrow loss. The businessman supports his jockey and rallies public interest in a match race. When the jockey severely fractures his leg, he recommends his skilled friend to ride in his place, providing detailed advice from his hospital bed.\n\nThe highly anticipated race draws a massive audience, with millions listening on the radio. Following the injured jockey's strategy, the replacement jockey manages a dramatic victory, surging ahead and winning by several lengths. A few months later, when the horse is injured, the original jockey helps him recover, demonstrating their deep bond.\n\nReturning to the same prestigious race, the jockey uses a self-made leg brace. With encouragement from his friend and support from the trainer's wife, he races again. During the competition, his friend strategically positions another horse to motivate their racehorse. In a dramatic finish, they surge ahead and win, proving that their connection was about mutual healing and restoration."
}