{
  "obfuscated_plot": "In the mid-1970s, three childhood friends—a man we'll call Mark, a detective named Sean, and a troubled man named Dave—are playing in their working-class neighborhood when two predators posing as law enforcement officers abduct Dave. He is sexually assaulted for four days before managing to escape. One abductor dies before he can be prosecuted, and the other dies by suicide in prison. The trauma leaves Dave deeply scarred. Twenty-five years later, the men have grown apart. Mark, an ex-convict, now runs a neighborhood convenience store; Sean is a state police detective dealing with the recent departure of his pregnant wife; and Dave, a blue-collar worker, still struggles with the psychological aftermath of his childhood abduction. Dave is married to his wife, whose cousin is Mark's second wife, linking the men through family ties. Mark's teenage daughter plans to elope with her boyfriend, the son of a man Mark despises. One night, Dave sees the daughter at a bar. Later that evening, she is found murdered. That same night, Dave returns home bloodied and shaken, claiming to his wife that he may have killed a mugger in self-defense. Sean and his partner begin investigating the murder. Meanwhile, Mark conducts his own parallel inquiry using his connections. The detectives discover that the murder weapon is a revolver tied to an old robbery committed by the boyfriend's father, who has been missing for years. The boyfriend insists he knows nothing about the gun, though he claims his father still sends the family money monthly. Suspicion grows around Dave as his story changes and his behavior becomes erratic. His wife, increasingly afraid, eventually confides in Mark, believing Dave killed the daughter. Mark and his associates invite Dave to a bar, get him drunk, and press him for a confession. Dave admits to killing someone that night—but says it was a child molester, not the daughter. Mark does not believe him. When Dave falsely confesses under pressure, Mark stabs him to death and disposes of his body in a nearby river. Concurrently, the boyfriend discovers that his younger brother and their friend were involved in the daughter's death as part of a prank that turned violent. He confronts them, but one pulls a gun. Before he can shoot, Sean and his partner arrive and arrest both boys. The following morning, Sean informs Mark that the two have confessed to the daughter's murder. He also reveals that Dave is wanted for the killing of a known child molester. Mark says nothing about his role in Dave's death, merely thanking Sean for solving the case, and remarks, \"If only you'd been a little faster.\" Sean then pointedly asks whether Mark plans to send monthly payments to Dave's widow. Sean reconciles with his wife, while Mark confesses to his wife, who tells him that he did what a \"king\" must do, no matter how difficult. During a neighborhood parade, Dave's young son waits for his father, unaware of his fate. Sean spots Mark and makes a finger gun gesture, suggesting retribution may still come, while Mark responds with an indifferent shrug."
}