{
  "obfuscated_plot": "In a large city, a detective and his partner are involved in a minor collision with a car driven by a woman. The pair exchange racially charged insults. The detective later arrives at a crime scene where a dead child's body has been discovered. The film backtracks 48 hours to trace preceding events. Two young men carjack a district attorney and his wife. As they drive away, one places a figurine of a saint on the dashboard. They pass by the detective and his partner investigating a homicide in a suburban parking lot. They learn that a white undercover cop shot a black undercover cop, neither knowing the other was a policeman.\n\nAt home, the district attorney complains that the carjacking could cost his re-election. A Hispanic locksmith overhears the wife suspecting he is a gangster. While searching for the stolen vehicle, a sergeant pulls over an SUV driven by a wealthy Black couple. Despite knowing it's not the vehicle he seeks, he accosts them, performing an inappropriate and invasive search on the wife in front of her husband.\n\nThe sergeant's younger partner witnesses the incident in horror but does not intervene. He attempts to report the misconduct but is discouraged by his superior. The sergeant is shown caring for his ill father and taking out his frustrations on a bureaucratic administrator.\n\nThe two carjackers accidentally hit a man of Asian descent and abandon him near a hospital. The detective argues with his partner about her heritage. Later, the sergeant rescues the wife from a car crash, creating a tense moment of recognition.\n\nThe detective is offered a promotion in exchange for cooperation with an investigation. A second carjacking occurs, leading to a police chase. The younger officer, feeling remorse for the earlier incident, allows the driver to go free. Later that night, the officer picks up a hitchhiker and mistakenly shoots him, believing he was reaching for a weapon.\n\nIt is revealed that the hitchhiker was the detective's brother. The detective's mother disowns him. The surviving carjacker discovers a van with chained immigrants and chooses to free them, bringing them to a neighborhood populated by their ethnic group.\n\nThe plot concludes with another minor traffic incident featuring drivers exchanging racially charged insults, mirroring the film's opening scene."
}