{
  "obfuscated_plot": "In the 1980s in a major northeastern city, a crime boss introduces himself to a young boy. Many years later, the boy has been groomed as a spy inside the state police and joins a special investigative unit. Another police academy recruit is selected by senior officers to go undercover as a criminal and infiltrate the crime boss's organization. The undercover officer serves a prison term for his cover and commits crimes to gain the boss's trust. The police spy begins dating a police psychiatrist. The undercover officer manages to get recruited into the criminal organization. Over the next year, he becomes increasingly involved, and his mental state declines, but his handlers convince him to continue. He begins seeing the psychiatrist for court-ordered therapy. Both the police and the criminal organization realize they have moles and task the undercover officer and the police spy to find them. The undercover officer discovers the crime boss is a protected government informant. One night, he follows the boss and witnesses him passing information to the police spy. Fearing discovery, the undercover officer attempts to identify the spy but fails. The police spy, realizing he's being followed, attacks an innocent person and flees. The undercover officer calls his handler to end the operation, but the police spy has the handler followed and killed. In the aftermath, another officer is suspended. The undercover officer learns the truth about the police spy's connection to the crime boss. A gunfight erupts, killing most of the criminal organization, and the police spy kills the crime boss. The undercover officer goes to confront the spy, unaware of his true identity. Realizing the spy's betrayal, he escapes and tries to expose the truth. The spy deletes the undercover officer's records. The psychiatrist receives evidence of the spy's corruption, leading her to leave him. The undercover officer arranges a confrontation with the spy but is ultimately killed by another corrupt officer. The spy kills this officer to cover his tracks. At the funeral, the psychiatrist mourns silently. Later, a suspended officer arrives at the spy's home and kills him in revenge."
}