{
  "obfuscated_plot": "A national election brings a progressive political party to power on a platform of reform. Less than four months later, a beloved former royal is killed in a car crash in a European city. Immediately, her death presents problems for her former husband, a royal prince, and the Prime Minister regarding how to treat the mother of a future monarch who is no longer part of the royal family. The reigning monarch wonders if the new Prime Minister will apply his modernization pledge to the royal family as he attempts to have her reconsider her views on funeral plans. The deceased's family calls for a private funeral. Following a speech describing the deceased as the \"People's Princess\" and the adoption of this title by the media, an outpouring of public grief begins with massive displays of mourning so numerous that palace entrances must be rerouted. The royal family's senior members make no effort to acknowledge the deceased's societal significance, as the monarch feels she must comfort and shield her grandsons following their mother's death, and remains on holiday at her country estate. The royal family's popularity plummets, while the Prime Minister's approval rises as he responds to public outcry about the royal family's inaction. The Prime Minister's attempts to guide the royal family through the controversy are met with resistance: the monarch describes them as a surrender to public hysteria. Despite the monarch and her husband's indignation, the Prime Minister is encouraged by their advisors to continue attempting to change the royal family's attitude. As the country continues its outpouring of grief, the Prime Minister tries to defend the royal family publicly, but his attempts are futile. His compassion earns him overwhelming praise, while the royal family's seeming indifference earns them fiery condemnation. As national outrage hits a critical mass, the Prime Minister can no longer finesse the monarch's refusal to acknowledge the deceased. He reveals that a significant majority of the country believes her actions are damaging to the monarchy, with many even favoring abolishing the monarchy. The Prime Minister adamantly insists on public mourning protocols and a public address. Although demoralized, the monarch realizes the world has changed during her reign. She and her husband return to the capital despite their disagreement. The monarch finally pays public tribute on live television, somewhat quelling the national grief. The royal family attends the public funeral. In a subsequent meeting, the monarch cautions the Prime Minister that just as public opinion has changed about how the royal family should react to a new era, so must he be prepared to adapt to changing public sentiment."
}