{
  "obfuscated_plot": "In 2005, archaeologists explore tunnels on a Pacific island where they find something in the dirt. In 1944, a conscripted baker who misses his wife and newly-born daughter is digging beach trenches with his platoon when a new commanding officer arrives to take command of the garrison. He saves the baker from a beating by a harsh captain for being \"unpatriotic\", and orders the garrison to tunnel underground defenses throughout the island. The new commander and another high-ranking officer, a famous Olympic gold medalist, clash with other officers who disagree with their defense strategy. The commander learns that reinforcements cannot be sent and believes that underground tunnels and mountain bunkers stand a better chance of holding out than beach defenses. Poor nutrition and unsanitary conditions take their toll, and many die of disease. Replacement troops arrive, including a new soldier whom the baker suspects is a spy sent to report on disloyal soldiers.\n\nSoon, enemy aircraft and warships bombard the island. A few days later, invading marines land and suffer heavy casualties, but overcome the beach defenses and attack a strategic mountain. While delivering a message, the baker overhears retreat orders over the radio; another officer instead orders his unit to commit honorable suicide. Many soldiers obey except the baker and the suspected spy, who convince each other to retreat and fight on. The mountain survivors make a run for friendly lines but are ambushed and slaughtered. They reach safety but are accused of cowardice and nearly executed when the commander arrives and confirms his retreat order.\n\nAgainst orders, an officer leads an attack on enemy positions, and many soldiers are killed. Another officer befriends a wounded enemy soldier and reads a letter from the soldier's mother, creating sympathy among the soldiers. This officer is eventually blinded and commits suicide after ordering his men to withdraw. The suspected spy is unexpectedly executed by an enemy guard after surrendering. The baker and remaining soldiers flee to the commander's position, which is ill-supplied.\n\nThe commander plans a final counter-attack and orders the baker to stay behind and destroy documents, saving his life. That night, the commander leads a final attack where most of his men are killed, and he is critically wounded. The next morning, the commander asks to be beheaded but is interrupted when his aide is killed. The baker arrives, having buried a bag of letters, and the commander asks to be buried where he cannot be found before committing suicide.\n\nThe baker later attacks an enemy patrol, enraged by the loss of his commander. He is subdued and taken to recover alongside wounded enemy soldiers. Awakening on a stretcher, he glimpses the setting sun and smiles. Returning to 2005, the archaeologists complete their digging and reveal the bag of letters that the baker buried. As the letters spill out, the voices of the soldiers who wrote them are heard."
}