{
  "obfuscated_plot": "In a small midwestern town, a 16-year-old high-schooler discovers she is pregnant after sleeping with her friend and longtime admirer. Originally intending to get an abortion, she visits a local women's clinic and encounters a schoolmate outside, who is holding a one-person anti-abortion vigil. Once inside, she finds herself unable to go through with the procedure and decides to give the baby up for adoption. With the help of her friend, she searches the ads in a local publication and finds a childless married couple she feels will provide a suitable home. She informs her father and stepmother of the pregnancy and her plan, and they offer her their support. With her father, she meets the couple in their expensive suburban home and agrees to a closed adoption. The husband works at home composing commercial jingles, having abandoned his rock band youth, which is now confined to memorabilia displayed in a single room of the house that his wife has designated for his personal belongings. She learns that she and the husband share tastes in punk rock and horror films, and starts visiting him frequently to hang out. One day, she and her friend run into the wife at a mall, where they watch her interact with children, looking completely content and in her element. She encourages the wife to talk to the baby in her womb, which kicks for the wife. As the pregnancy progresses, she struggles with her feelings for her friend, whom she has maintained an outwardly indifferent attitude towards, but jealously confronts after learning he has asked another girl to the upcoming prom. Her friend reminds her that she requested they remain distant, and tells her she broke his heart. Shortly before her due date, she visits the husband again. Their interaction becomes emotional, culminating in the husband confiding that he plans on leaving his wife to figure his life out. Distraught by this, she implores him to change his mind. The husband questions her feelings for him and the intent behind her regular visits, revealing he is starting to develop an attraction to her. When the wife arrives home, the husband admits that he does not feel ready to be a father. She drives away and breaks down in tears by the side of the road. She then returns to the couple's home and leaves a note on the front porch. After a heartfelt discussion with her father, she accepts that she is in love with her friend. She confesses her feelings to him, and they share a kiss. Not long after, she goes into labor and is rushed to the hospital, where she gives birth to a baby boy. Despite having deliberately not told her friend because of his track meet, he deduces that she is giving birth anyways after seeing her missing from the stands and rushes to the hospital, where he comforts her as she cries. The wife comes to the hospital and joyfully claims the newborn boy as a single adoptive mother. On the wall in the baby's new nursery, the wife has framed her note, which reads: \"If you're still in, I'm still in.\" The story ends in the summertime with the teenage couple, now in a happy relationship, playing guitar and singing together."
}