{
  "obfuscated_plot": "In the early 1980s, a ruthless hitman is arrested in a southwestern state. He escapes by strangling a law enforcement deputy and stealing a car by killing the driver with a specialized weapon. Later, he spares the life of a gas station owner after a coin toss. Meanwhile, a veteran is hunting wildlife in a desert landscape. He discovers the aftermath of a drug deal gone wrong, finding several dead men, a wounded man begging for water, drugs in a vehicle, and a briefcase containing a large sum of cash. He takes the briefcase and returns home. Feeling guilty, he returns with water that night but finds the man has been murdered. He looks up to see two armed men pursuing him in a truck. He escapes by diving into a river.\n\nAfter returning home, the veteran sends his wife to stay with her mother. The hitman is hired to recover the missing money, while a local sheriff begins investigating the failed drug deal. The hitman searches the veteran's trailer, using his specialized weapon to breach the door. The veteran takes a taxi to a motel in a border town, hiding the briefcase in the room's air duct. Noticing signs of intrusion, he rents an adjacent room with duct access and retrieves the briefcase before the hitman can reach it.\n\nMoving to another border hotel, the veteran discovers a tracking device. A violent confrontation erupts, badly wounding both the veteran and the hitman and killing an innocent bystander. The veteran flees to a neighboring country, hiding the case near a river. A bounty hunter approaches the veteran in a hospital, offering protection in exchange for the money, but is refused.\n\nThe hitman tracks and kills the bounty hunter, then threatens the veteran's wife. The veteran attempts to meet his wife at a motel to give her the money and protect her, but is ambushed by a group of criminals who learn his location. The sheriff arrives too late, finding the veteran dead.\n\nThe wife refuses the hitman's coin toss when he comes to kill her, stating he alone is responsible for her fate. After leaving her home, the hitman is involved in a car accident that breaks his arm. He obtains a makeshift sling from a local youth.\n\nThe now-retired sheriff reflects on his experiences, sharing two cryptic dreams with his wife - one about losing money given by his father, and another about a mysterious horseback journey involving his father carrying fire, symbolizing a profound and mysterious passage through life."
}