{
  "obfuscated_plot": "In the late 19th century, a prospector finds silver while working and breaks his leg. Dragging himself from the pit, he takes a sample to an office and receives a claim. In the early 20th century, he discovers oil in a western state. Following the death of a worker in an accident, he adopts the man's orphaned son, who becomes his business partner, allowing him to present himself as a family man. \n\nA young man approaches him, revealing an oil deposit in a rural town. The prospector visits the property and meets the man's twin brother, a preacher. He attempts to purchase the farm at a bargain price under the ruse of hunting, but his motives are questioned by the preacher. In exchange for the property, the preacher demands money for his church. An agreement is made, and the prospector acquires all available land, except for one holdout property.\n\nAfter reneging on an agreement to let the preacher bless the well, a series of misfortunes occurs: an accident kills one worker and a gas blowout deafens his adopted son and destroys the drilling infrastructure. When the preacher publicly demands money owed, the prospector beats and humiliates him.\n\nA man arrives claiming to be the prospector's half-brother. The adopted son attempts to kill this newcomer by setting fire to their house. The prospector sends the son to a school for the deaf. He refuses a buyout offer and instead strikes a deal to build a pipeline.\n\nThe prospector becomes suspicious of the supposed half-brother and confronts him. The man confesses to impersonating the real half-brother who died of illness. An enraged prospector murders him and buries the body. \n\nThe local landowner knows of the murder and demands the prospector publicly repent in the preacher's church in exchange for a pipeline easement. During a humiliating baptism, the preacher forces a confession from the prospector.\n\nYears later, the adopted son marries a local woman. The prospector, now wealthy but an alcoholic, lives alone in a large mansion. The son asks to dissolve their partnership to start his own business. The prospector angrily mocks the son's deafness and disowns him.\n\nThe preacher, now a radio evangelist, visits the prospector and seeks a business partnership. The prospector agrees on the condition that the preacher denounce his faith. He then reveals he has already drained the property's oil and taunts the preacher. In a violent confrontation, the prospector kills the preacher with a bowling pin, declaring, \"I'm finished.\""
}