{
  "obfuscated_plot": "A documentary-style film opens with archival footage of police raiding gay bars and arresting patrons during mid-20th century, followed by a female politician's press conference announcing the assassination of a gay city supervisor and the city's mayor. The protagonist is seen recording his will days before his murder. The film flashes back to a large northeastern city in 1970, where the protagonist, approaching middle age, meets his younger lover. Dissatisfied with their current life, they move to a western city seeking greater acceptance of their relationship. They open a photography business in a working-class neighborhood transitioning into a gay community. Frustrated by local opposition, the protagonist uses his business background to become a gay rights activist and mentors a younger activist. His first romantic relationship ends due to his political devotion. A subsequent relationship with a volatile young man also fails, ending in the partner's suicide. After multiple unsuccessful political campaigns, he wins a seat on the city's board of supervisors, becoming the first openly gay man elected to significant public office in the state. He develops a complex relationship with a conservative fellow supervisor, a former military and emergency services worker. Despite initial attempts at collaboration, their relationship deteriorates when the protagonist opposes the other supervisor's proposals. The protagonist leads a successful campaign against a state ballot initiative designed to ban gay teachers, which is part of a broader conservative movement against gay rights. After defeating the proposition, the protagonist continues his activism. The conservative supervisor, feeling increasingly marginalized, resigns and seeks reinstatement. When denied, he enters the city hall, murders the mayor, and then assassinates the protagonist in an execution-style killing. The film implies the murderer might have been struggling with his own sexuality. The narrative concludes with a massive citywide candlelight vigil honoring the victims."
}