{
  "obfuscated_plot": "In the early 1990s, a young boy from a poor urban neighborhood obtains an autograph from a famous movie star after jumping into a cesspit, deterring crowds by being covered in human waste. His elder brother later sells the autograph. Their mother is killed during violent city riots. While escaping the riots, the brothers encounter a child dressed as a mythological hero. They meet a girl from their neighborhood and suggest she could be their \"third companion\". \n\nThe children are found by a criminal who trains street children to become beggars. After witnessing the criminal blinding children, the elder brother escapes with the younger boy and the girl. They board a moving train, but the girl cannot keep up. The elder brother deliberately lets her go after a previous conflict.\n\nFor years, the brothers travel, making a living through various odd jobs. They return to their city to find the girl and discover she is being groomed for prostitution. They rescue her, with the elder brother killing the criminal. The elder brother then works for a rival crime lord and appears to attempt to assault the girl.\n\nYears later, the younger brother works in a call center and learns his brother is a high-ranking criminal. He reunites with the girl, who initially rejects him. He promises to wait for her daily at a major train station. When she attempts to meet him, she is captured and scarred by the crime lord's men.\n\nTo find her, the younger brother becomes a contestant on a popular game show. He performs well, attracting suspicion from the show's host. After being arrested and interrogated, he returns to the show. His brother, feeling guilty, helps the girl escape.\n\nDuring the final question, the younger brother calls his brother's phone. The girl answers, confirming her safety. Meanwhile, the crime lord discovers the brother's betrayal. The brother kills the crime lord but is then killed by his men.\n\nThe younger brother correctly answers the final question and wins the grand prize. He and the girl reunite at a train station and kiss."
}