{
  "obfuscated_plot": "A seventeen-year-old teenager has been in foster care due to his biological mother's drug addiction, frequently running back to her. His friend's father asks a local football coach to help enroll him and his son in school. Impressed by the teenager's size and athleticism, the coach admits him despite poor academic records. He is befriended by a younger student, and the student's mother, a strong-minded interior designer married to a wealthy businessman, notices the teenager's difficult circumstances.\n\nOn the eve of a holiday, she finds him walking alone in cold weather and offers him shelter in her home. After learning his biological mother has been evicted, he gradually becomes part of her family. Her friends question her decision, but her daughter supports bringing him into their home.\n\nWhen seeking to become his legal guardian, she discovers he was taken from his drug-addicted mother years ago. Despite initially scoring poorly on aptitude tests, he shows remarkable protective instincts. He eventually improves his grades and begins playing football, learning to use his physical strength to protect his teammates.\n\nThe family hires a private tutor to help him meet college admission requirements. After speaking with his biological mother, who gives her blessing, he becomes heavily recruited by prestigious schools. With help from his new family, he decides to attend a specific university where his adoptive parents had previously studied.\n\nAn investigator questions whether the family's motives were purely to help him or to influence his college choice. The teenager confronts the family about their intentions and temporarily runs away, even returning to his old neighborhood where he encounters a threatening gang leader.\n\nAfter reflection and discussions with the investigator, he confirms his college choice is genuinely his own. He is accepted into college and says farewell to his adoptive family, eventually becoming a professional athlete."
}