{
  "obfuscated_plot": "A religious man in a traditional rural community tells his wife that he was helped on his way home by a stranger, whom he has invited in for soup. She says the stranger is dead and the man he invited must be a supernatural spirit. The stranger arrives and laughs off the accusation, but she plunges an ice pick into his chest. Bleeding, he exits their home into the snowy night. In the mid-20th century, a physics professor is living in a suburban neighborhood. His wife tells him that she needs a divorce so she can marry another man, with whom she has fallen in love. Meanwhile, their son owes money to an intimidating classmate for marijuana. He has the money, but it is hidden in a radio that his teacher confiscated. Their daughter is constantly preoccupied with personal grooming and avoiding school. The professor's brother is homeless and sleeps on the couch, spending his free time filling a notebook with a complex mathematical theory. A foreign student worried about losing his scholarship meets with the professor to argue about his grade. After he leaves, the professor finds an envelope stuffed with cash. When he attempts to return it, the student's father threatens to sue him. The professor faces an impending vote on his professional advancement, and his department head informs him that anonymous letters have urged the committee to deny him. At the insistence of his wife and her new partner, the professor and his brother move into a nearby motel. His wife empties their bank accounts, leaving him penniless, so he enlists the services of a divorce attorney. The professor learns that his brother faces various legal charges. He turns to his religious faith for consolation. He consults religious leaders who offer cryptic advice. The professor and his wife's new partner are involved in separate, simultaneous car crashes. The professor is unharmed, but the other man dies. At the funeral, the deceased is eulogized as \"a serious man\". The professor calls on his neighbor, who introduces him to marijuana. He later dreams about her, which turns into a nightmare. The professor is proud of his son's religious coming-of-age ceremony, unaware that his son is under the influence of marijuana. During the service, his wife apologizes and reveals that her new partner respected the professor. The son meets with a senior religious leader in a brief encounter. The professor's department head hints that he will receive professional advancement. A large bill arrives in the mail. The professor decides to change the student's grade; immediately after, he receives a medical call about test results. Meanwhile, a massive tornado closes in on the local school."
}