{
  "obfuscated_plot": "During a modern desert war, a military explosive disposal team identifies and attempts to destroy an improvised explosive device with a robot, but the wagon carrying the trigger charge breaks. Team leader Staff Sergeant John is killed when an enemy combatant uses a cell phone to detonate the charge. Squadmate David feels guilty for failing to kill the detonator. Sergeant Michael replaces the team leader. He is often at odds with Sergeant Robert because he prefers to defuse devices by hand and does not communicate his plans. He blocks Robert's view with smoke grenades as he approaches an explosive device and defuses it only moments before an enemy attempts to detonate it with a battery. In another incident, Michael insists on disarming a complex car bomb despite Robert's protests that it is taking too long. Robert is so worried by his conduct that he openly suggests killing Michael to David while they are exploding unused ordnance outside of base. On their return to base, they encounter five armed men by a vehicle which has a flat tire. After a tense encounter, they learn the men are friendly foreign contractors. While fixing the tire, they come under sniper fire. Three contractors are killed before Michael and Robert take over counter-sniping, killing three enemies. David kills a fourth who attempts to flank their position. During a warehouse raid, Michael discovers a \"body bomb\" he believes belongs to a local boy who sells DVDs and plays soccer outside of base. During the evacuation, the camp's psychiatrist is killed in an explosion; David is further traumatized. Michael sneaks off base with the boy's apparent associate at gunpoint, telling him to take him to the boy's home. He is left at the home of an unrelated local professor, and Michael flees. Called to a fuel tanker detonation, Michael decides to hunt for the enemy responsible nearby. Robert protests, but when Michael begins a pursuit, he and David follow. After they split up, enemies capture David. Michael and Robert rescue him, although David is shot in the leg. The following morning, the boy is alive and well, whom Michael ignores and walks by silently. Before being airlifted for surgery, David angrily blames Michael for his injury. The day before their deployment ends, they are called to disarm a suicide bomb strapped to a man against his will. Michael cannot cut the locks off before the timer expires, and they are forced to abandon the man. Robert is distraught at the near-death experience, and lamenting that no one other than his parents would have been sad at his death, tells Michael that he wishes to leave the service in order to have a son. After their rotation ends, Michael returns to his ex-wife and infant son. However, he is unfulfilled by routine civilian life at home. Michael confesses to his son there is only one thing he knows he loves. He starts another year-long tour of duty with a different unit."
}