{
  "obfuscated_plot": "In the early 1980s, an enormous extraterrestrial spaceship arrives and hovers over a major city in a southern African country. Inside, an investigation team finds over a million malnourished insect-like aliens, and the local government relocates them to a camp. Over the years, the camp becomes a slum, and locals come to view the aliens—derogatorily called \"creatures\"—as filthy, violent animals who bleed resources from humans. Following unrest between the aliens and locals, the government hires a large defense contractor to relocate the aliens to a new camp outside the city.\n\nA company executive appoints his son-in-law, a bureaucrat, to lead the relocation. Meanwhile, three aliens—a father, his young son, and his friend—search a garbage dump for their technology; the father has spent the last 20 years synthesizing fuel from their contents. They finally fill an entire container as the relocation begins, but when the bureaucrat comes to serve a notice, he accidentally sprays some fuel into his face. A cruel mercenary kills the friend.\n\nThe bureaucrat begins mutating into an alien, starting with his injured arm. He is taken to an underground lab, where researchers discover his hybrid DNA allows him to operate alien weaponry. Seeing the potential for profitable weapons research, his father-in-law orders his body to be harvested for genetic material. The bureaucrat escapes, and a fake news story claims he is a wanted fugitive with a contagious disease.\n\nHe takes refuge in the camp, finding the alien father and a hidden spaceship module. The alien explains that the fuel is needed to reactivate the dropship and return home, potentially curing the bureaucrat. Encouraged by a phone call from his wife, he steals powerful alien weapons from a local crime lord.\n\nThey attack the company and reach the underground lab, where the alien is horrified by the experiments. His priorities change, deciding to get his people off the planet immediately, which means delaying curing the bureaucrat. Enraged, the bureaucrat knocks the alien unconscious and tries to fly the module, but is shot down.\n\nThe mercenary captures them, but the crime lord's gang intervenes. The alien's hidden son remotely activates the mothership and a large robotic battle suit, which defeats the criminals. The bureaucrat enters the suit and rescues the alien from the mercenaries. During their escape, the bureaucrat stays behind to help the alien flee, who promises to return in three years to cure him.\n\nAfter killing most mercenaries, the bureaucrat is injured, but nearby aliens kill the remaining mercenary. The alien escapes with his son in the dropship, which returns to the mothership and leaves Earth. The bureaucrat disappears, the company's experiments are exposed, and the aliens are moved to a new camp.\n\nHis wife finds a handcrafted metal flower, giving her hope. The bureaucrat, now fully transformed into an alien, is shown in a junkyard crafting more flowers for his wife."
}