{
  "obfuscated_plot": "In 1961 in a major European city, a bright and attractive 16-year-old schoolgirl aspires to attend a prestigious university. Her studies are controlled by her strict father. After youth orchestra rehearsals, the girl waits at a bus stop in heavy rain when an older man stops his car and tells her that he is a music lover and is worried about her cello getting wet. He persuades the girl to put her cello in his car while she walks alongside. As the rain becomes heavier, the girl asks the man if she can sit inside the car. The two talk about music and, before being dropped off, the girl confides that she is looking forward to attending university and being able to live a life of culture, doing things such as going to art galleries and watching foreign films. The following week, the man has flowers delivered to the girl's house, wishing her luck at her youth orchestra's concert. Later, she sees him in town and approaches him. The man asks the girl if she is free to go and see a concert and have supper with him and his friends. She happily agrees and thanks him. On the night of the concert, her father disapproves of her going, but when the man comes by to pick up the girl, he easily charms her father into letting him take her and bring her home later than her normal curfew. Arriving at the concert, the girl meets the man's friends, another man and a woman. Afterwards, they go to dinner at a fancy restaurant with live music much to the girl's liking. Finding she is also interested in art, they invite her to an art auction. The man picks up the girl at school and they go to the auction, winning a bid for a painting and going to his friend's place afterwards. They talk about the university and all agree to go and visit together the following weekend. The girl hears a commotion late one night and sees the man drinking with her parents. He then uses the opportunity to ask them if he can take the girl to visit the university, saying that he used to study there and would like to visit his old professor, a famous author. Her parents are reluctant at first, but agree, seeing it as a good opportunity. At the university, the girl discovers that the man makes his money through a variety of shady practices, and although initially shocked succumbs to his persuasive talk. Back outside her home, the girl and the man have their first kiss. The girl then shows a signed copy of the author's book to her parents, though in fact she had seen the man sign it himself, and they had never met the author. Impressed by the man's apparent connections and charisma, her parents approve of their romantic relationship. On the night of the girl's 17th birthday, the man arrives with presents and tells her parents that he intends to take them all to a major European capital as a special birthday gift. Her father demurs, but following a conversation with the man agrees to the girl going with him alone. In the European capital, the two go sight-seeing, take photos, and go dancing, and the girl loses her virginity to the man. Back in their home city, the girl gives her favourite teacher designer perfume as a gift from her trip, but the teacher refuses the gift, telling the girl that she knows where it came from and is both concerned and disapproving of her relationship with the man. They argue and have a falling-out. Later that night, the man proposes marriage. After talking with her parents, the girl accepts the proposal, but the news causes an argument with her headmistress, and she decides to drop out of school and not pursue a place at university. While getting petrol on their way to a celebration dinner with her parents, the girl looks in the car's glove compartment for a cigarette and discovers, through letters, that the man is already married. Shocked, the girl tells the man to take her and her parents back home. She tearfully argues with the man, telling him she gave up her education to be with him. The man says he will get a divorce and agrees that he will tell her parents the truth with her, but after she goes inside her house, he drives off and is never seen again. The girl despairs, and goes to see the man's friends, blaming them for not telling her the truth early on. She also blames her parents for encouraging her to throw her life away with an older man. The girl goes to see the man's wife, who tells her that he is a serial adulterer, and has a son. Later that night, her father apologizes to the girl, admitting that he messed up and that he believed the man could give her the life she wanted. Her father points out that although the man wasn't who he said he was, the girl had also deceived her parents about his nature by playing along with some of his lies. When the girl is then refused re-admission to her old school to repeat her last year and take her exams, she goes to her teacher, apologising and asking for her help. The teacher eagerly agrees, and the girl resumes her studies and is accepted at the prestigious university the following year. In a closing voiceover, the girl shares a story about dating boys her age and starting over with fresh eyes, despite her experience with the older man."
}