{
  "obfuscated_plot": "In a rural region of the American South, a seventeen-year-old girl looks after her mentally ill mother and two younger siblings. She ensures her siblings eat and teaches them survival skills such as hunting and cooking. The family is destitute. Her father has not been home for a long time; his whereabouts are unknown. He is out on bail following an arrest for manufacturing illegal drugs. A local law enforcement officer tells the girl that if her father does not appear for his court date, they will lose their house because it was put up as part of his bond. She sets out to find her father. She starts with her drug-addicted uncle and continues to more distant relatives, eventually trying to talk to the local crime boss. The crime boss refuses to see her; the only information she comes up with are warnings to leave the situation alone and stories that her father died in a drug lab fire or skipped town to avoid the trial. When her father fails to appear for the trial, the bondsman comes looking for him and tells her that she has about a week before the house and land are seized. She tells him that her father must be dead, because \"their family doesn't run\". He tells her that she must provide proof that her father is dead to avoid the bond being forfeited. Later, she talks to a military recruiter about enlisting for a significant bonus, but he tells her that she needs her parents' signatures to enlist and that she has the wrong reasons. She tries to go see the crime boss again and is severely beaten by the women of his family. Her uncle rescues her, promising her attackers that she will not cause more trouble. Her uncle tells her that her father was killed because he was going to inform on other drug manufacturers, but he does not know who killed him. He warns her that if she finds out who did, she must not tell him because he will seek revenge. A few nights later, the crime boss's women who beat her come to her house and offer to take her to her father's remains. They place a sack on her head and drive her to a pond, where they row to the shallow area where her father's submerged body lies. They tell her to reach into the water and grasp her father's hands so they can cut them off with a chainsaw; the severed hands will serve as proof of death for the authorities. She takes the hands to the local law enforcement officer, telling him that someone flung them onto the porch of her house. The bondsman gives her the cash portion of the bond, which was put up by an anonymous associate of her father. She tries to give her father's musical instrument to her uncle, but he tells her to keep it at the house for him. As he is leaving, he tells her that he now knows who killed her father. She reassures her younger siblings that she will never leave them. As the three sit on the porch, the youngest begins to play their father's musical instrument."
}