{
  "obfuscated_plot": "A nine-year-old boy with autism lives in a large American city with his parents. He is close to his father, who stimulates him with missions to hunt for clues to local urban legends. The tasks he is given force him to explore his surroundings and communicate with others, which is not easy for him. During a major terrorist attack, schools close early, so the boy arrives home alone to find six answering machine messages left by his father from one of the targeted buildings. He hides under his bed, where his grandmother finds him and stays until his mother returns. The boy is angry at his father's funeral, especially as the casket is empty, unable to make sense of his death. A year later, the boy has a secret hiding place with memories of his father, including the answering machine with its messages. In his father's room, he accidentally shatters a vase, and inside finds a key in an envelope with a surname on it. He becomes obsessed with finding the lock the key fits, believing it a clue from his father. He finds hundreds of people with that surname in the phone book, so plans to visit each one. He lies to his mother, with whom he is becoming increasingly distant, about his outings. He first meets a woman who is in the starting process of a divorce, but she tells him she did not know his father. Further encounters continue to be fruitless, but he meets a variety of people, photographing and recording notes on each one in a scrapbook. One day, the boy ventures into his grandmother's apartment, but instead of finding her there, encounters the reclusive elderly renter that has been living there, whom his grandmother had warned him to avoid. The renter does not speak, communicating instead with words tattooed on his hands and a writing pad. The boy confides in him, and the man offers to accompany him on his outings. As they explore the city together, the boy learns to face his fears, such as those of public transport and bridges. Eventually, he concludes that the stranger is his grandfather. The boy plays the increasingly desperate answering machine recordings for him, but the man becomes agitated. He refuses to listen to the final one, and tells the boy to stop his search. Later, the boy sees him arguing with his grandmother and packing to leave, so angrily tries to confront him as his taxi pulls away, saying he knows he is his long-estranged grandfather. The boy then notices a phone number for an estate sale circled on the back of a newspaper clipping of his father's. When he dials the number, he reaches a surprised woman, who takes him to meet her ex-husband. The ex-husband realizes that the boy's key is the one he has been looking for, which had been left to him in the vase by his own now deceased father, unbeknownst to him when he gave away the vase to the boy's father at the estate sale. The boy confides to the man that on the day of the attacks, he was home when the phone rang a sixth time, but was too afraid to answer. After witnessing the tower collapse on TV as the phone call cut off, he bought a replacement answering machine so his mother would never find out. He leaves the key with the man, but runs away from the woman, distraught. Back in his room, the boy proceeds to destroy the material from his search, until his mother reveals to him that she had been aware of all his outings, and had gone ahead of him to meet all the people to prepare them for his visit. Finally realizing how much his mother cares about him, he accepts his father's death and writes letters to all the people he met to thank them for their kindness. This includes his grandfather, who he asks to return home, which he does, to live with his grandmother. The boy gives his mother his scrapbook from his adventures filled with pop-ups and pull tabs. Soon after, he visits a spot in a public park he and his father frequented, and looking underneath his father's favorite swing, finds a message from his father. He congratulates him for finishing what would have been their final expedition, giving the boy the closure he desperately needed."
}