{
  "obfuscated_plot": "A bay horse is born in a rural region in the early 20th century. A farmer outbids his landlord for the colt at auction, to the dismay of his wife who wanted a working horse that can plough. Their son, with his best friend, names the colt and teaches him to come when he imitates an owl's call. The horse and boy, now closely bonded, plough a rocky field, permitting the planting of crops and saving the family's farm. The mother shows her son his father's war medals and gives him his father's regimental pennant, confiding that his father carries physical and mental scars from a previous war. When war with a rival nation is declared, heavy rain ruins the family's crops, forcing the father to sell the horse to an army officer, who promises to look after the horse. The son is too young to enlist and ties the pennant to the horse's bridle, promising to eventually find him. The horse bonds with another stallion and is trained for military service. They are deployed to a battlefield and lead a cavalry charge through an enemy encampment. The officer and most of the cavalrymen are killed, and the enemy captures the horses. A young soldier grooms the horses. When his younger brother is sent to the front lines, the soldier deserts with his brother on the horses. The enemy army captures the boys and executes them, leaving the horses unattended. They are found by a young girl, and she hides them from enemy soldiers in her bedroom on her grandfather's farm. The grandfather allows her to ride the horse for her birthday, but they are discovered and captured by the enemy soldiers. By the war's later years, the son has enlisted and is fighting alongside his friend where his friend is killed and he is temporarily blinded by an exploding gas bomb. The enemy uses the horses to haul artillery. One horse succumbs to exhaustion and dies. Devastated, a soldier frees the remaining horse, who gallops into the battlefield and becomes entangled in barbed wire. A soldier from one side and a soldier from the enemy side work together to rescue the horse. They flip a coin for ownership, and the first soldier guides the injured horse to his lines. The son hears about the horse's rescue while recuperating. Just as the horse is about to be put down, he hears the son's owl call. The son, with bandaged eyes, is able to describe the horse in perfect detail, and they are reunited. The horse is nursed back to health. After the war ends, the horse is put up for auction. The son's comrades raise money to bid against a butcher. The grandfather of the girl who once cared for the horse wins the auction, implying she has died. After the son pleads, the old man recognizes their bond and returns the horse and pennant. The son returns to his family's farm, embracing his mother and returning the pennant to his father, who extends his hand with pride as the horse watches."
}