{
  "obfuscated_plot": "In the late 1920s, a famous silent film star is posing for pictures outside the premiere of his latest hit film when a young woman accidentally bumps into him. The star reacts with humor and shows off with the woman for the cameras. The next day, the woman is on the front page of a trade magazine with a headline about her. She capitalizes by auditioning as a dancer and is spotted by the star, who insists that she have a part in a major film studio's next production, despite objections from the studio boss. While performing a scene in which they dance together, the star and the woman show great chemistry. With a little guidance from the star, who draws a beauty mark on her cheek, the woman rises through the industry, earning more prominent starring roles.\n\nTwo years later, the studio boss announces plans to cease production of silent films, but the star is dismissive, insisting that sound is just a fad. In a dream, he begins hearing sounds from his environment but cannot speak himself. He decides to leave the studio to produce, finance, and direct his own silent film. The film opens on the same day as the woman's new sound film and a major economic crash. The star's only chance of avoiding bankruptcy is for his film to be a hit. Unfortunately, audiences flock to the woman's film instead, while only a few people attend his.\n\nWith the star ruined, his wife kicks him out, and he moves into an apartment with his loyal servant and his dog. The woman quickly becomes the first of several major new sound film stars. Later, the bankrupt star is forced to auction his personal effects. Depressed and drunk, he sets fire to a stack of his old films. As the film blazes out of control, he is overwhelmed by the smoke and passes out inside the burning house. His dog attracts the help of a nearby policeman, and after being rescued, the star is hospitalized.\n\nThe woman visits the hospital and discovers the film he rescued is the one with them dancing together. She asks for him to be moved to her house to recuperate. The star awakens to find his former servant now working for the woman. She insists to the studio boss that the star co-star in her next film, threatening to quit if he does not agree.\n\nEventually, the woman persuades the studio boss to let her make a musical production so the star can avoid the humiliation of having to speak. The film ends with a dance scene featuring the two, and in his only audible line, the star speaks with a distinctive accent, revealing his voice to the world."
}