{
  "obfuscated_plot": "After eight months' treatment in a mental health facility for bipolar disorder, a young man is released into the care of his parents at his childhood home in a suburban neighborhood. His primary focus is to reconcile with his ex-wife. She has moved away and obtained a restraining order against him after he found her in a compromising situation with another man and badly beat him. His therapist tries to convince him to keep taking his medication because a repeat of his violent outbursts might send him back to the clinic. The man tells him that he has a new outlook on life: He attempts to see the good, or silver linings, in all that he experiences. Meanwhile, he experiences a series of anxiety attacks. He attends dinner at his best friend's house, where his friend's sister-in-law, a widow with an unnamed disorder, is also a guest. They connect, talking about different psychiatric medications they have taken to manage their mental illnesses. She tries to offer him casual sex, but he is focused on getting his ex-wife back. Trying to get closer to him, she offers to deliver a letter to his ex-wife if, in return, he partners with her in an upcoming dance competition. Convinced that helping her will show his ex-wife he has changed and has developed sensitivity to others, he agrees. They start practicing over the following weeks. Hoping to open a restaurant, his father has resorted to illegal bookmaking. Having bet most of his money on a football game, his father asks him to attend for good luck, irrationally believing his attention to the game affects its outcome. The man points out this is OCD ideation but appeases his father. He asks his dance partner for time off from practice to attend the game. She gives him a typed reply from his ex-wife, which cautiously hints they may be able to reconcile. Before entering the stadium, he and his brother get into a fight with racist fans and are arrested. The team loses the game, and his father is furious. When his father claims that the team lost because of his dance partner's newfound involvement in his life, she refutes his allegations by pointing out that the local sports teams had done better whenever they were together. Convinced, his father makes a parlay with his friend: If the team wins their game and they score five out of ten in their dance competition, he will win back double the money he lost on the first bet. The man is reluctant, but his dance partner, mother, and father conspire to persuade him to dance in the competition, telling him his ex-wife will be there. Noticing that the letter includes a phrase frequently used by his dance partner, he realizes that she fabricated the letter. They, along with their friends and family, arrive at the competition on the night of the football game. His dance partner despairs when she sees his ex-wife in the audience, invited by their friends who want her to lift the restraining order. She starts to drink heavily at the bar. The man finds her moments before their turn and drags her onto the dance floor. They begin their routine as the team defeats their opponents. After their set, they receive an average score of exactly 5.0 points amid cheers from friends and family and confused looks from the crowd. The man approaches his ex-wife and whispers into her ear. Seeing this, his dance partner runs off. His father tells him that unlike his ex-wife, his dance partner really loves him, and he should not let her go. He catches her and hands her a letter in which he admits to knowing she forged the previous letter. He confesses that he loved her from the moment they became acquainted, but that it took him a long time to realize and accept it. They share a kiss. His father opens a restaurant with the money he has won, and they begin a relationship, no longer wearing their wedding rings."
}