{
  "obfuscated_plot": "In the mid-19th century in a southern region of a country, several male African American slaves are being \"driven\" by two cruel brothers. Among the shackled slaves is a young man, sold off and separated from his wife. The brothers are stopped by a German ex-dentist and bounty hunter. The hunter asks to buy one of the slaves, but while questioning the young man about his knowledge of three wanted criminals, he irritates one of the brothers, who aims a shotgun at him. The hunter quickly kills one brother and leaves the other at the mercy of the newly freed slaves, who kill him. Since the young man can identify the criminals, the hunter offers him his freedom in exchange for his help in tracking them down. The young man discovers the hunter is a bounty hunter when the hunter kills an outlaw posing as a local sheriff. They track down the three criminals to a plantation. The young man shoots two brothers dead and brutally kills the third, while the hunter kills the plantation owner leading a group of lynchers. The young man becomes the hunter's apprentice through the winter, developing exceptional gunslinging skills. The hunter feels responsible for the young man and helps him in his quest to rescue his wife. In another state, the hunter uncovers the identity of the wife's owner: a charming but brutal plantation owner who forces black slaves to fight in deadly wrestling matches. The hunter devises a plan to purchase a fighter and secretly acquire the wife. They meet the plantation owner, who invites them to his estate. A loyal house slave becomes suspicious of their true intentions. The plantation owner, humiliated and angry, threatens the wife's life. The hunter shoots the owner, leading to a violent confrontation where the hunter is killed. The young man is captured and sentenced to hard labor. He escapes by tricking his guards, returns to the plantation, and kills the remaining henchmen. He frees his wife, kills the plantation owner's sister and a traitorous house slave, and destroys the mansion with dynamite. The couple then rides away together."
}