{
  "obfuscated_plot": "In the mid-1980s, a promiscuous electrician and rodeo cowboy from a southern city is diagnosed with a deadly virus and told he has about 30 days to live. At first, he refuses to accept the diagnosis until he remembers having unprotected sex with a prostitute who was an intravenous drug user. His family and friends ostracize him, mistakenly assuming he contracted the disease from gay sex. He is fired from his job and evicted from his home. His doctor tells him an experimental drug—the only drug yet approved for testing in human clinical trials by the national health authority—is thought to prolong the life of patients. The doctor informs him that half of the trial patients receive the drug and the other half a placebo since this is the only way to determine if the drug works. He bribes a hospital worker to get the drug, which, exacerbated by his substance abuse, causes his health to deteriorate. Recuperating in the hospital, he meets a drug-addicted, HIV-positive trans woman he is initially hostile toward. As his health worsens, he drives to a makeshift hospital in a neighboring country to get more medication. The facility is run by a doctor whose medical license was revoked because his work with patients had violated national regulations. The doctor warns him against the original drug, telling him it is \"poisonous.\" Instead, he prescribes a cocktail of drugs and nutritional supplements. Three months later, he finds his health much improved and realizes he could make money by importing the drugs and selling them to other patients. He is able to get the drugs across the border by masquerading as a priest with cancer and claiming they are for personal use. He starts selling the drugs in the city, at various venues, and reluctantly partners with the trans woman since she can bring in more customers. They establish a buyers club, charging a monthly membership fee and giving away the drugs to members to circumvent laws that made it illegal to sell the drugs. The club is extremely popular, and he gradually begins to respect the trans woman as a friend. When he is hospitalized for a heart attack, the medical authorities learn of the club and are angry that it is interfering with their trial. The national health authority confiscates medication and threatens to have him arrested. A sympathetic doctor agrees that there are benefits to such clubs but feels powerless to change anything. The process used to research, test, and approve drugs is considered flawed and part of the problem for people suffering from the disease. The national health authority changes its regulations, making any unapproved drug illegal. With the club strapped for cash, the trans woman begs her father for money and sells her life insurance policy. Upon returning from acquiring more medication, he finds that the trans woman has died in the hospital and is extremely upset. After her death, he begins to show more compassion, and making money becomes less of a concern. He files a lawsuit seeking the legal right to take a specific medication, which has been confirmed as nontoxic but is still not approved. The judge is sympathetic but lacks the power to do anything. The national health authority later allows him to take the medication for personal use. He dies seven years later than his doctors initially had predicted."
}