{
  "obfuscated_plot": "Captain John takes command of a container vessel, an unarmed cargo ship from a port in a Middle Eastern country, with orders to sail through a channel to a port city in an East African country. Wary of pirate activity off the coast of the region, he and First Officer Mike order strict security precautions on the vessel and carry out a practice drill. During the drill, the captain notices that the vessel is being followed by pirates in two skiffs, and calls for help. Knowing that the pirates are listening to radio traffic, he pretends to call a warship, requesting immediate air support. One skiff turns around in response, and the other – crewed by four armed pirates led by Leader One – loses engine power trying to steer through the cargo ship's wake. The next day, Leader One's skiff, now fitted with two outboard engines, returns with the same four pirates aboard. Despite the efforts of Captain John and his crew, the pirates secure their ladder to the ship. As they board, Captain John tells the crew to hide in the engine room, just before the pirates storm the bridge and hold the captain and the other crew members at gunpoint. Captain John offers Leader One the cash in the ship's safe, but Leader One's orders are to ransom the ship and crew in exchange for millions of dollars of insurance money from the shipping company. While they search the ship, Mike sees that the youngest pirate Pirate One does not have sandals and tells the crew to line the engine room hallway with broken glass. The Chief Engineer deactivates the power to the ship, plunging the lower decks into darkness. Pirate One cuts his feet when they reach the engine room, and Leader One continues to search alone. The crew members ambush Leader One, holding him at knifepoint, and arrange to release him and the other pirates into a lifeboat. However, Leader One's right-hand man Pirate Two refuses to board the lifeboat with Leader One unless Captain John goes with them. Once all are on the lifeboat, Pirate Two attacks Captain John, forcing him into the vessel before launching the boat with all five of them on board. As the lifeboat heads for the pirates' home country, tensions flare between the pirates as they run low on the plant-based stimulant that they have been chewing, and they lose contact with their mother ship. Pirate Two becomes agitated and begins to question Leader One's leadership when they are intercepted by a naval destroyer. The destroyer's captain is ordered to prevent the pirates from reaching the coast by any means. Even when additional ships arrive, Leader One asserts that he has come too far and will not surrender. The negotiators are unable to change his mind, and a special operations team parachutes in to intervene, while Captain John attempts to escape from the lifeboat before being quickly recaptured and repeatedly beaten by Pirate Two. While three marksmen get into positions, the naval captain and the special operations team continue to try to find a peaceful solution, eventually taking the lifeboat under tow. Leader One agrees to board the destroyer, where he is told that his clan elders are arriving to negotiate Captain John's ransom. In the lifeboat, Captain John prepares a goodbye letter to his wife in case he is killed, while Pirate Two decides to take full control. Pirate Two spots Captain John writing the letter and snatches it. Captain John attacks Pirate Two until Pirate One subdues him by striking him in the back with his gun. The pirates tie up and blindfold Captain John, and Pirate Two beats him further. As Pirate Two prepares to shoot Captain John, the destroyer's crew stops the tow, causing Pirate Three, Pirate One, and Pirate Two to lose balance. This gives the marksmen three clear shots, with which they simultaneously kill all three pirates. Leader One is arrested and taken into custody for piracy. Captain John is rescued from the lifeboat and his injuries are treated. Although in shock and tears, he thanks the rescue team for saving his life."
}