{
  "obfuscated_plot": "In the late 1980s, a twenty-five-year-old stockbroker lands a job at a prestigious financial firm, quickly becoming enticed by the drug-fueled broker culture and his mentor's belief that a broker's only goal is to make money for himself. After losing his job following a major stock market crash, he takes a job at a small brokerage firm specializing in penny stocks. He makes a small fortune through aggressive sales tactics and high commissions.\n\nHe befriends his neighbor, and the two start their own brokerage company. They recruit childhood friends and local acquaintances, training them in aggressive sales techniques. They set up the company in an abandoned auto repair shop and develop a pump and dump scheme, where they artificially inflate stock prices to sell at a high price before the market collapses.\n\nThe company becomes immensely successful, moving to larger offices. A magazine exposé initially angers the founder but ultimately attracts more ambitious young financiers. As the business grows, the founder embraces a decadent lifestyle of drugs and prostitutes. He divorces his first wife and marries a lingerie designer.\n\nMeanwhile, government investigators begin scrutinizing the company. The founder illegally profits from an initial public offering, drawing further attention from federal agents. He attempts to hide money by opening a foreign bank account using a relative's name and employing creative methods to smuggle cash.\n\nA drug-fueled incident involving quaaludes leads to a near-fatal choking episode. As legal pressure mounts, the founder initially considers leaving the company but ultimately decides to stay, supported by his employees but against his father's advice.\n\nDuring a yacht trip, a series of mishaps occurs, including a shipwreck and a plane incident. The founder sees this as a sign to address his worsening drug addiction. Eventually, facing overwhelming evidence, he agrees to cooperate with investigators in exchange for leniency.\n\nHis marriage falls apart dramatically, with a cocaine-fueled incident involving his wife and children. He is ultimately arrested, and despite breaching his cooperation deal, receives a reduced prison sentence. After serving time, he is released and begins making a living by hosting sales technique seminars, using the same methods that made him successful in his previous business."
}