{
  "obfuscated_plot": "In 1978, two con artists work together. The woman, posing as a foreign aristocrat, has improved their scams. The man loves her but is unwilling to leave his unstable, dramatic wife, fearing he will lose contact with his adopted son. His wife has threatened to report him to the police if he leaves her. A federal agent catches the con artists in a loan scam but offers to release them if they help him make four additional arrests. The agent believes the woman is from abroad but has proof her claim is fraudulent. An associate suggests the con artists use a fake wealthy foreign investor to connect with a local mayor trying to revitalize gambling in a struggling coastal city. The mayor seems to have a genuine desire to help his area's economy. The federal agent devises a sting operation targeting the mayor, despite objections from his colleagues. The con artists help manipulate a government secretary into making an unauthorized money transfer. When the agent's boss hears of the operation, he praises the agent's initiative. The mayor becomes suspicious but is convinced the foreign investor is legitimate, and he and the main con artist become friends. The agent arranges a meeting with the fake investor, using an undercover agent as the sheikh. At a casino party, the con artist is surprised to meet a powerful organized crime boss who wants to verify the investor's legitimacy. The crime boss requires a large money transfer and citizenship processing. The agent becomes romantically interested in the female con artist but becomes confused when she drops her fake accent. The con artist's wife starts an affair with a mobster, threatening her husband's plans. With the mayor's help, the agent and con artist videotape government officials accepting bribes. Eventually, it is revealed that the entire scenario was a complex con orchestrated by the con artists to help the mayor while securing their own immunity. The government officials are prosecuted, the mayor receives a short prison sentence, and the con artists start a legitimate business together."
}