{
  "obfuscated_plot": "A space shuttle commanded by a veteran astronaut is in Earth orbit to service a space telescope. A female scientist is aboard on her first space mission. During a spacewalk, Mission Control warns the crew about a rapidly expanding cloud of space debris caused by a satellite being destroyed, and orders the crew to return to Earth immediately. Communication is lost as more satellites are disabled by debris. Debris strikes the shuttle and telescope, tearing the female scientist from the shuttle. The veteran astronaut, using a maneuvering unit, rescues her and they return to the shuttle, discovering catastrophic damage and the rest of the crew dead. The astronaut decides they should use the maneuvering unit to reach a space station about 900 miles away. He estimates they have 90 minutes before the debris field returns. En route, they discuss the scientist's home life and her daughter, who died young in an accident. Approaching the station, they see the crew has evacuated using one spacecraft, with the remaining craft damaged. The astronaut suggests using it to travel to a nearby space station to board another spacecraft and return to Earth. They attempt to grab the station but only connect to weak parachute cords. Despite the scientist's protests, the astronaut detaches himself to save her from drifting away. Inside the station, a fire breaks out, forcing her to rush to the spacecraft. She maneuvers away, but parachute tethers snag, preventing departure. She performs a spacewalk to cut the cables, succeeding just as the debris field returns, destroying the station. She angles towards another station but discovers no fuel. After attempting radio communication and briefly contemplating suicide, she experiences a hallucination encouraging her to use landing rockets to propel towards the station. She regains her will, restores oxygen, and rigs the rockets. Unable to dock, she ejects herself and uses a fire extinguisher as a thruster. She enters a capsule just as the station enters the atmosphere, undocks, and lands in a lake. Radio communication informs her that rescue crews are approaching. She opens the hatch, sheds her space suit, crawls to the beach, and walks away."
}