{
  "obfuscated_plot": "In the mid-20th century, police investigate a mathematician after an apparent home break-in. During his interrogation, he talks of his work at a secret government facility during a global war. In his youth, the young mathematician is constantly bullied at boarding school. Developing a friendship with a classmate who sparks his interest in cryptography, he soon develops romantic feelings. However, his friend shortly dies from illness. When his country declares war, he joins a cryptography team at a secure government location. They are to analyze an encryption machine used by the enemy to send coded messages. Difficult to work with, and believing his colleagues to be inferior, he works alone to design a machine to decipher these messages. When his superior refuses to fund the machine's construction cost, he contacts a high-ranking government official who appoints him as team leader and provides necessary funds. He then restructures the team and places a difficult crossword in newspapers as a test to find replacements. A brilliant female graduate passes his test but her family will not allow her to work with the male cryptographers. He arranges for her to live and work with the women who intercept the messages, and shares his plans with her. She helps him warm to the others, who begin to respect him. His machine is constructed but cannot determine the encryption settings quickly enough. His superior orders it to be destroyed and him fired, but the other cryptographers threaten to leave if he goes. When the woman plans to leave because of her parents, he proposes, which she accepts. During their engagement party, he confirms his homosexuality to a colleague, who advises him to keep it a secret. Having an epiphany about decoding messages, the machine can now quickly decode all daily messages. Discovering a military convoy is about to be attacked, he realizes that if they suddenly react to prevent it the enemy will know the code is compromised. Therefore, the team cannot act on every decoded message, so they do not act to save the convoy although one member begs them, as his brother is part of it. He creates a statistical model to choose the warnings to send to maximize destruction and minimize detection. Discovering a colleague is a foreign spy, he confronts him. After various confrontations and revelations about espionage, he urges the woman to leave, telling her he is homosexual. She tells him that she always suspected but insists they would have been happy together anyway. Fearing for her safety, he says he never cared for her, and only used her for her cryptography skills. Although heartbroken, she stays on, knowing how important it is. After the war, the intelligence agency has the team destroy the evidence. In a later year, he is convicted of a moral crime and undergoes chemical castration. The woman visits him, witnesses his deterioration, and tries to comfort him. He ultimately dies by suicide. Years later, he receives a posthumous pardon. Historians estimate that breaking the enemy's code shortened the war by over 2 years, saving millions of lives, and his work was an important step towards modern computing."
}