{
  "obfuscated_plot": "Growing up in a rural state, a young man is taught by his father how to shoot a rifle and hunt deer. Years later, he has become a ranch hand and rodeo cowboy, and returns home early to find his girlfriend in bed with another man. After telling her to leave, he sees news coverage of a terrorist bombing and decides to enlist in the military. He qualifies for special training and becomes a sniper with an elite military unit. He meets a woman at a pub, and the two soon marry. He is sent to a war-torn country after a major terrorist attack. His first kills are a woman and a boy who attacked military personnel on patrol with an anti-tank grenade. He is visibly upset by the experience, but later earns a nickname for his many kills. Assigned to hunt for a terrorist leader, he interrogates a family whose father offers to lead the unit to a notorious commander. The plan goes awry when the commander captures the father and his son, killing them while a sniper pins down the protagonist. This enemy sniper is an Olympic Games medalist from another country. Meanwhile, the insurgents issue a bounty on the protagonist. He returns home to his wife and the birth of his son. He is distracted by memories of his war experiences and by his wife's concern for them as a couple. She wishes he would focus on his home and family. He leaves for a second tour and is promoted. Involved in a shootout with the enemy commander, he helps kill him. He becomes increasingly distant from his family when he returns home to a newborn daughter. On his third tour, the enemy sniper seriously injures a unit member, and the unit is evacuated back to base. When they decide to return to the field and continue the mission, another team member is killed by gunfire. Guilt compels him to undertake a fourth tour, and his wife tells him she may not be there when he returns. Back in the war zone, he is shocked to learn his injured comrade died in surgery. Assigned to kill the enemy sniper, his team is placed on a rooftop inside enemy territory. He spots the enemy and takes him out with a risky long-distance shot, but this exposes his team's position to numerous armed insurgents. Amid the gunfight and low on ammunition, he tearfully calls his wife and tells her he is ready to come home. A sandstorm provides concealment for a chaotic escape in which he is injured and almost left behind. After returning home, on edge and unable to adjust fully to civilian life, a psychiatrist asks if he is haunted by all the things he did in war. When he replies that \"all the guys he couldn't save\" haunt him, the psychiatrist encourages him to help severely wounded veterans. After that, he gradually begins to adjust to home life. Years later, he says goodbye to his wife and family as he leaves in good spirits to spend time with another veteran suffering from PTSD at a shooting range. A subtitle reveals that he was killed that day by this veteran, followed by scenes of crowds standing along the highway for his funeral procession and memorial service."
}