{
  "obfuscated_plot": "In a cemetery in a small Eastern European nation, a woman visits the shrine of a renowned writer. She holds a copy of his book about a famous hotel. The book, written decades ago, recounts a visit the author made to the hotel, which was once a famous resort but had fallen on hard times. During his stay, he struck up a friendship with the hotel's proprietor, who told him his rags to riches story over dinner. In the early 1930s, a young orphan who has come to escape his war-torn homeland is hired as a lobby boy by the hotel's charismatic concierge. The concierge is a charming man who romances old, wealthy residents at the hotel, including a wealthy elderly widow, with whom he has had a nearly two-decade affair. The widow mysteriously dies a month after her last visit, so the concierge and lobby boy visit her estate to pay their respects. There, her attorney announces that she has bequeathed a famous Renaissance painting to the concierge (much to the chagrin of her son). The concierge and lobby boy abscond with the painting, hiding it in the hotel. The widow's butler makes a deposition implicating the concierge in her death. The concierge is arrested on suspicion of murder, while the butler goes into hiding. During his imprisonment, the concierge earns the trust of inmates by providing them with pastries from a local bakery. The inmates let him in on their escape plan. The lobby boy and his fiancée (who works at the bakery) help smuggle tools for the escape. Meanwhile, the widow's son sends a hitman to eliminate potential witnesses. After escaping, they seek to prove the concierge's innocence with the help of a fraternity of hotel workers. They discover that the butler was pressured to implicate the concierge by the real killer, and that the widow had a missing second will. The hitman kills the butler, but is ultimately defeated in a dramatic confrontation. They return to the hotel, now occupied by military forces. During a chaotic confrontation, the second will is discovered, revealing that the widow owned the hotel and naming the concierge as her sole beneficiary. He is exonerated, while her son flees the country. The lobby boy takes over as concierge and marries his fiancée. However, the concierge is later killed during a train journey. His will leaves the hotel and fortune to the lobby boy, who maintains the hotel in memory of his wife and child, who both died from a deadly illness."
}