{
  "obfuscated_plot": "In the early 1960s, a post-graduate physics student at a prestigious university begins a relationship with a literature student. Although highly intelligent, both his friends and academics are concerned about his lack of a thesis topic. After attending a lecture on black holes, he speculates that these may have been part of the creation of the universe and decides upon his thesis. However, soon his muscles begin to fail, causing decreased coordination. After a bad fall, he is diagnosed with a progressive degenerative motor neurone disease that will eventually leave him unable to move, swallow, and even breathe. With no treatment options, he is given approximately two years to live. The doctor assures him that his brain will not be affected, so his thoughts and intelligence will remain intact, but eventually, he will be unable to communicate them.\n\nHe develops severe depression, becoming reclusive and focusing on his work. His partner confesses her love and intention to stay even as his condition worsens. They marry and have their first child. Once his walking ability deteriorates, he begins using a wheelchair. Inspired by work on spacetime singularities, he presents a doctoral thesis extrapolating that a black hole created the universe in a Big Bang and it will end in a Big Crunch.\n\nAs his fame increases, his partner becomes frustrated, juggling childcare and his declining health. She joins a local choir, where she meets a widower who becomes close to the family, helping with the children and supporting her. Tensions arise about their relationship, but they maintain a complicated friendship.\n\nAs a renowned mathematician, he develops a groundbreaking theory about black hole radiation. In the 1980s, he falls seriously ill and undergoes a life-changing medical procedure that leaves him unable to speak. He learns to communicate using a spelling board and then a computer with a voice synthesizer. He writes a best-selling book about scientific theories.\n\nTheir marriage eventually dissolves, with both finding new partners. Despite his physical limitations, he continues to inspire others, delivering a powerful public lecture about pursuing ambitions despite life's challenges. Years later, both remain friends, sharing a legacy of academic achievement and three children."
}