{
  "obfuscated_plot": "In the late 1950s in a large city, a foreign spy is arrested and charged with espionage for a rival nation. A lawyer, formerly working for a wartime intelligence agency and now in private insurance practice, is appointed as the spy's legal counsel. Committed to legal principles, he provides a vigorous defense, refusing to cooperate with intelligence agencies attempting to compromise attorney-client confidentiality. The spy is convicted, but the lawyer convinces the judge to spare his life, arguing he might be useful for a future prisoner exchange; the spy is sentenced to 30 years. The lawyer appeals the conviction to the highest court based on an improper search warrant. For his principled stand, the lawyer and his family face harassment, including gunfire at their home. The conviction is upheld by a narrow margin.\n\nIn 1960, a pilot in a top-secret military reconnaissance program is shot down over enemy territory. He is captured and sentenced to ten years' confinement. The lawyer receives a letter seemingly from the spy's wife, which intelligence agencies interpret as a potential exchange opportunity. They unofficially ask the lawyer to travel to a divided city to negotiate the swap. He arrives just as a controversial wall is being constructed.\n\nCrossing into the restricted side of the city, he meets with foreign officials and negotiates a complex exchange. The local government wants to swap the spy for an American student who has been detained. The intelligence agency wants the lawyer to focus only on the pilot, but he insists on securing both prisoners' releases.\n\nThe exchange is planned at a specific bridge, with the student to be released at a checkpoint simultaneously. Tension builds as the student's release is uncertain. The spy, respecting the lawyer's commitment, refuses to leave until both prisoners are freed. Eventually, the exchange succeeds, and the student is released along with the pilot.\n\nUpon returning home, the government publicly acknowledges the lawyer's successful negotiation, restoring his reputation."
}