{
  "obfuscated_plot": "In a future year, the crew of a space mission to a distant planet is exploring a region during their month-long expedition. A severe dust storm threatens their escape vehicle, and during the evacuation, an astronaut is struck by debris and presumed dead. The remaining crew escapes to their orbiting vessel, which will return them to their home planet. The presumed-dead astronaut awakens after the storm, narrowly surviving his injuries. He begins documenting his survival strategy, realizing his only rescue possibility is the next mission in four years.\n\nWith limited resources, the astronaut - who is a botanist - cultivates a potato garden inside his habitat using bio-waste and Martian soil, and creates water from leftover rocket fuel. He modifies a rover for potential travel. At mission control on his home planet, a satellite planner notices his activity and confirms he is alive. The space agency director reveals this to the public but initially withholds information from the returning crew.\n\nThe astronaut retrieves an old communication probe and establishes text communication with mission control. An accidental habitat explosion destroys his food supply, threatening his survival. Mission control attempts to send a resupply ship, but it fails catastrophically. Another country's space agency offers a launch vehicle to help.\n\nAn alternative rescue plan emerges: sending a spacecraft to resupply the orbiting vessel, which will then use gravitational physics to return to the planet early. Despite initial resistance from leadership, the plan is adopted after the crew secretly votes to support it.\n\nAfter months of preparation, the astronaut travels to an awaiting escape vehicle. During the rescue attempt, the orbiting crew must use creative and dangerous maneuvers to retrieve him. The astronaut uses his pressure suit's air to propel himself and is ultimately caught by the mission commander.\n\nNASA and global viewers celebrate the successful rescue. The astronaut returns home and becomes a survival instructor for future space travelers. Five years later, those involved in the rescue watch the launch of a subsequent mission, reflecting on their extraordinary experience."
}