{
  "obfuscated_plot": "In the mid-1970s, at a metropolitan police station, two law enforcement officers discuss the arrest of a religious official for child molestation. A high-ranking church leader talks to the mother of the victims, assuring her that the official will no longer work at her local parish and asking her to keep quiet for the sake of the institution. A prosecutor visits the precinct and tells the officers to keep the arrest secret from the press. The mother declines to press charges, and the official is quietly released.\n\nIn the early 2000s, a new managing editor arrives at a major metropolitan newspaper and meets the editor of the investigative reporting team. The editor is looking for ways to challenge the status quo, even if it means confronting the powerful local religious leadership. After reading an article about a lawyer alleging that a top church official knew about systemic child sexual abuse and did nothing to stop it, the editor urges the investigative team to investigate.\n\nThe journalists initially believe they are following the story of one abusive official but soon discover that many other religious leaders have been similarly reassigned, suggesting a widespread cover-up. With guidance from a victims' rights advocate, the team expands their investigation. A psychotherapist who previously treated abusive officials estimates that a significant percentage of local religious leaders are involved in abuse.\n\nThe investigation begins to take a personal toll on the reporters. One learns that the religious institution maintains a secret facility near his home to house abusive officials. Another struggles with her family's religious connections. The team feels pressure to publish quickly and accurately, while also facing pushback from influential community members.\n\nA national tragedy temporarily interrupts their work, but the investigation restarts when the lawyer reveals publicly available documents connecting the cover-up to top church leadership. The team is determined to expose the systematic protection of abusive officials.\n\nAfter obtaining legal permission to unseal additional documents, the team prepares to publish their story. The lead editor admits to previously receiving information about abusive officials but failing to investigate thoroughly. The managing editor supports the team's current investigation.\n\nWhen the story is published, it includes a hotline for victims and links to supporting documents. The next morning, the newsroom is flooded with calls from additional victims coming forward. An epilogue notes that the top church official resigned and was later promoted, and that similar scandals had been uncovered in numerous communities worldwide."
}