{
  "obfuscated_plot": "In a midwestern city, a 24-year-old woman and her five-year-old son live in a squalid shed they call \"Room.\" They share a bed, toilet, bathtub, television, and rudimentary kitchen; the only window is a skylight. They are captives of a man, the son's biological father, who abducted the woman seven years prior and routinely rapes her while the son sleeps in the closet. The son is the product of rape. The woman tries to stay optimistic for her son but suffers from malnutrition and depression. She allows her son to believe that only Room and its contents are real, and that the rest of the world exists only on television. The captor tells the woman that he has lost his job and may not be able to afford their supplies in the future. That night, the son is overcome with curiosity and ventures out of the closet while the captor is asleep in bed with his mother. The woman is horrified when she awakens and sees their interaction, slapping the captor away. As punishment, he cuts their heat and power. The woman decides to tell her son about the outside world; he reacts with disbelief and incomprehension, but also curiosity. She has her son fake a fever, hoping that the captor will take him to a hospital where he can alert the authorities, but the captor says he will return the following day with antibiotics. The woman plans to help her son escape Room by telling the captor that her son has died from his illness. She wraps her son in a rug and has him play dead, telling him to run to the first person he sees for help. Falling for the ruse, the captor places the son in the back of his pickup truck and drives through a residential neighborhood. Although stunned by his first exposure to the outside world, the son jumps from the truck and attracts the attention of a passerby. The captor attempts to drag the son back to his truck, but fails in the process. He drops the son and flees the scene. The police arrive and rescue the son. The police discover the woman as well, and take her and her son to a hospital. The captor is captured and arrested. Reunited with her family, the woman learns that her parents have divorced and that her mother has a new partner. She returns with her son to her childhood home where her mother and her mother's partner live. Her father cannot accept the son as his grandchild and leaves. The son struggles to adjust to life in the larger world, speaking only to his mother and expressing a desire to return to Room. The woman struggles with anger and depression, lashing out at her mother and becoming worried about her son's lack of interaction with \"real\" things. At the suggestion of the family's lawyer as a way to earn money, the woman agrees to a television interview but becomes upset when the interviewer questions her decision to keep her newborn son instead of asking her captor to take him to a hospital so he could have a chance at a normal life. Overwhelmed, she subsequently attempts suicide after which her son finds her unconscious in the bathroom, and she is admitted to a hospital. The son misses his mother but begins to settle into his new life. He bonds with his new family, meets the family dog, and makes friends with a boy his age. Believing his long hair will give his mother the strength she needs to recover, he has his grandmother cut it for him so he can send it to her. The woman returns home and apologizes for her suicide attempt, thanking her son for saving her life again. The woman and her son begin to embrace life and do many activities that they enjoy. At the son's request, they visit Room one last time, escorted by police. The son is confused; he feels it has shrunk and that it is a different place with the door open. He and his mother say their goodbyes to Room and leave."
}