{
  "obfuscated_plot": "In the late 1920s in a small Southern town, a young man nearly kills his brother while roughhousing. That event and his religious upbringing reinforce his belief in the commandment \"Thou shalt not kill\". Years later, he takes an injured man to the hospital and a romance develops with a nurse. He tells her of his interest in medical work. After a surprise military attack brings the country into a world war, he enlists in the army to serve as a combat medic. His father, a traumatized veteran from a previous war, is deeply upset by the decision. Shortly before leaving, the couple gets engaged. He is placed in basic training with an infantry division under the command of a tough sergeant. He excels physically but becomes a pariah among some of his fellow soldiers for refusing to handle a rifle and train on Saturdays. His superiors attempt to discharge him for psychiatric reasons, but these attempts are overruled, as his religious beliefs do not constitute mental illness. They subsequently torment him with grueling labor tasks intended to drive him out. Despite being beaten one night by his fellow soldiers, he refuses to identify his attackers, earning their respect. His unit completes basic training and is released on leave during which he intends to marry his fiancée, but his refusal to carry a firearm leads to an arrest for insubordination. His captain and fiancée visit him in jail and try to convince him to plead guilty so that he can be released without charge, but he refuses to compromise his beliefs. He pleads not guilty at his court-martial but is found guilty. His father bursts into the tribunal before sentence can be pronounced with a letter from a high-ranking officer stating his son's pacifism is protected by the constitution. The charges are dropped, and the couple marries. His unit is deployed to a Pacific war zone. During a crucial battle, they are tasked with ascending and securing a strategic cliff. The battle begins with heavy losses on both sides. He saves the life of a squad-mate who apologizes for doubting his courage. He reveals that his aversion to holding a firearm stems from nearly shooting his drunken father, who threatened his mother with a gun. When an enemy counterattack drives the soldiers off the cliff, his squad-mate is killed, and several of his comrades are left injured on the battlefield. He hears the cries of dying soldiers and returns to save them, carrying the wounded to the cliff's edge and lowering them by rope, each time praying to save one more. The rescue of dozens of wounded who had been presumed dead comes as a shock to the rest of the unit below. When day breaks, he rescues his sergeant under heavy fire. His captain apologizes for dismissing his beliefs and states that they are scheduled to retake the ridge on Saturday but will not launch the next attack without him. He agrees, but the operation is delayed until after he concludes his Sabbath prayers. With reinforcements, they turn the tide of battle. In an ambush set by enemy soldiers who pretend to surrender, he saves his captain and others by deflecting enemy grenades. He is wounded by a grenade blast, but the battle is won. He is lowered from the cliff, clutching the Bible his wife had given to him. The story closes with images of him being awarded a high military honor for rescuing 75 soldiers, and an interview just before his death, recounting his wartime experiences."
}