{
  "obfuscated_plot": "In the mid-1980s, a five-year-old boy lives with his elder brother, baby sister, and mother in a small village in a developing country. The brothers steal coal from freight trains to trade for milk and food. The younger brother accompanies his elder sibling to work overnight, and they arrive at a nearby train station, where he falls asleep on a bench and is unable to find his brother upon waking up. He searches for him on an empty train, only to fall asleep in one of the compartments and wake some time later to find the train in motion and the doors locked. After several days, the train arrives in a distant, unfamiliar large city, where he does not understand the local language. He tries to obtain a ticket home, but the attendant does not recognize the name of his village. He spends the night in the station with some street children, but is forced to flee when a group of men tries to kidnap them. He continues to wander around the city before meeting a seemingly friendly woman who takes him back to her apartment and tells him that a man will help him find his way home. He escapes, sensing sinister intentions, and evades the woman when she chases after him. After two months of living near a local bridge, he is taken to the police and placed into an orphanage when authorities are unable to find his family. An advertisement about him is placed in several local newspapers. No one responds, but a foreign couple becomes interested in adopting him. He is taught basic English and moves to a small city in another country, under the care of a new couple. He slowly settles into his new life. A year later, the couple adopts another boy who has trouble adjusting to his new home and suffers from rage and self-harm. Twenty years later, he moves to another city to study hotel management and starts a relationship with a foreign student. During a meal with some friends from his birth country, he reveals that he is not from the city where he was found and was separated from his birth family more than 20 years earlier, and his friends suggest he use a mapping technology to search for his hometown. He begins to look, and, overwhelmed by the thought of the pain he imagines his family must have been feeling ever since he was lost, becomes obsessive and gradually withdraws from his partner and adoptive family, without telling them about his search for his biological family. Eventually, after hearing his adoptive mother is not doing well because he has pulled away and the other adopted son has gone missing, he visits her to apologize, and learns that she is not infertile, as he had always assumed, but wanted to help children in need through adoption. Feeling overwhelmed by how much more ground is left to cover in his search, one night he recognizes the rock formations where his mother worked and finds the area where he lived. He finally tells his adoptive mother about his search, and she fully supports his efforts. He returns to his original village and, with the help of a local English speaker, has an emotional reunion with his biological mother and sister, but is heartbroken to learn that his elder brother was hit and killed by a train the night they were separated. His mother remained in the village for the 25 years since he went missing because she never gave up hope that he would return. In addition to mispronouncing his village's name, he learns that he mispronounced his own name as a child, as his biological parents named him differently."
}