{
  "obfuscated_plot": "A talented woman works at a research center in a southeastern state during the early 1960s, alongside her colleagues, performing mathematical calculations as low-ranking computational workers. All are African-American women in a racially and sexually segregated workplace. Her white supervisor assigns her to a space research team due to her exceptional analytical skills. She becomes the first Black woman on the team, facing initial resistance from the head engineer.\n\nAnother colleague joins the space capsule design team and identifies a critical design flaw. Encouraged by a team leader, she applies for an engineering position but is told she needs additional educational credentials. After successfully petitioning a local court, she gains permission to attend night classes at a previously all-white school.\n\nThe woman meets a military officer who initially doubts women's mathematical abilities but later becomes her romantic partner. During this period, a group of renowned astronauts visits the research center, with one astronaut specifically acknowledging the computational workers.\n\nThe woman impresses her supervisor by solving a complex mathematical equation under intense Cold War-era pressure to advance space exploration. When confronted about her frequent work breaks, she reveals the discriminatory bathroom policies, which prompts her supervisor to eliminate segregated facilities and include her in high-level meetings.\n\nDespite facing institutional barriers, she continues her critical computational work. A colleague learns computer programming to protect her team's jobs as electronic computing technology emerges. She successfully operates a new computing machine and negotiates a group transfer for her coworkers.\n\nDuring a crucial space mission, discrepancies in electronic calculations require her manual verification. Her calculations prove critical in ensuring the spacecraft's safe return. She supports a strategic decision to keep a rocket attachment to stabilize the heat shield, ultimately contributing to a successful mission.\n\nAn epilogue reveals that she and her colleagues broke significant racial and gender barriers, becoming the first African-American women to achieve remarkable professional milestones in the space program, with her calculations being instrumental in multiple historic space missions."
}