{
  "obfuscated_plot": "A depressed and asocial maintenance worker who lives alone in a basement apartment in a small coastal town goes to a bar, ignores a woman's obvious request for casual sex, and gets into a fistfight with two men. One day, he receives a phone call informing him that his brother, a fisherman, has suffered cardiac arrest; the brother dies before he can reach the hospital. He insists on being the one to tell his brother's teenage son about his death. While making funeral arrangements, they are reminded the body cannot be buried until spring as the ground is frozen. The maintenance worker makes plans to remain in town, living in his brother's house until the delayed burial. When he meets with his brother's attorney, he is shocked to discover his brother has named him the teenager's legal guardian.\n\nFlashbacks reveal that he once lived in the same town with his then-wife and their three children. One night after hosting a raucous party, an intoxicated maintenance worker forgot to put the screen in front of the fireplace, leading to a house fire that killed his children. No criminal charges were filed, as the police ruled it a tragic accident. However, at the station, a guilt-ridden maintenance worker stole an officer's gun and attempted suicide, before being subdued. He and his wife subsequently divorced, and he left town. He is reluctant to commit to the guardianship, as it would require him to move back to the town.\n\nPlans are begun for the teenager to move to a larger city with the maintenance worker, but the teenager has strong ties to the local community and stubbornly objects. The maintenance worker commits to staying until the end of the school year. The teenager wants to live with his estranged mother, who still lives in the area. The maintenance worker is opposed to this due to her history with alcoholism, but the teenager decides to reconnect with her over lunch.\n\nThe mother has committed to Christianity and sobriety with her fiancé, but during an awkward meal, the teenager finds he is unable to connect with her. Over time, the maintenance worker and teenager re-establish their bond, despite conflicts over the brother's boat, the teenager's girlfriends, and their future living arrangements. However, staying in town is still painful for the maintenance worker, as he is surrounded by reminders of his past.\n\nOne day, he runs into his ex-wife with her newborn child. A sobbing ex-wife expresses remorse for her treatment of him during their divorce and asks him to have lunch. He deflects her apology, feeling that he does not deserve it. Distraught, he gets drunk at a bar, picks a fight with strangers, and is knocked out.\n\nThe maintenance worker arranges for a local couple to adopt the teenager so that he can remain in town while he takes a job in the larger city. When the teenager asks why he cannot remain together, the maintenance worker says that he \"can't beat it\". In the final scene, they go fishing on the inherited boat, symbolizing a tentative reconciliation and hope for the future."
}