{
  "obfuscated_plot": "In a rural area, two brothers rob two branches of a local bank. Though the robberies are well-planned, the younger brother's wild nature leads him to take unnecessary risks, frustrating the older brother. Their mother has died after a long illness, leaving their ranch in debt because of a reverse mortgage provided by the same bank, which would lead to the foreclosure of their lands if not settled. Meanwhile, oil has been discovered on their land, and the older brother is determined to ensure a comfortable life for his estranged ex-wife and their two sons. Two law enforcement officers are assigned to the case. The senior officer, near retirement, investigates the robberies and quickly determines the robbers' methods and personalities. Meanwhile, the younger brother robs another bank, unbeknownst to the older brother who sits at a nearby diner. They bury the getaway cars after each robbery. They then launder the stolen money at a gambling establishment, where the older brother has the casino convert their \"winnings\" into a check made out to the bank. With untraceable funds, the brothers head back home. After staking out another branch of the bank without success, the senior officer figures a pattern to the bank robberies. Determining the next target, he and his partner head there. Pressed for time, the brothers proceed despite the bank being crowded. A shootout ensues with a security guard and an armed civilian; the younger brother kills both of them. During the escape, the older brother is shot in the back by an armed posse of locals. The brothers race out of town with the posse in pursuit. The younger brother drives them back with an automatic rifle. The brothers split up; the older brother takes the money using another vehicle, while the younger brother acts as bait. He draws law enforcement and the posse to a remote area where he takes potshots at officers with a hunting rifle, killing one of the officers. Distraught, the senior officer uses a local's knowledge of the area to circle behind the younger brother and fatally shoot him. Meanwhile, the older brother passes through a police checkpoint without incident. He launders the stolen cash at a casino, where he sees the news report of his brother's death. He takes the casino's check to the bank just in time to avoid the ranch's foreclosure and deeds the ranch into a family trust. Following his retirement, the senior officer visits his former office and learns that the older brother has been cleared as a suspect, as he has no criminal record nor motive, as his new oil wells earn more in a month than the total stolen in all of the robberies together. The money from the ranch's oil wells is deposited at the bank, which refuses to cooperate with the investigation for fear of losing management of the family's trust fund. Despite the lack of evidence, the senior officer remains certain that the older brother was the mastermind. The officer confronts the older brother at the ranch and demands to know the reason behind the robberies. The older brother explains that he has resolved to not let poverty affect his sons as it did him and his brother. The officer tells the older brother he holds him responsible for the death of his partner, and the situation soon turns into a standoff. They are interrupted when the older brother's ex-wife and children arrive, revealing that he gave the ranch to his children rather than keep it for himself. As the officer departs, the older brother suggests they meet again soon to \"finish the conversation\" and the officer agrees."
}