{
  "obfuscated_plot": "In the mid-20th century in a European capital, a renowned fashion designer creates haute couture dresses for elite clientele, including nobility. His clients view him as a genius whose creations enable them to become their best selves, but his creativity and charm are matched by his obsessive and controlling personality. His sister manages his fashion house's day-to-day operations and tries to protect him from anything that might distract him from his work. The superstitious designer is haunted by his mother's death and often stitches hidden messages into the linings of the dresses he makes. After designing a new gown for a prestigious client, he visits a restaurant near his country house and meets a foreign waitress. She accepts his invitation to dinner. Their relationship blossoms, and she moves in with him, becoming his model, muse, and lover. His sister initially mistrusts and dominates her, but comes to respect her willfulness and determination. At first, she enjoys being part of his work, but he proves aloof, hard to please, and finicky; as a result, they start to bicker. When she tries to show her love by surprising him with a romantic dinner, he lashes out, calling it an \"ambush\" and questioning her motives. She retaliates by poisoning his tea with wild mushrooms gathered outside the country house. As he readies a wedding gown for a foreign royal, he collapses, damaging the dress and forcing his staff to work all night to repair it. He becomes gravely ill and has hallucinations of his mother. She stays by his side, nursing him back to health. After recovering, he tells her that a house that does not change \"is a dead house\" and asks her to marry him. Taken aback, she hesitates, but then accepts. After a honeymoon abroad, they start bickering again as his domineering personality reasserts itself. His sister tells him that a previous important client is now working with a rival fashion house and suggests that his classic, conservative designs may be going out of style. He blames his wife for upending his routines, saying she doesn't fit in and has turned his sister and him against each other. She overhears him. At the country house, she makes him an omelet poisoned with the same mushrooms as before. As he chews his first bite, she informs him that she wants him weak and vulnerable, then strong again after she has taken care of him. He realizes the omelet is poisoned, but ostentatiously swallows the bite and tells her to kiss him before he is sick. As he lies ill again, she imagines their future with children, a rich social life, and a bigger role for her in the dressmaking business. She acknowledges that while there are challenges ahead, their love and their complementary needs can overcome them."
}