{
  "obfuscated_plot": "In the mid-1960s, a government analyst is sent to a foreign war zone, where he embeds with soldiers and documents the on-the-ground reality of a prolonged conflict. He soon realizes the war is hopeless, and upon returning home, his superior agrees. However, the analyst is left disillusioned when the superior continues to publicly justify further military deployments. After his mission, he works for a prestigious research organization with access to classified information. Over the following years, he secretly copies thousands of classified pages documenting long-term government interference in the conflict; once he finishes copying the full collection, he leaks it to a prominent journalist at a major national newspaper.\n\nIn the early 1970s, a woman has been the owner and publisher of a provincial newspaper for eight years following her husband's suicide and her father's death. Although she lacks journalistic and business experience, she hopes to take the company public and secure investment for higher-quality news. She personally appoints a bullish executive editor who agrees with her vision, but her male-dominated board still views her as inexperienced. When a federal district court issues an injunction against a competing newspaper, the publisher becomes concerned about liability and social standing.\n\nThe newspaper's assistant editor tracks down the original document leaker and obtains the full report. The reporters dig through the pages, but their attorneys advise against publishing due to potential criminal charges. The publisher agonizes over the decision, consulting with her advisors who warn of social exile, government retaliation, and potential loss of investors. However, the executive editor argues they have a strong public interest defense that could transform the newspaper into an important journalistic institution.\n\nThe publisher ultimately decides to print the documents. The newspapers appear before the Supreme Court to plead their constitutional rights. In solidarity, other newspapers across the country publish information from the leaked documents. The Supreme Court rules in the newspapers' favor, vindicating the publisher's decision. In response, the sitting president bars the newspaper from official access.\n\nOne year later, a security guard discovers a burglary-in-progress, inadvertently initiating a major political scandal that would reshape the nation's political landscape."
}