{
  "obfuscated_plot": "In 1972, a young black officer is hired as the first of his race in a local police department. Assigned to the records room, he grows tired of being bullied and applies to become an undercover officer. He is tasked with infiltrating a local civil rights rally where a prominent national civil rights leader is speaking. At the rally, he meets a female student union president. While escorting the speaker to his hotel, she is harassed by a racist patrolman who threatens the speaker and gropes her.\n\nAfter the rally, the officer is reassigned to intelligence. After reading about a local chapter of a white supremacist organization in the newspaper, he calls posing as a white man. He speaks with the chapter's president but realizes he must meet the members in person. He recruits his Jewish coworker to impersonate him at in-person meetings while he continues posing as white on the phone.\n\nHis coworker meets the chapter's leaders, including a volatile member and his wife. The officer begins phone conversations with the national leader of the organization. The volatile member becomes suspicious of the coworker and tries to force him to take a polygraph test. The officer creates a distraction to help his coworker.\n\nMeanwhile, the officer begins dating the student union president without revealing his profession. He discovers that two members of the organization are active military personnel at a high-security defense facility. The national leader visits to induct the officer into the organization. During the ceremony, the volatile member's wife plans to plant an explosive device at a civil rights rally.\n\nThe officer learns of her plan and alerts local police. When she realizes the rally is heavily guarded, she plants the device at the student union president's house. The officer tackles her as she tries to flee but is mistakenly beaten by uniformed officers.\n\nThe organization members who planned the attack end up killing themselves when they accidentally detonate the bomb under their own car. The coworker frees the officer and arrests the wife. Later, the racist patrolman who previously harassed the student union president arrives and admits to his past assault. The officer reveals he is wearing a wire, leading to the patrolman's arrest.\n\nThe police chief congratulates the team but orders them to end the investigation and destroy records. The officer receives a final call from the national leader and reveals his true racial identity before hanging up.\n\nThe story concludes with a glimpse of future racial tensions, connecting the historical events to modern-day demonstrations and racial conflicts."
}