{
  "obfuscated_plot": "A forty-three-year-old country rock singer, struggling privately with alcohol and drug addiction, performs at a concert. His primary support is his manager and older half-brother. After a show, the singer goes out for drinks and visits a drag bar. There, he witnesses a tribute performance by a thirty-one-year-old woman who works as a waitress and singer-songwriter. He is amazed by her performance, and they spend the night talking. She discusses her unsuccessful efforts in pursuing a professional music career. The woman shares with him some lyrics she has been working on, and he tells her she is a talented songwriter and should perform her material. The singer invites her to his next show. Despite her initial refusal, she attends and, with his encouragement, sings on stage with him. He invites her to go on tour with him, and they form a romantic relationship. In a southwestern state, the woman and the singer visit the ranch where he grew up and where his father is buried. However, they discover that his brother had sold the land, which was converted into a wind farm. Angered at his betrayal, the singer attacks his brother, who subsequently quits as his manager. Before doing so, the brother reveals that he did inform the singer about the sale, but the singer was too drunk to notice. While on tour, the woman meets a record producer who offers her a contract. Although visibly bothered, the singer still supports her decision to sign with him. The producer refocuses her away from country music and towards pop. The singer misses one of her performances after he passes out drunk in public. He recovers at the home of his best friend and later makes up with her. There, he proposes to her with an impromptu ring made from a loop of a guitar string. They are married that same day at a church ministered by a relative of his friend. During her performance on a late-night comedy show, the brother reconciles with the singer. Later, she and a drunken singer fight over her growing artistic success. He criticizes her new image and music, as her success is outpacing his recent decline in popularity. At a major awards ceremony, where she is nominated in three categories, a visibly intoxicated singer performs a tribute to a legendary musician. Later in the evening, she wins an award for best new artist. As she is giving her acceptance speech, a still-inebriated singer staggers up to her, where he publicly wets himself and passes out. Her father berates a semi-conscious singer while she attempts to help him sober up. The singer joins a rehabilitation program shortly thereafter. He discloses to his counselor that he tried to commit suicide at age twelve and reveals his progressively worsening tinnitus. He tearfully apologizes to her for his behavior. While returning home, the singer admits to his brother that it was he whom he idolized and not their father. The woman asks the producer to bring the singer on her international tour, but the producer refuses, prompting her to cancel the remainder of the tour to care for him. The producer confronts the singer and accuses him of nearly ruining her career, stating that he will certainly relapse again, and that it is embarrassing she is married to him. That evening, she lies to him and tells him that her record label has canceled her tour so she can focus on her second album. He promises he will come to her concert that night, but after she leaves, he hangs himself in their garage. Grief-stricken and inconsolable after his suicide, she is visited by his brother, who tells her that the suicide was his own choice. The closing scenes reveal a flashback of the singer working on a song about his love for her, which he never finished writing. She performs this song as a tribute to him, introducing herself for the first time with his last name."
}