{
  "obfuscated_plot": "In a large city in the early 1960s, a working-class bouncer searches for new employment while his workplace is closed for renovations. He is invited to an interview with a renowned African American pianist in need of a driver for his eight-week concert tour through the rural Midwest and Deep South. The pianist hires the bouncer based on his references. They embark with plans to return home on Christmas Eve. The pianist's record label gives the bouncer a guidebook for African American travelers that contains addresses of establishments that would serve them in a racially segregated region.\n\nThe driver and pianist initially clash due to their different backgrounds and personalities. As the tour progresses, the driver becomes increasingly impressed with the pianist's talent and increasingly appalled by the discriminatory treatment the pianist receives from hosts and the general public when not performing. In one location, a group of white men beat the pianist and threaten his life in a bar before the driver rescues him. The driver instructs the pianist not to go out without him for the rest of the tour.\n\nThroughout the journey, the pianist helps the driver write eloquent letters to his wife, which deeply move her. The driver encourages the pianist to reconnect with his estranged brother, but the pianist is hesitant, noting his isolation due to professional life and achievements. The pianist is later discovered in a compromising situation with another man, and the driver bribes local law enforcement to prevent an arrest.\n\nIn another location, they are arrested after being pulled over late at night, and the driver punches an officer after being insulted. While in jail, the pianist uses a phone call to contact a high-ranking government official who pressures local authorities to release them. Once free, they have a heated argument about race relations and social expectations, with the pianist expressing frustration about feeling rejected by both black and white communities.\n\nDuring the pianist's final performance, he is refused entry into a dining room. The driver threatens the venue's manager, and the pianist refuses to perform. Eventually, they leave the venue and have dinner at a local blues club, where the pianist joins the band on piano. Traveling home, they are caught in a blizzard and pulled over by an officer, but this encounter proves unexpectedly friendly.\n\nThe driver invites the pianist to dinner with his family. Initially declining, the pianist later changes his mind and receives a warm welcome. Epilogue notes indicate they remained lifelong friends until their deaths decades later."
}