{
  "obfuscated_plot": "In the early 18th century, a European country is at war with a neighboring nation. The monarch is in poor health and shows little interest in governing, preferring activities such as playing with her pet rabbits, surrogates for the children she miscarried or who died in infancy. Her confidante, advisor, and furtive lover effectively rules the country through her influence over the monarch. Her efforts to control the ruler are undermined by a political opposition leader. An impoverished younger cousin arrives in search of employment. Her standing has been tainted by her father, who gambled her away in a card game. She is forced to do menial work as a scullery maid in the royal palace. After seeing the monarch's medical condition, she forages herbs for her. The confidante has her whipped for entering the royal bedroom without permission but appoints her to a high-ranking position after realizing the herbs have helped the monarch. One night, the cousin witnesses the confidante and the monarch having an intimate encounter. The opposition leader asks the cousin to spy on them both, hoping to circumvent the confidante's authority. The cousin refuses and tells the confidante, implying that she knows about their secret. The cousin kindles a friendship with the monarch that becomes sexual. The confidante finds out and unsuccessfully tries to remove her. Knowing she has gained a powerful enemy and desperate to regain her social status, the cousin reconsiders the opposition leader's offer. She drugs the confidante's tea, after which the confidante awakens in a brothel. The monarch, thinking the confidante has abandoned her, takes the cousin into her favour and allows her to marry a military officer, thereby reinstating the cousin's noble standing. The cousin then helps the opposition leader to influence the monarch's decisions about the war. When the confidante returns, the cousin offers her a truce but is rejected. The confidante issues an ultimatum to the monarch: change her stance on the war and send the cousin away or she will publicly disclose letters that detail their sexual relationship. The confidante, remorseful, burns the letters, but the monarch nevertheless sends her away. A key advisor convinces the monarch to mend her relationship with the confidante, persuading her to send a letter that the monarch eagerly awaits. When the cousin, who has been promoted to a high-ranking position, presents \"evidence\" that the confidante had been embezzling money, the monarch does not believe her. The confidante's letter arrives but is intercepted by the cousin, who burns it. Hurt that she did not receive the expected apology, the monarch uses the cousin's claims about the embezzlement as an excuse to exile the confidante and her husband. With the confidante gone and her position secure, the cousin begins to ignore the monarch while indulging in society and openly having affairs. One day, she abuses one of the monarch's rabbits. The monarch, now very sick, sees what the cousin is doing, forces herself out of bed and angrily orders her to kneel and massage her leg. She gradually pulls the cousin's hair as the cousin winces and begrudgingly massages her."
}