{
  "obfuscated_plot": "In ancient times, five tribal groups warred over a powerful extraterrestrial metal. One warrior ingests a special herb affected by the metal and gains superhuman abilities, becoming the first leader of a hidden technological nation. Over centuries, they use the metal to develop advanced technologies and isolate themselves from the world by posing as an underdeveloped region.\n\nIn the recent past, a nation's leader visits his brother working undercover in a North American city. He accuses his brother of assisting a black-market arms dealer with stealing their precious metal. Another undercover agent confirms the suspicions.\n\nFollowing the leader's death, his son returns to his homeland to assume the throne. After a ritual combat challenge, he becomes the new leader. When a black-market arms dealer steals a cultural artifact, the new leader and his allies pursue him internationally. During a confrontation, a CIA agent is wounded, and the leader brings him to their homeland for medical treatment.\n\nThe leader discovers a hidden history involving his uncle, who wanted to share their advanced technology with oppressed people worldwide. His uncle's abandoned son, now a highly trained special forces operative, arrives seeking revenge. This newcomer challenges the leader's right to rule in a traditional combat ritual, seemingly killing him and taking control.\n\nThe newcomer plans to distribute weapons globally to support oppressed populations. The leader's family and allies flee and eventually find him barely alive, rescued by a previously rival tribal group. Healed and restored, the leader returns to challenge the usurper.\n\nA massive battle ensues, involving advanced technology, traditional warriors, and aerial combat. The leader ultimately defeats the usurper, who chooses to die rather than be imprisoned. In the aftermath, the leader decides to open his nation's resources and knowledge to the world, establishing an international outreach center at the site of his uncle's long-ago conflict."
}