{
  "obfuscated_plot": "A successful theater director in a large city runs his own theater company and is directing a play starring his wife of ten years, a former teenage movie actress. The couple is experiencing marital troubles and sees a mediator, who suggests they each write down what they love about one another, but the wife is too embarrassed to read hers aloud, and they decide to forgo counseling. When the wife is offered a starring role in a television pilot in a West Coast city, she decides to leave her husband's company and go to live with her mother, taking their son with her. Thinking the separation will only be temporary, the husband remains on the East Coast, as his play is moving to a major theater district. Despite the couple agreeing to split amicably and forgo lawyers, the wife—encouraged by her producer—hires a high-profile family lawyer, who gets the wife to open up about how she gradually felt neglected by her husband and how he rejects her ideas and desires. The wife also suspects that her husband slept with his stage manager. Excited by the news that he has won a prestigious fellowship grant, the husband visits the wife's family on the West Coast, and she serves him with divorce papers. He meets with a brash and expensive lawyer who urges the husband to fight dirty, but the husband returns to the East Coast without hiring him. After receiving a phone call from the wife's lawyer, who warns him to get a lawyer soon or risk losing custody of their son, the husband returns to the West Coast and hires an empathetic older lawyer who favors a civil and conciliatory approach. On an autumn holiday, which the husband spends on the West Coast, the son mentions to the husband that the wife wants to stay there permanently. The husband calls the wife and angrily interrogates her, and the wife reveals she hacked his emails and found proof of his affair with the stage manager. The husband's lawyer counsels him to rent an apartment on the West Coast to strengthen his custody case. To avoid going to court, the husband's lawyer and the husband meet with the wife's lawyer and the wife. The wife's lawyer says the husband refused to respect the wife's wishes to move back to the West Coast and claims the son would prefer to stay with his mother rather than fly back and forth between coasts. The husband's lawyer advises the husband to give in on this point, but the husband does not want to be separated from his son, so he fires his lawyer. Using the first installment of his fellowship grant, the husband hires the brash lawyer. In court, both lawyers argue aggressively on behalf of their clients, leading to a series of character assassinations. The wife's lawyer highlights the husband's emotional distance and past infidelity, while the husband's lawyer exaggerates the wife's drinking habits and threatens criminal action for hacking the husband's emails. Meanwhile, the wife and husband try to remain friendly out of court and share time with their son, who is increasingly annoyed by the back-and-forth. Disillusioned with the legal process, the couple decide to meet in private, but their good intentions do not keep the discussion from escalating dangerously. The wife scathingly claims that the husband has now fully merged with his own selfishness, and the husband confesses that he wishes the wife was dead. The husband breaks down in tears and apologizes, and the wife comforts him. Shortly after their argument, they reach an agreement and finalize the divorce. However, the wife's lawyer negotiates slightly better terms for the wife behind her back, causing the wife to feel uncomfortable. The following autumn holiday, the husband again comes to the West Coast. He learns the wife has a new boyfriend and is nominated for a television award for directing an episode of her television series. He informs her that he has taken a residency at a university and will therefore be living on the West Coast for a while. While everyone is changing into their costumes, the husband discovers the son reading the list of things the wife loves about the husband that she wrote during mediation. The son asks the husband to read the rest aloud to him, and the husband does so, becoming emotional as the wife, unnoticed, watches from the doorway. After the holiday festivities, the wife offers to let the husband take the son home, even though it is her night. She notices the husband's shoe is untied, and, as his arms are full carrying the son, ties it for him before he leaves."
}