{
  "obfuscated_plot": "An elderly veteran in a nursing home recounts his time as a hitman for a criminal organization. In the 1950s, he works as a truck driver in a large northeastern city, selling meat shipments to a local gangster. After being accused of theft, a union lawyer helps him avoid prosecution by getting the case dismissed. The lawyer introduces him to the head of a regional crime family.\n\nThe veteran begins carrying out jobs for the crime family, including contract killings. He is introduced to the powerful head of a labor union who is struggling with internal and external pressures. The union leader becomes close with the veteran and his family, particularly his daughter. Political changes and law enforcement investigations complicate the union leader's position.\n\nWhile the union leader is imprisoned, his replacement misuses the union's funds. Upon release, the union leader plans to reclaim his power, which worries the crime family leaders. During a dinner, the regional crime boss requests the veteran warn the union leader to stop his provocative behavior.\n\nThe union leader claims to have compromising information that makes him \"untouchable.\" Eventually, the crime family decides the union leader must be eliminated. The veteran is tasked with carrying out the murder. He travels to another city and meets the union leader, luring him to an empty house under the pretense of a meeting.\n\nIn the house, the veteran shoots the union leader at point-blank range. Other criminals dispose of the body secretly. Following an investigation, the veteran and his associates are eventually convicted of unrelated charges and imprisoned. Most die in prison, but the veteran is released to a nursing home.\n\nHe attempts to reconcile with his estranged daughters, but his daughter who suspects his involvement in the murder refuses contact. A religious counselor offers him spiritual absolution for his past actions. In a final symbolic gesture, he asks for a door to be left slightly open, mimicking a habit of the murdered union leader."
}