{
  "obfuscated_plot": "During the latter stages of a world war, in a small city in an oppressive regime, a ten-year-old boy joins a youth organization. Heavily indoctrinated by the regime's ideology, he has an imaginary friend, a buffoonish version of the dictatorial leader. The local training camp is run by a conflicted captain. Though a fanatic, the boy is deemed weak and nicknamed after his inability to kill a small animal with his bare hands. Encouraged by his imaginary friend, he returns to prove himself during an exercise, only to be severely injured. His mother insists that he still be included, assigned small tasks around town while recovering. \n\nAlone at home one day, he discovers a teenage girl, a Jewish refugee his mother is hiding in the attic. He is both terrified of and aggressive towards her. They are left at an impasse, as revealing her presence would lead to execution. Inspired by the captain, the boy interacts with her to uncover her \"secrets\" and create a discriminatory picture book. Despite this, he slowly forms a friendship with her. She challenges his dogmatic beliefs with surreal stereotypes. \n\nThe boy becomes infatuated with the strong-willed teen, awkwardly forging letters from her supposed fiancé and questioning his beliefs. His imaginary friend scolds him for his diminishing patriotism. Gradually, his mother is revealed to be part of the resistance, spreading anti-regime messages. One day, the secret police investigate; the captain helps the boy and girl deceive them. Later, the boy finds his mother has been executed for her resistance activities.\n\nDevastated, he tries to attack the girl before breaking down. She comforts him and reveals that his absent father has been working against the regime from abroad. The boy's beliefs quickly shift as he sees the regime's inhumanity. With no resources, he begins scavenging food for them both. Following the dictator's death, Allied forces initiate an offensive. Weakened, the civilian population is pressed into combat service.\n\nThe boy hides until the war ends with an Allied victory. Seized by foreign troops, the captain comforts the boy about his mother's death, tells him to protect the girl, and sacrifices himself to save the boy. Fearing the girl will leave, the boy lies about the war's outcome. Recognizing her despair, he forges a letter claiming they will escape together. She reveals her fiancé actually died the previous year.\n\nThe boy declares his love, hoping she loves him like a brother. She confirms she loves him as a brother. As he prepares to leave, his imaginary friend reappears wounded, but the boy eliminates this hallucination. Outside, the girl sees the victorious forces and learns the truth, slapping the boy for lying. They then dance in the street together, now free."
}