{
  "obfuscated_plot": "In the early 2010s, a woman loses her job after the closure of a factory in a small desert town; she had worked there for years along with her recently deceased husband. She sells most of her belongings and purchases a van to live in and travel the country searching for work. She takes a seasonal job at a large online retail warehouse through the winter. A friend and co-worker invites her to visit a desert gathering organized by an elder nomad, which provides a support system and community for fellow travelers. She initially declines, but changes her mind as the weather turns cold and she struggles to find work in the area. There, she meets fellow nomads and learns basic survival and self-sufficiency skills for the road. When her van blows a tire, she visits the van of a nearby nomad to ask for a ride into town to buy a spare. The older nomad chastises her for not being prepared and invites her to learn road survival skills; they become friends. The nomad tells her about her cancer diagnosis and shortened life expectancy and her plan to make good memories on the road rather than waste away in a hospital. They eventually part ways. She takes a job as a camp host at a national park. Also working there is another nomad she met and danced with at the desert community. When he falls ill, she visits him at the hospital where he has had emergency surgery. They take restaurant jobs at a roadside tourist attraction. One night, the man's son visits the restaurant looking for him, telling him that his wife is pregnant and asking him to meet his grandchild. He is hesitant, but she encourages him to go. He suggests that she come with him, but she declines. She takes a new job at a processing plant, but her van breaks down, and she cannot afford the repairs. Unable to borrow money, she visits her sister's family at their home in another state. Her sister lends her the money to get the van fixed. She questions why the woman was never around in their lives and why she stayed in her hometown after her husband died, but tells her that she is brave to be so independent. She later visits the man and his son's family, learning that he has decided to stay with them long-term. He admits to having feelings for her and invites her to stay with him permanently, but she decides to leave after only a few days, heading to the ocean. She resumes her seasonal job and later returns to the desert gathering. There, she learns that her nomad friend has died, and she and the other nomads pay tribute to her life by tossing stones into the campfire. She opens up to the elder nomad about her loving relationship with her late husband, and he shares the story of his son's suicide. He espouses the view that goodbyes are not final in their community as its members always promise to see each other again \"down the road\". She returns to her nearly abandoned hometown to dispose of the belongings she has been keeping in a storage unit. She visits the factory and the home she shared with her husband before returning to the road."
}