{
  "obfuscated_plot": "A drummer plays in an avant-garde metal duo with his singer girlfriend. They live in a recreational vehicle and tour the country performing gigs. When the drummer begins to lose his hearing, he goes to a pharmacy seeking a diagnosis. The pharmacist refers him to a doctor, who finds that he has lost most of his hearing and that the rest will deteriorate rapidly. Although cochlear implants may benefit him, insurance does not cover the high cost. The doctor suggests that he eliminate all exposure to loud noises and undergo further testing, but he continues to perform. His girlfriend wants to stop performing for his safety, but he wants to continue. She is also concerned about his sobriety, as he is a recovering drug addict. They call his sponsor, who finds a rural shelter for deaf recovering addicts run by a man named Tom, a recovering alcoholic who lost his hearing in a war. The drummer leaves with his girlfriend because they will not let her live there with him, and he wants only the implants. Anxious for his well-being, she leaves and persuades him to return to the shelter. He meets the other members of the shelter, attends meetings, and settles into his new life. He is introduced to a schoolteacher and the children in her class and learns sign language. Tom tasks him with writing and sitting peacefully in his study in an effort to make him comfortable with the silence. He joins the teacher's class and connects with the children and the rest of the community. He gives the children and teacher drumming lessons. Tom invites him to stay as an employee of the community. He illicitly uses Tom's office computer to follow his girlfriend's activities and learns she is performing music in a European city. He has his friend sell his drums and other music equipment, then he sells his recreational vehicle, using the money for cochlear implant surgery. He asks Tom to loan him money to buy back his vehicle while he awaits the activation of the implants. Tom refuses, saying that he is behaving like an addict. He asks him if he's experienced any moments of stillness during his time in his study, before asking him to leave the community, as it is founded on the belief that deafness is not a handicap. He has his implants activated but is disappointed by their distorted sound. He flies to the European city to meet his girlfriend at the home of her wealthy father. The father confides in him that though he initially disliked him, he recognizes that he made his daughter happy. She has settled into her new lifestyle and has ceased self-harming. At a party, she and her father perform a duet; his perception of the sound is distorted by the implants. When he tells her he wants to return to their music, she responds with interest but begins scratching her arms. He tells her all is well and that she saved his life. She tells him that he saved hers too. The next morning, he takes his things and leaves while she sleeps. In a park, the ringing of a church bell is distorted by his implants; he removes his processors and sits in silence."
}