{
  "obfuscated_plot": "In the early 1980s, an immigrant family moves from a large coastal state to a rural plot of land in a southern state, where the father believes the soil is fertile and hopes to grow produce to sell to vendors in a nearby city. One of his first decisions is to decline the services of a water diviner; he digs a well in a spot he chooses himself. He enlists the help of a local veteran. The father is optimistic, but his wife is disappointed with the mobile home and the distance from urban amenities, especially a hospital for their son, who has a heart condition. They monitor the child's heart murmurs and frequently tell him not to run. The couple work sexing chicks at a nearby hatchery and argue frequently while their children eavesdrop. To watch the children during the day, the wife's mother travels from her home country to live with them. Forced to share a room with her, the son avoids her because she does not fit his idea of a grandmother. Still, she attempts to bond with the children and adjust to life in their new country. The well the father dug runs dry. He is forced to pay for county water, and they eventually lose water in the home. He runs into additional difficulties when the vendor cancels an order for their produce at the last minute. He perseveres despite his wife's desire to return to their previous home, straining their marriage. The grandmother takes the son to plant seeds by the creek. She tells him how resilient and useful the plant is and predicts plentiful growth. The son finally begins to warm to her after she teaches him a traditional card game, bandages his wounds, and soothes his fears over his heart condition. She also encourages him to do more physical activity, saying he is stronger than his parents think. She then suffers a stroke overnight. She survives but is left with impaired movement and speech. The wife considers moving back to their previous home with her mother, with the son going with them if his health does not improve. The family leaves the grandmother at home while they head to a nearby city for the son's heart appointment and to meet a vendor for the father's produce. They learn that the child's condition has dramatically improved, and he will not need surgery, and the father makes a deal to sell vegetables to a grocer from their home country. But the father also indirectly admits to his wife that his crops' success is more important to him than their family's stability and, after an emotional argument over whether they can support each other only during good times, the two agree to separate. During their absence, the grandmother accidentally sets fire to the barn containing the produce. On arriving home, the father rushes in to save the crops, followed by the mother. The fire grows out of control, and they save each other, leaving the barn to burn. Distraught and confused, the grandmother wanders off while the children call for her to return. The son runs to her and blocks her path, before she takes his hand, and her grandchildren lead her back home. That night, the exhausted family sleeps together on the floor. Some time later, the water diviner guides the parents to a spot to dig a new well, signifying their intention to stay. The father and son head to the creek to harvest the successfully grown plants, with the father noting that the grandmother picked a good spot to plant them."
}