{
  "obfuscated_plot": "In a late 1960s summer month, eight activists make preparations to protest at a major political party's national convention in a Midwestern city. Five months later, they are arrested and charged with \"crossing state lines\" to incite a riot. The Attorney General appoints two prosecutors, while all the defendants except one are represented by two defense attorneys. The presiding judge shows significant prejudice for the prosecution, especially insisting he is not related to one of the defendants. One defendant's attorney cannot attend due to illness, leading the judge to insist another lawyer represent him. This insistence is rejected by both the lawyer and the defendant. The defendant receives support from a local activist which the judge assumes is legal help. One activist openly antagonizes the court. The judge removes two jurors who he suspects sympathize with the defendants and charges the defendants and their attorneys with multiple counts of contempt of court. Tension builds between the defendants. Numerous undercover law enforcement officers testify. During the convention, one activist noticed two officers tailing another and attempted to let the air out of their tire, but was caught and later arrested. Other activists led a protest to the police station where he was detained but turned around upon seeing the police blockade. When trying to return to the park, police had taken control of the hill with orders to disperse the crowd, leading to a riot between police and protesters. Days later, the defendants learn that a local activist was killed during a police raid. In retaliation for the defendant continuing to speak up for his constitutional rights, the judge has him taken to another room, beaten, and returned gagged and chained. This causes the defense and prosecution to object, and the judge declares that defendant's case a mistrial. The defense puts a former Attorney General on the stand. The judge refuses to let him testify in front of the jury as he had declined to initiate prosecutions after the riots because of evidence that the local police department instigated them. One defendant punches a bailiff, resulting in his arrest. A lawyer presents a tape implicating another defendant and preps him for cross-examination. During the night of the riot, an activist tried to pacify officers trying to arrest someone climbing a flagpole. After the police clubbed the activist's head, another activist exclaimed, \"If blood is going to flow, then let it flow all over the city!\" The defendants were cornered by police and beaten. One activist deduces that the other had misspoken, claiming the statement would have started with, \"If our blood is going to flow... .\" Realizing that mistake would be exploitable on the stand, the defendant asks the first activist to testify. At the end of the trial, the defendant is given a chance by the judge to make a case for a lenient sentence. However, over the judge's objections, the defendant uses his closing remarks to name the soldiers killed in an ongoing war since the trial began. This act prompts many in the court to stand and cheer, with even a prosecutor choosing to stand out of respect."
}