{
  "obfuscated_plot": "A 30-year-old woman who dropped out of medical school works in a coffee shop and spends her evenings going to bars and clubs, pretending to be drunk, then confronting those who attempt to take advantage of her sexually. It is gradually revealed that she quit medical school after the public rape of her lifelong best friend, who subsequently dropped out and committed suicide when her rapist was cleared of wrongdoing. The woman becomes reacquainted with a former medical school classmate, who persuades her to go on a date. He reveals that the rapist will soon get married. Angered that he has found success and happiness, she begins to orchestrate revenge against the people that she thinks contributed to nobody being held accountable for the rape. First, she meets with another former classmate and onetime friend who blames her best friend for her own assault because she often drank to excess. She plies this woman with wine and hires a man to take her to a hotel room to trick her into thinking she was raped. Afterward, the woman leaves her multiple distressed voicemails. She then targets the dean who dismissed her friend's case. Pretending to be a makeup artist for a popular band, she lures the dean's daughter into her car. She meets with the dean under the guise of returning to medical school and finds that the dean only vaguely remembers the case. She even had the rapist return to give a talk at the school recently. The dean justifies her actions until she is told that her daughter has just been dropped off at the dorm room where the assault occurred. Terrified, the dean demands to know where her daughter is, finally admitting her own complicity and inaction before learning she is safe nearby. Next, she meets with the rapist's lawyer and finds that he is deeply remorseful for his actions. The lawyer, who is on a leave of absence after a psychotic episode, describes how easy it is to build a case against a rape victim. She chooses to forgive him and later visits her deceased friend's mother, who encourages her to move on with her life. She reconnects with her former classmate. They begin dating and fall in love. She also introduces him to her parents, who are happy that their daughter seems to finally be moving on. A distraught former friend eventually confronts her at home, and she assures her that she was not actually raped. The friend admits she treated the assault callously and provides a phone containing a video of the assault, revealing her boyfriend's presence at the party. She confronts him, and he claims he was too drunk to remember the incident and should be forgiven because he was so young. Threatening to release the video, she forces him to reveal the rapist's bachelor party location. He begs for her forgiveness, but she refuses. Posing as a stripper at the party, she drugs the attendees, handcuffs the rapist to a bed, and reveals her identity. She attempts to carve her friend's name upon his body, but whilst defending himself, he suffocates her with a pillow. The next morning, the rapist's friend helps him burn her body in the woods. Her parents report her missing. The police visit her boyfriend, and he lies that he is unaware of her whereabouts, suggesting she may have been unstable. At the rapist's wedding, the boyfriend is stunned to receive a scheduled text from her, indicating that her plan is unfinished. The police arrive at the reception to arrest the groom for her murder. Flashbacks reveal that the lawyer received a package with the cell phone and instructions in case she did not return from the bachelor party. The police then discovered a half-heart necklace with the deceased friend's name on it among her burnt remains. The rapist is arrested for her murder as the boyfriend receives a final text from her, signed with her and her friend's names."
}