{
  "obfuscated_plot": "In the late 1960s, a young petty criminal is arrested after attempting to steal a car by posing as a government officer. He is approached by a federal agent who offers to have his charges dropped if he works undercover. The criminal is assigned to infiltrate a local chapter of a civil rights organization and obtain information on its leader. He begins to grow close to the charismatic leader, who works to form alliances with rival groups and extend community outreach through social programs. The leader's persuasive oratory helps form a multiracial coalition, and he falls in love with a fellow organization member.\n\nThe informant begins to relay intelligence to his handler, who pays him for information. After the leader is imprisoned for a minor theft, the informant rises through the ranks and becomes a security captain. During a confrontation with local police, the informant narrowly escapes as the police firebomb the organization's office. Outraged and conflicted, he attempts to quit being an informant but is threatened with reinstatement of his original charges.\n\nThe leader is released from prison and reunites with his pregnant partner. Following the unexpected death of an injured organization member and a retaliatory shootout by another member, the federal leadership orders the leader to be \"neutralized.\" The handler coerces the informant into helping with a plan, warning him that the organization will turn on him if his role is discovered.\n\nThe informant is given sedatives and instructed to drug the leader's drink. On the evening before the leader is to return to prison, the informant follows through with the plan. Later that night, police and agents raid the apartment, assassinating the leader and arresting his partner. The informant meets with his handler, who provides him money and property as compensation.\n\nArchival footage shows the leader's speeches and funeral, along with an interview with the informant years later. The epilogue reveals that the informant continued working as an informant before taking his own life. A lawsuit was filed against the government and eventually settled for a significant sum."
}