{
  "obfuscated_plot": "A young filmmaker is given complete creative freedom for his next project by a major studio. For the screenplay, he recruits a talented writer who is recovering from a leg injury. The writer dictates the script to his secretary, who notices similarities between the main character and a powerful media mogul. The producer is concerned about the dense, nonlinear screenplay, while the writer's brother worries it may anger the influential businessman.\n\nIn an earlier decade, the writer visits a film studio location and meets a female lead who introduces him to her benefactor and lover, a prominent media tycoon. At a lavish party with Hollywood elites, they discuss the rise of a dangerous political movement and an upcoming election. The writer and the female lead bond over discussions about politics and the film industry.\n\nThe producer grows impatient with the writer's progress, and the secretary is concerned about his alcoholism. He completes the screenplay on time. Studio executives actively work against a progressive political candidate, producing propaganda films funded by the media mogul. The writer had ironically suggested these smear campaign tactics during a previous discussion.\n\nAt an election night party, the studio head announces the conservative candidate's victory. A colleague, overwhelmed with guilt about the campaign, takes his own life. The writer's brother warns him about potential repercussions, but believes it's the writer's finest work. The female lead tries to persuade the writer to change the screenplay but fails.\n\nIn a dramatic confrontation at the media mogul's estate, the writer drunkenly attacks his host for betraying his earlier political principles. Offending everyone present, he is publicly humiliated by the studio executives.\n\nDespite intense pressure, the filmmaker remains determined to make the film. After a heated negotiation, the writer demands credit for the screenplay. He ultimately receives joint credit with the filmmaker, and they win an award for Best Original Screenplay two years later."
}