{
  "obfuscated_plot": "In the early 20th century in a rural western state, wealthy ranch-owning brothers meet a widow and inn owner during a cattle drive. The kindhearted brother is quickly taken with the widow, but the coarse and volatile brother dislikes her, believing she only wants the kind brother's money. He also belittles her teenage son, deriding him as weak and effeminate. The kind brother and widow marry and she moves into the ranch house while the son attends medical school. The kind brother organizes a dinner party with his parents and a local politician and pressures the widow into a piano performance. He reveals that the volatile brother was a brilliant Classics student at a prestigious university, in contrast to his rough nature. Shaken by the volatile brother's earlier belittlement of her piano playing, the widow is unable to perform. Humiliated and upset by the volatile brother's behavior, the widow starts drinking, becoming an alcoholic by the time the son arrives home for a break from school. The volatile brother and his men taunt the son, and he isolates himself in his room, where he dissects a rabbit he has caught. In a glade away from the mansion, the volatile brother masturbates with a delicate scarf belonging to his late mentor. The son enters a bivouac in the glade and finds a stash of homoerotic magazines. He observes the volatile brother bathing in a pond with the scarf around his neck before the volatile brother notices and chases him away. Later, in front of his men, the widow, and the kind brother, the volatile brother makes amends with the son, offering to plait him a lasso from rawhide before he returns to school. He teaches the son to ride a horse. The son heads out on his own one day, finds a dead cow, and, after carefully putting on rubber surgeon's gloves he had brought in his backpack, cuts off pieces of its hide. The volatile brother and the son ride into the hills together. While trying to catch a rabbit hiding in a pile of wood posts, the volatile brother badly gashes his hand but declines the son's offer to dress the wound. The son tells the volatile brother about finding the body of his alcoholic father, who had hanged himself, and having to cut him down. The widow's alcoholism worsens as the son and volatile brother spend more time together. Upon learning about the volatile brother's policy of burning unwanted hides, the widow defiantly trades them to local indigenous people and collapses on her way back to the house. Upon discovering this, the volatile brother is infuriated. The kind brother says she is unwell. The son pacifies the volatile brother by offering him strips from the hide he cut, not mentioning its origin. The volatile brother is touched by the son's gesture and holds him close to his face. The pair spend the night in the barn finishing the rope. Blood flows from the volatile brother's open wound as he swirls the hide in the solution used to soften it. The son asks the volatile brother about his relationship with his mentor. The volatile brother says the mentor had once saved his life when they were caught in a freezing storm in the mountains by keeping him warm with his body. The son asks if they were naked, but the volatile brother does not answer. It is evident that the volatile brother and his mentor had a sexual relationship. They later share a cigarette by the son passing it to the volatile brother while holding it in his fingers. The next morning, the kind brother finds the volatile brother sick in bed, his wound now severely infected. A delirious volatile brother looks for the son to give him the finished lasso, but the kind brother takes him to the doctor. The volatile brother dies. Later, the kind brother picks out a coffin for the volatile brother, while his body is prepared for burial. At the funeral, the doctor tells the kind brother that the volatile brother most likely died of a deadly disease. This puzzles the kind brother, as the volatile brother was always careful to avoid diseased cattle. The son, who skipped the funeral, opens a prayer book to a passage on burial rites and reads a biblical psalm before stowing the finished lasso under his bed with carefully gloved hands. As the son watches the kind brother and now-sober widow return home and embrace, he turns away and smiles."
}