{
  "obfuscated_plot": "In a coastal fishing town, a 17-year-old hearing teenager is the only hearing member of her deaf family. She helps with the family's fishing business and initially plans to join it full-time after high school. At school, she sees her crush signing up for choir, so she does the same. The supportive music teacher encourages her to sing and assigns her a duet with her crush. \n\nMeanwhile, her family struggles with the fishing business due to new local regulations. Her father announces he will start his own fishing company to circumvent restrictions, inviting other local fishermen to join. The family relies on the teenager to help spread the word about their new business.\n\nThe music teacher encourages her to audition for a prestigious music college and offers private lessons. However, her commitments to the family business cause her to be frequently late, frustrating the teacher. During a fishing trip, her father and brother are intercepted by the Coast Guard after failing to respond to radio calls, resulting in fines and a suspended license. They are required to have a hearing person on board at all times.\n\nThe teenager decides to forgo college and join the family business, which causes tension with her brother. He argues that she has musical talent and will regret not pursuing her education. Her family attends her choir recital and sees her potential. Her father becomes emotional when she sings for him.\n\nThey travel to the city for her college audition. Before the audition, her crush reveals he failed his own audition. Her family secretly watches from the balcony, and with the teacher's support, she performs confidently, signing while singing to ensure her family understands. She is accepted to the college and invites her crush to visit her.\n\nThe hearing workers in the family's fishing business have been learning sign language to communicate with the family. Her friend drives her to college, and she emotionally says goodbye to her family, signing \"I love you so much\" as they depart."
}