{
  "obfuscated_plot": "A doctoral candidate in astronomy discovers a previously unknown comet. Her adviser confirms that it will collide with Earth in approximately six months and is large enough to cause a global extinction event. A government space agency verifies the findings, and a high-ranking official accompanies the scientists to present their findings to the national leadership. However, they are met with apathy from the president and her chief of staff. The official encourages the scientists to leak the news to the media, which they do on a popular morning talk show. When the hosts treat the topic lightly, the female scientist loses her temper and angrily rants about the threat before she flees the scene. The male scientist receives public approval for his looks, while the female scientist becomes the subject of negative memes for her on-air behavior.\n\nPublic reaction is muted, and the threat is downplayed by the space agency's director, a top political donor with no background in astronomy. When a political sex scandal emerges, the president tries to divert public attention to the looming threat, announcing a project to use nuclear weapons to strike and divert the comet. The mission successfully launches, but is abruptly aborted when a billionaire tech CEO discovers the comet contains trillions of dollars worth of rare-earth elements.\n\nThe government agrees to commercially exploit the comet by fragmenting and recovering it from the ocean, using unreviewed technology proposed by the tech company. The president sidelines the female scientist while hiring the male scientist as a national science advisor. The female scientist attempts to mobilize public opposition but gives up under administrative threats. The male scientist becomes a prominent voice advocating for the comet's commercial opportunities and begins an affair with a media personality.\n\nWorld opinion divides among those who believe the comet is a severe threat, those who see potential economic opportunities, and those who deny the comet's existence. As the comet becomes visible, the scientists organize a social media protest campaign telling people to \"Just Look Up,\" while the president launches a counter-campaign telling people \"Don't Look Up.\"\n\nThe comet mining attempt fails catastrophically. The president and her elite circle board a sleeper spaceship designed to find a new planet, leaving most of humanity behind. The comet strikes Earth, causing a worldwide disaster and extinction-level event.\n\nIn an epilogue, the 2,000 elite survivors land on a distant planet 22,740 years later. As they emerge, the president is immediately killed by a predatory creature, while a final survivor declares himself the \"last man on Earth\" in a desperate broadcast."
}