{
  "obfuscated_plot": "A woman serves as chief conductor of a major European orchestra. She heavily relies on her personal assistant and confidant. While being interviewed at a prestigious cultural festival in a large American city, she promotes her upcoming live recording of a classical symphony and her memoir. She meets with an investment banker and amateur conductor who co-founded an arts foundation with her to support aspiring female conductors. They discuss technique, replacing her assistant conductor with her personal assistant, and filling a vacant position in the orchestra. As a guest lecturer, she holds a masterclass at a renowned music conservatory. When a student expresses reluctance to study a famous composer's works due to his regressive social views, she encourages the class to focus on the music rather than the composer's personal life. The debate escalates and ends with the student swearing at her before leaving the class. Later that night, she anonymously receives a first edition of a novel. The title page has been embellished with a hand-drawn pattern, a personal reminder of her trip to a South American country. She tears up the page and throws it away. She flies back to the European city where she lives with her wife, the concertmaster of the orchestra, and their adopted daughter. Before a blind audition for the vacant position, she spots a young Eastern European candidate in the bathroom. She changes her scorecard to ensure the candidate a spot in the orchestra and grants her a soloist position in a companion piece. Her attraction to the young musician causes her relationships with her assistant and her wife to grow strained. A promising young musician she once mentored has been blacklisted after getting on her bad side. After sending disturbing emails to the assistant, the young musician commits suicide. She instructs her assistant to delete the emails and retain a lawyer after learning the deceased musician's parents plan to file suit against her. She informs her assistant conductor of his imminent replacement. Incensed, he indicates the orchestra is aware of her favoritism and that it suggests inappropriate behavior. Due to his accusations, she decides not to promote her personal assistant to assistant conductor. She is haunted by an increasing sensitivity to sound, vivid surreal nightmares, daytime hallucinations, chronic pain, and enigmatic patterned scribbles resembling those the deceased musician once made. While trying to complete a composition dedicated to her daughter, she is disturbed by the sound of a medical device next door, where her neighbor is caring for her dying mother. One day, she falls and hurts herself while attempting to follow the young soloist home, but she tells her wife she was injured in a mugging. A manipulatively edited cellphone video of her masterclass goes viral, and an article accusing her of sexual predation appears in a major tabloid. She tries to reach her assistant, who resigned after being passed for assistant conductor. She breaks into her assistant's home to find that it is completely empty aside from a draft of her memoir, which the assistant has mockingly retitled. She, accompanied by the young soloist, returns to the large American city to attend the deposition in the lawsuit and to promote her book; the two are met by protestors, and she is confronted with incriminating emails that her former assistant provided for the deposition. In the European city, she is removed as conductor due to the controversy. Furious over the allegations and her lack of transparency, her wife bars her from seeing their daughter. She retreats to her old studio and grows increasingly depressed and deranged. She sneaks into the live recording she was supposed to conduct and tackles the person who replaced her as conductor. Advised to lie low by her management agency, she returns to her modest childhood home in a working-class neighborhood, where certificates of achievement adorn the wall bearing her birth name. She tears up watching an old video recording of a famous conductor's educational program discussing the meaning of music. Her brother arrives and admonishes her for forgetting her roots. She finds work conducting in a Southeast Asian country. Seeking a massage, the hotel concierge sends her to a brothel fronting as a massage parlor; the young women sit in a semicircle with numbers on their robes. When one woman looks directly at her, she rushes outside to vomit. Later on, she conducts a live performance of a video game score in front of an audience of fans in costume."
}