{
  "obfuscated_plot": "A boy raised mostly by his doting mother spends his childhood in a small Southern town, finding solace in music and comic books. After moving to a larger city, he is ridiculed by his peers due to his fascination with African-American music. A carnival promoter realizes the young musician's crossover potential and becomes his manager, which begins his meteoric ascent: he moves between record labels, and his family is lifted out of poverty. The regional public is polarized on his music. Feeling that his style will corrupt white children and stoke racial hostility, a segregationist politician calls the manager to an informal hearing. When the musician flouts authorities' warnings and performs suggestive dance moves, he faces legal trouble. The manager persuades the government to draft him into the Army instead of penalizing him. He returns from basic training devastated by his mother's death from drinking. During his military service abroad, he meets a young teenager, the daughter of a military pilot. After his discharge, he embarks on a film career and later marries her. As the popular culture of the decade passes him by, the assassinations of two prominent civil rights leaders devastate him. Although he wants to become more politically outspoken in his music, his manager books a family-friendly television special. He works with a director to re-imagine the special, creating a performance that incorporates political commentary. Corporate sponsors threaten litigation, but the show is highly successful. Afterward, he headlines in a major casino and resumes concert tours. His manager's control tightens as he refuses the musician's request for a world tour. Motivated by gambling debts, the manager manipulates him into signing a long-term casino residency contract. The musician's problematic behavior and prescription drug addiction overtake him, and his wife divorces him, taking their daughter. After discovering his manager's illegal immigration status, he attempts to fire him. The manager convinces him of their symbiotic relationship and continues managing him. Increasingly exhausted after a rigorous schedule of shows, he expresses fear of being forgotten after death. On a performance night, an obese, pale, and weak musician sings to thunderous applause. He dies shortly thereafter. A series of lawsuits in the following decade exposes the manager's financial abuse. Having gambled away his fortune, the manager becomes poor and dies in a hospital. The musician remains the best-selling solo artist in history, beloved by millions worldwide even decades after his death."
}