{
  "obfuscated_plot": "A young woman sleeping alone in bed wakes to find bruises and wounds on her hips and upper inner thighs—injuries sustained from rape. In a recent year, the women and girls of an isolated religious colony discover that the men have been using livestock tranquilizer to subdue and rape them. The attackers are arrested and imprisoned in a nearby city. Most of the men of the colony travel to oversee the bail, leaving the women by themselves for two days to determine how they will proceed. They hold a vote to decide whether to stay and do nothing, stay and fight, or leave. The vote is tied between staying and fighting, and leaving. Eleven of the colony's women are chosen to come to a final decision and gather in a hayloft, though one woman in the \"do nothing\" camp leaves the meeting after becoming disillusioned with the discussion, taking her hesitant daughter and resistant granddaughter with her. The colony's schoolteacher, one of the only remaining men, joins the women to record the meeting, as none of the women were taught to read or write. One woman, just back from a trip to gather antibiotics to treat her assaulted young daughter, remains adamant about staying and fighting, an opinion shared by another. A pregnant woman suggests that they stay and, after winning the fight, create a new set of rules for the colony that would give the women equality. Another woman disagrees, believing that forgiveness is the only viable option. To defuse the conflict, the pregnant woman suggests the schoolteacher create one document stating the pros and cons of leaving, and another document with those for staying. The meeting is adjourned. During the break, it is revealed that the schoolteacher is from an excommunicated family, but was recently granted permission to return and teach. He and the pregnant woman were good friends in childhood, and he has had romantic feelings for her since, but she tells him she cannot marry him as she believes that she would cease to be her true self if she marries. When some of the women go outside to be counted for the census, they learn that an abusive husband will return that evening to collect more bail money. The meeting resumes. Two women change their minds in favor of leaving. Another remains insistent upon fighting, angrily confessing that she would rather kill the men than put her daughter at risk any longer. However, she changes her opinion after being reminded by her mother of the principles of their faith. The only one remaining unconvinced is a woman who eventually agrees to leave after an argument. Their reasons for leaving are to ensure the safety of their children, to be steadfast in their faith, and to have freedom of thought. They decide to try to take boys aged fifteen years and younger with them, but will not force any boy over age twelve. They prepare to leave at sunrise, concealing their plans. The schoolteacher posts the documents stating the pros and cons of leaving and staying on the walls as an \"artifact\" of the women's time in the colony. He declares his love to the pregnant woman and gives her a map. Before they can leave, a transgender man who is selectively mute tells a woman that her teenage son has fled and hidden. He is found, but cannot be convinced to leave in enough time. The woman breaks the rules, sprays her son with tranquilizer, forcing him to leave with them. She reveals this only to the schoolteacher, who understands and does not question her. He asks her to look after the pregnant woman, and reveals his intent to kill himself once the women are gone. She instead asks him to teach the boys properly to prevent any further violence. Some additional women join the group, while others watch as they depart. Sometime later, the pregnant woman's newborn baby is shown, with a suggestion that it will live a life very different from the one the women endured."
}