{
  "obfuscated_plot": "In the spring of 1923, near the end of a civil war, on a small island off the coast of a country, a fiddler abruptly begins ignoring his lifelong best friend and drinking companion. When a hurt Friend presses Musician for an explanation, he says that Friend is too dull, and he would rather spend the remainder of his life composing music and doing things for which he will be remembered. Friend is devastated and refuses to accept the situation, while Musician only becomes more resistant to his old friend's attempts to make amends, eventually giving Friend an ultimatum: every time Friend talks to him, Musician will cut off one of his own fingers. The local policeman beats his troubled son Young Man severely for drinking his alcohol, and Friend and his sister, Sister, take Young Man in for a night. While delivering milk to the market, Friend is insulted by Policeman and retaliates by making public the fact that Policeman abuses his son. Policeman punches him to the ground. Having witnessed this, Musician drives Friend home; the two do not speak. Sister and Young Man try to defuse the pair's feud, to no avail. Friend drunkenly confronts Musician and berates him for throwing away their friendship, as well as for drinking with Policeman, whom he publicly accuses of molesting Young Man. After Sister leads Friend away, Musician says that this is the most interesting Friend has ever been, which Young Man overhears. The next morning, not remembering what he has said, Friend attempts to apologise to Musician, but the conversation goes badly. Musician responds by cutting off his left index finger and throwing it at Friend's door. Friend later sees Musician meeting with Visitor, a fiddler from the mainland. Jealous, Friend tricks Visitor into returning home by lying that his father was hit by a delivery vehicle. As the tensions worsen, local elder Old Woman warns Friend that death will come to the island soon. Young Man tells Friend what Musician said about him in the pub; encouraged, Friend tells Young Man what he did to Visitor, but Young Man, disappointed, rejects him as mean and refuses to speak to him anymore. Thereafter, Sister sympathetically rejects Young Man's romantic advances. Friend gets drunk and starts another confrontation with Musician at Musician's house; Musician says he has finished composing his song and seems finally open to renewing their friendship, but Friend drunkenly reveals what he did to Visitor. Instead of meeting Friend at the pub, Musician cuts off all four of his remaining left fingers and throws them at Friend's door. Fed up by the feud and long bored with life on the island, Sister moves to the mainland for a job in a library. Devastated, Friend comes home to find his pet donkey has choked to death on one of Musician's fingers. He confronts Musician at the pub; Musician offers a truce, but an embittered Friend informs him that he will burn his house down the next day at 2 pm. At the promised time the next day, Friend does so; he looks in a window and sees Musician calmly sitting inside. Friend takes Musician's dog with him to save him from the fire. Policeman watches Friend burn down the house, and as he rushes to Friend's house to confront him, he encounters Old Woman, who leads Policeman to Young Man's corpse in the lake. After returning home, Friend writes a letter to Sister that says the donkey is doing well and glosses over his lonely, friendless life. The next morning, Friend takes the dog back and finds Musician, who survived the fire, standing on the beach beside his burnt-out house. Musician apologises for the donkey's death and suggests destroying the house has ended their feud; Friend replies that it would have ended only if Musician had stayed inside. Musician wonders whether the civil war is coming to an end; Friend replies he is sure the fighting will begin again soon because some things there's no moving on from, adding that he thinks that is a good thing before leaving. Unbeknownst to either, Old Woman silently watches them from the remains of Musician's house."
}