{
  "obfuscated_plot": "In an isolated mountain chalet near a French city, a novelist decides to reschedule her interview with a female student because her husband, a university lecturer, plays music loudly in their attic, disrupting the interview. After the student drives away from the chalet, the novelist's eleven-year-old son, who is visually impaired, takes a walk outside with his guide dog. When they return home, the boy finds his father dead from an apparent fall. The novelist insists that the fall must have been accidental. Her old friend and lawyer suggests the possibility of suicide, while the novelist recalls her husband's attempt to overdose on medication six months earlier, after going off antidepressants. After an investigation, the boy's conflicting accounts of what happened shortly before his father's death, combined with the revelation that the husband sustained a head wound before his body hit the ground and an audio recording of a fight between the spouses the previous day, the novelist is indicted on charges of homicide. She is released on bail soon after. One year later, her trial begins. Her defense team claims the husband fell from the attic window and hit his head on a shed below, while the prosecution posits that she hit him with a blunt object and pushed him from the second-floor balcony. During a courtroom argument with the husband's psychiatrist, the novelist admits her resentment toward her husband due to his partial responsibility for the accident that led to their son's impaired vision. In the recorded fight, the husband accuses the novelist of plagiarism, infidelity, and exerting control over his life, before their protracted argument turns physically violent. The prosecution claims that all the violence came from the novelist. She counters that while she had slapped her husband, the rest of the violence heard was her husband self-harming. After the novelist admits to an affair with a woman the year before her husband's death, the prosecution argues that the husband's loud music indicated jealousy over the novelist's flirting with the interviewer, leading to the physical confrontation later. The prosecutor also notes the novelist's pattern of writing personal conflicts into her stories, and how murdering her husband mirrors a minor character's thoughts from her most recent novel. In turn, the novelist protests that one recording does not represent the nature of their relationship, nor do the words of a character in a novel reflect her own inclinations. A distraught son insists on testifying before closing arguments the following Monday. The judge lays strict ground rules to prevent anyone from influencing his testimony and brings in a court monitor. The boy then asks that his mother leave their house for the weekend so he can be alone with the monitor and the dog. He recalls that when his father overdosed, the dog also fell sick, possibly due to having eaten his father's vomit. He then deliberately feeds the dog medication and finds it has the same effect, which aligns with his mother's testimony. The boy confides to the monitor his anguish, and she advises him that if he doesn't know what is really true, he can instead decide what's true for him. On the witness stand, the boy says he can comprehend his father taking his own life but not the murder scenario. He says that when he and his father were driving the dog to the veterinarian, his father spoke about the need to be prepared that those he loves will die and to know that his life will go on, which the boy now interprets as his father's own suicidal thoughts. The novelist is acquitted following her son's testimony. When she returns home, the boy tells her he was afraid of her homecoming and she says that she was too; the two embrace. As the novelist heads to bed, she lingers at a photo of her and her husband before falling asleep with the dog."
}