{
  "obfuscated_plot": "In 1943, a concentration camp commandant lives with his wife and their five children in an idyllic home next to the camp. The commandant takes the children out to swim and fish, and his wife spends time tending the garden. Non-Jewish inmates handle the chores, and the murdered prisoners' best belongings are given to the family. Beyond the garden wall, gunshots, screaming, and the sounds of trains and furnaces are often audible. The commandant approves the design of a new crematorium created by an engineering company. One day, he notices human remains in the river and gets his children out of the water where they have been playing. On another day, he chastises military personnel for damaging lilac bushes around the camp. At night, while the commandant reads a fairytale to his daughters, a young girl sneaks out and hides food at the prisoners' work sites. The wife's mother comes to stay, and is impressed and pleased by the material status her daughter has achieved. The commandant receives word that he is being promoted to deputy inspector of concentration camps and must move to another city near the capital. He objects, and withholds the news from his wife for several days. His wife asks him to convince his superiors to let her and the children remain in their home; the request is approved. Before he leaves, a woman comes to his office and prepares herself for sex. Meanwhile, the young girl finds sheet music composed by a prisoner, which she plays on the piano at her home. The wife's mother departs unannounced after seeing and smelling the burning crematorium at night. She leaves a note that upsets the wife, causing her to lash out and threaten her servants. In the capital, in recognition of the commandant's work, a high-ranking official tells him he will be heading an operation that will transport hundreds of thousands of prisoners to his camp to be killed. This will allow him to move back to the camp and reunite with his family. He vacantly attends a party organized by a military administrative office. Afterwards, he tells his wife over the phone that he spent his time at the party thinking about the most efficient way to gas the attendees. As he leaves his office and descends a stairway, he stops, retches repeatedly and stares into the darkness of the building corridors. In the present day, a group of janitors clean a museum at the former camp site. Back in the past, the commandant continues downstairs, descending into darkness."
}