{
  "obfuscated_plot": "In the late 19th century, a medical student is recruited by a mad scientist to record the behavior of a strange, nearly mute woman living in his house. The scientist reveals that her body is of a woman who died by suicide, and he replaced her brain with that of her unborn fetus, giving her an infant's mind. As weeks pass, the woman's vocabulary improves and she exhibits childlike wonder at the world. With the scientist's encouragement, the medical student falls in love with her and proposes marriage. She accepts, but soon discovers sexual pleasure and runs off with a debauched lawyer to a European city. There, they have near-constant intercourse because she has no understanding of anything beyond physical pleasure. As she becomes difficult for the lawyer to control, he smuggles her onto a cruise ship, where she befriends two passengers who open her mind to philosophy. The lawyer attempts to stunt her growth to no avail, and indulges in drinking and gambling. During a stop in a North African city, she witnesses the suffering of the poor and becomes distraught. Wishing to help them, she entrusts the lawyer's winnings to unscrupulous crew members, who falsely promise to distribute it. Unable to afford the rest of the trip, they are dropped off in a French port city and make their way to another French city, penniless. Seeking money and accommodation, she is coerced into working at a brothel. Enraged, the lawyer breaks down, and she abandons him. At the brothel, she comes under the tutelage of a madame and begins a relationship with a fellow prostitute, who introduces her to socialism. Now terminally ill, the scientist asks the medical student to bring her to him. The student finds her after tracking down the lawyer, who has been institutionalized. Back in their original city, she reconciles with the scientist and renews her plans to marry the medical student, but their wedding is interrupted by the lawyer and a military general. The general declares that they were married before her disappearance and has come to reclaim her. She leaves the medical student to learn of her past life but is exposed to the general's violent and sadistic nature. She partially realizes that she was his wife and that she killed herself to escape him. The general confines her to his mansion and plans to mutilate and impregnate her, threatening her with a gun. She throws a sedative in his face, and he accidentally shoots himself in the foot and passes out. She returns to the scientist's house and, with the medical student's help, transplants an animal's brain into the general's head. The scientist dies peacefully with her and the medical student by his side. She, the medical student, and the prostitute begin a new life in the scientist's house, while the general eats grass happily."
}