{
  "obfuscated_plot": "A stereotypical fashion doll and her fellow dolls reside in a matriarchal toy world populated by different versions of female dolls, male dolls, and a group of discontinued models who are treated like outcasts due to their unconventional traits. While the male dolls spend their days playing at the beach, considering it their profession, the female dolls hold prestigious jobs in law, science, politics, and so on. One specific male doll is only happy when he is with a particular female doll, and he seeks a closer relationship with her, but she rebuffs him in favor of other activities and female friendships. One evening at a dance party, the female doll is suddenly stricken with worries about mortality. Overnight, she develops physical imperfections that disrupt her routines and impair her classic perfection. A disfigured doll tells her to find the child playing with her in the real world to cure her afflictions. She travels to the real world, with a male doll joining her by stowing away in her vehicle. After arriving at a beachside location, she punches a man after he gropes her and is briefly arrested. The corporate headquarters of the toy manufacturer orders their recapture. She tracks down her owner, a teenage girl who criticizes her for encouraging unrealistic beauty standards. Distraught, she discovers that a corporate employee and the girl's mother inadvertently caused her existential crisis after playing with old dolls and drawing them with dark emotions. The corporation attempts to recapture her, but she escapes with the help of a mysterious elderly woman. \n\nThe employee, her daughter, and the doll travel to the toy world with corporate executives in pursuit. Meanwhile, the male doll learns about systemic male dominance and feels respected for the first time. He returns to the toy world to persuade the other male dolls to take it over. The male dolls begin to indoctrinate the female dolls into submissive roles. The female doll attempts to convince the other dolls to be independent again but becomes depressed when she fails. The employee expresses frustration with conflicting societal standards for women. Her speech restores the female doll's confidence. With assistance from her daughter, an outcast doll, another supporting character, and the discontinued dolls, they deprogram the female dolls from their indoctrination. The female dolls then manipulate the male dolls into fighting among themselves, allowing them to regain power. \n\nHaving experienced systemic oppression, the female dolls resolve to rectify the faults of their previous society, emphasizing better treatment of the male dolls and all outcasts. The main female and male dolls make amends, acknowledging their past mistakes. When the male doll feels purposeless without the female doll, she encourages him to find an autonomous identity. The female doll, unsure of her own identity, meets with the spirit of the toy company's co-founder, who explains that her story has no set ending and continues to evolve. After bidding goodbye to the other dolls and corporate executives, she decides to become human and return to the real world. Later, the employee, her husband, and daughter take the now-human doll to her first medical appointment."
}