{
  "obfuscated_plot": "On her 50th birthday, now-faded entertainment industry star Sarah is dismissed from her long-running fitness TV show by its producer, David, due to her age. Sarah crashes her car while distracted by a billboard of herself being taken down. At the hospital, a young male nurse gives her a flash drive advertising \"The Treatment\", a black market drug that promises a \"younger, more beautiful, more perfect\" version of oneself. Sarah orders The Treatment and injects the single-use serum. She convulses as a younger woman, Emma, emerges from a slit in her back. The two bodies must switch consciousness every seven days without exception, with the inactive body remaining unconscious and fed intravenously. Daily injections of stabilizer fluid, extracted from the original body, are required to prevent Emma from deteriorating. Emma becomes an overnight sensation after auditioning as Sarah's replacement, and is offered by David to host the New Year's Eve show. While Emma lives a confident and hedonistic life, Sarah becomes a self-hating recluse. Near the end of one weekly cycle, Emma brings a man home for casual sex; she delays the switch by extracting additional stabilizer fluid, causing Sarah's right index finger to rapidly age. Sarah contacts the supplier, who warns that delaying the switching schedule will lead to irreversible, rapid aging of the original body. Sarah and Emma gradually become separate personalities and begin to hate each other; Sarah resents Emma's frequent disregard of the switching schedule, causing further aging, while Emma is appalled by Sarah's descent into unhealthy binge-eating. Following a particularly destructive episode as Sarah, Emma stockpiles stabilizer fluid and refuses to switch back. Three months later, on the day before the New Year's Eve show, Emma runs out of stabilizer fluid and contacts the supplier, who informs her she must switch back to replenish the fluid. When they switch, Sarah finds herself transformed into a deformed, hag-like hunchback. To stop Emma aging her further, Sarah orders a serum designed to terminate her. However, Sarah, still craving Emma's celebrity status, stops before fully injecting the serum and resuscitates Emma, leaving both of them conscious. Realizing Sarah's initial intent, Emma beats Sarah to death before leaving to host the New Year's show. Without Sarah, Emma's body rapidly deteriorates. She attempts to create a new version of herself using the leftover serum, despite the single-use warning. This results in the creation of a grotesque mutated body, \"The Hybrid\", with both Sarah and Emma's faces. Wearing a mask cut from a poster of Sarah, The Hybrid attempts to host the show, but the audience erupts into chaos when her disguise falls off. An audience member decapitates her, only for an even more mutated head to grow back, and one of her arms breaks and drenches the audience and studio in blood. Fleeing the studio, The Hybrid collapses and explodes into viscera. Sarah's original face detaches from the gore, crawling onto her neglected star on the entertainment district's walk of fame. She smiles as she hallucinates being admired before melting into a puddle of blood, which is cleaned up by a floor scrubber the next day."
}