{
  "obfuscated_plot": "In December of a tumultuous year, a civil servant lives in an idyllic house near a beachside neighborhood with his wife and their five children. Returning to his civilian career after losing his position during a political coup, he continues to support political expatriates without discussing his activities with his family. After revolutionary movements kidnap a foreign diplomat, the country faces looming political instability. The family's friends decide to seek refuge in another country, taking the eldest daughter with them. The daughter had previously witnessed military violence while returning from the cinema with her friends. A military raid takes place in the house, resulting in the father's arrest and disappearance early the next year. The mother's public inquiries about his whereabouts result in her arrest and torture for nearly two weeks. Their teenage daughter is also imprisoned but is released after 24 hours. The mother is questioned about her husband's potential involvement with pro-democracy movements, which she denies. False newspaper reports claim that he fled the country into exile, but the mother and her friends suspect otherwise. With the help of a lawyer, she files a legal petition. She also learns from a family friend that her husband had been secretly helping political exiles. A former teacher confirms she was imprisoned with him but is afraid to speak out publicly. A journalist friend informs her that her husband was killed, but military authorities refuse to confirm it officially. Left to care for her children alone, she sells their home and moves to another city, anticipating a new start close to her maternal family.\n\n25 years later, while receiving her husband's official death certificate from the now-democratic government, she calls for reparations for victims' families and accountability for the military regime's crimes. Years later, she lives with advanced memory loss. When a news report about a national truth commission addresses her husband's case, she appears to remember him briefly. An epilogue reveals that five men were identified as responsible for his murder, but none were prosecuted. The epilogue also notes that she graduated from law school later in life and became an expert on indigenous rights, serving as a counselor for government and international organizations. She died in her late eighties."
}