{
  "year": "1928",
  "name": "The Patriot",
  "plot": "In Imperial Russia, Tsar Paul I (Emil Jannings) rules through fear, paranoia, and erratic cruelty. A tyrant haunted by dread, Paul lives in constant suspicion of everyone around him, believing that he, like some of his ancestors, is doomed to be assassinated. Despite his mistrustful nature, he places intermittent trust in one man: Count Pahlen (Lewis Stone), his Prime Minister. Pahlen skillfully manages the emperor like a child, maintaining an unassailable political position. Privately, Pahlen is in love with Countess Ostermann (Florence Vidor), the wife of a military officer. Their affair is interrupted when her husband unexpectedly returns. As he picks up one of Pahlen’s boots to hurl it out the window in a rage, he is shot and killed by a Cossack guard—one of the Tsar’s decrees forbids anyone from being visible at a window during his passage. While Pahlen is deeply loyal to Russia, he is also tormented by the suffering Paul inflicts on the nation. Torn between duty and patriotism, he determines to bring about the Tsar’s downfall. He recruits Stephan (Harry Cording), a soldier recently punished by Paul for minor uniform violations, promising him vengeance and assigning him as his bodyguard. At St. Michael’s Castle, Paul obsesses over trivialities like the number of gaiter buttons, while foreign and domestic affairs languish. Meanwhile, Pahlen begins to rally conspirators at court. He appeals to Crown Prince Alexander (Neil Hamilton), an idealist who dreams of a better Russia. But when the prince refuses to support treason, Pahlen reports him to Paul as a traitor, knowing full well the emperor already resents the popularity of his own son. Paul immediately places Alexander under arrest. With the conspiracy in motion, Pahlen devises a plan: Paul will be pressured to abdicate, and if he refuses, he will be assassinated. But Paul suddenly announces he is leaving the city with his mistress, Mademoiselle Lapoukhine (Vera Voronina), derailing the carefully timed plot. To keep Paul in the capital, Pahlen shows him a snuff box with a hidden portrait of Countess Ostermann. Obsessed, Paul cancels his trip and demands to meet the Countess. Pahlen orchestrates the meeting and deliberately leaves the two alone. Paul clumsily propositions her. Betrayed and disgusted, the Countess reveals Pahlen’s plot to assassinate him. Summoning Pahlen, Paul demands an explanation. Calmly, Pahlen claims he infiltrated the conspiracy to expose the plotters. He offers his life in exchange for the Tsar’s trust. Satisfied, Paul retires to his chambers. That night, the assassination proceeds. As the Tsar lies in uneasy sleep, conspirators enter his room. Paul pleads with them: “I am the Tsar by Divine Right!”—but his words delay, not deter. From behind, Stephan emerges and murders the Tsar. Outside, bells toll and the people celebrate the rise of the new emperor. In his study, Pahlen awaits the cost of his actions. Stephan appears with a pistol. As the clock strikes the hour, a shot rings out—Pahlen is mortally wounded. The Countess arrives too late. Cradled in her arms, Pahlen declares with his final breath:\n“I have been a bad friend and lover—but I have been a ‘Patriot’.”",
  "wiki": "https://en.wikipedia.org/wiki/The_Patriot_(1928_film)"
}