{
  "year": "1930",
  "name": "Skippy",
  "plot": "Skippy ( Jackie Cooper ) is the feisty son of the strict Dr. Herbert Skinner ( Willard Robertson ) and his wife Ellen ( Enid Bennett ) who live in Morrisville, Indiana. Skinner forbids Skippy to play in the pauperized Shantytown, because of its filth and criminal surroundings. Regardless, Skippy and his friend Sidney ( Jackie Searl ) visit Shantytown, where Skippy meets a new boy named Sooky ( Robert Coogan , Jackie Coogan 's little brother). He saves Sooky from the bully Harley Nubbins ( Donald Haines ), and Skippy and Sooky become friends. One day, Harley accidentally breaks his father's windshield with Skippy's yo-yo. Harley, whose father is brutish and aggressive, blames the damage on Skippy and Sooky. Mr. Nubbins ( Jack Rube Clifford ), who works as a dogcatcher, takes Sooky's dog and demands the two boys pay for the damages if they want their dog back. Skippy and Sooky gather three dollars by breaking Skippy's savings bank, but Mr. Nubbins accepts it only for his windshield. He gives them three days to obtain another three dollars for a dog license, and he threatens to kill their dog if they don't get him the money. Sooky and Skippy spend the next two days selling bottles, lemonade and wood, and staging a performance to earn money, but Skippy's father doesn't want to lend them the remaining thirty cents. Mr. Nubbins kills the dog and Skippy blames his father. The next morning, Skippy gets a new bicycle from his father but trades it to his friend, Eloise ( Mitzi Green ), for her new dog. He then takes the dog to Sooky. Dr. Skinner has a change of heart and buys Sooky a licensed dog, finds his mother a job, and refrains from ordering Shantytown destroyed, instead offering assistance to its citizens. For the first time, Dr. Skinner plays with Skippy in Shantytown. There they accidentally break Mr. Nubbins' new windshield. Dr. Skinner wins a fight against Mr. Nubbins and shows he is a good father.",
  "wiki": "https://en.wikipedia.org/wiki/Skippy_(film)"
}