{
  "year": "1931",
  "name": "The Champ",
  "plot": "Andy \"Champ\" Purcell ( Wallace Beery ) is the former world heavyweight champion, now down on his luck and living in squalid conditions with his eight-year-old son \"Dink\" in Tijuana, Mexico . Champ attempts to convince promoters to set up a fight for him, but his efforts are stymied by his alcoholism . Dink is repeatedly disappointed by his father's irresponsible actions and frequent broken promises, but his devotion to his father never wavers. Champ is also a compulsive gambler—another vice he repeatedly promises to give up. After a winning streak, he fulfills a previous promise to buy Dink a horse, which they name \"Little Champ\" and plan to race. At the track, Dink encounters a woman who, unbeknownst to either of them, is his mother, Linda, now remarried to a wealthy man named Tony. Linda and Tony observe Dink and Champ together and realize that Dink is her son. Champ allows Linda to see Dink, who accepts that she is his mother. But he feels no emotion toward her, as she has never been part of his life. Linda resolves to remove Dink from the miserable atmosphere in which he's growing up and have him live with her family. Tony catches Champ during an all-night gambling binge and asks him to turn Dink over so that he and Linda can enroll the boy in school. Champ refuses. By the end of the night, he has lost Little Champ, devastating Dink. Champ then asks Linda for money to buy the horse back, and she agrees. However, instead of using it as promised, he gambles the money away and ends up in jail, breaking Dink’s heart once again. Ashamed, Champ finally agrees to send an unwilling Dink to live with Tony and Linda. On the train ride home, Tony and Linda try their best to welcome Dink into their family. He does not dislike them, but he is consumed only by thoughts of his father. He runs away back to Tijuana, where he finds that Champ has a fight scheduled with the Mexican heavyweight champion.  When he sees Dink, Champ returns to good spirits, trains hard, and, for the first time, really does stay away from drinking and gambling. Champ is determined to win the fight, make Dink proud of him, and use his prize money to buy back Little Champ. Tony and Linda attend the fight, bringing best wishes and assurances that they will make no further efforts to separate Dink from Champ. The match is brutal, and Champ is seriously injured. Dink and the others in his corner urge him to throw in the towel, but Champ refuses. He musters a last burst of energy and knocks out his opponent. After the fight, he triumphantly presents Little Champ to Dink. But after witnessing his son's overjoyed reaction, Champ collapses. He is brought into his dressing room, where a doctor determines that his injuries are fatal. Champ encourages Dink to stay strong, then dies. Despite others' attempts to comfort him, Dink cries out repeatedly, \"I want the Champ!\" Eventually, he sees Linda enter the room, looks at her, and exclaims, \"Mother!\" before running into her arms. She picks him up, and he sobs, \"The Champ is dead, Mama.\" Holding him close, she turns and carries him out as he buries his face in her shoulder, weeping.",
  "wiki": "https://en.wikipedia.org/wiki/The_Champ_(1931_film)"
}