{
  "year": "1932",
  "name": "State Fair",
  "plot": "In the fictional town of Brunswick, Iowa, farmer Abel Frake prepares to transport his Hampshire pig , Blue Boy, to compete at the hog contest at the Iowa State Fair. Confident he will win the first-place prize, and nothing bad will happen, Abel bets five dollars against his neighbor Fred Cramer. Abel's wife Melissa, is preparing pickles and mincemeat for the food competition. Against his wife's insistence, Abel secretly adds apple brandy. Unsure about her chances of winning, Melissa adds the remaining brandy. Meanwhile, Abel's daughter Margy reconnects with childhood friend Harry Ware. He is unable to attend the fair because he is preoccupied with his dairy farm. Margy's brother, Wayne, arrives home from college to attend the fair. After the Frakes arrive at the fair, Abel notices Blue Boy appears ill. At a carnival hoop toss game, Wayne throws the rings perfectly and meets Emily Joyce, a trapeze artist. Later that night, Wayne and Margy venture out to the circus fair. Wayne separates from his sister, and sees Emily perform a trapeze stunt. Meanwhile, Margy rides the roller coaster ride, seated next to Pat Gilbert, a newspaper reporter. When the roller coaster descends rapidly, Gilbert holds her tightly. After their ride together, the two bond over their connection to Brunswick, and have lemonade. The next morning, Melissa notices how emotionally elevated her two children are. Abel inspects Blue Boy, in which the hog appears to be healthy again. Back at the circus, Pat reconnects with Margy, in which they decide to be friends rather than romantic lovers. They plan to meet again at Melissa's competition, which Pat is covering for his newspaper. At the food competition, Melissa wins the first-place prize for both her pickles and mincemeat. Having fallen in love, Pat and Margy then watch a harness horse race and walk through the woods later that night. Back at Emily's place, she and Wayne share drinks. Emily changes into her nightgown, and the two sleep together. The next morning, Abel tries to wake up Blue Boy for the hog contest, succeeding at the last minute. The hog judges inspect Blue Boy and award Abel first prize. Later that night, Wayne apologizes to his father for missing the hog contest. Wayne and Margy both leave for their final night at the fair. Alone with Melissa, Abel reads in the newspaper that one of the food judges is sick from delirium after eating Melissa's brandy-spiked mincemeat. Despite their love, Emily decides not to marry Wayne. On their final night, Margy tells Pat about her feeling for Harry back home. Meanwhile, Abel and Melissa enjoy the amusement rides together. As the Frakes leave the state fair, Melissa notices her children's despondent demeanor. Back home, Melissa confesses putting apple brandy in her mincemeat. Abel collects his five-dollar bet from Fred. Margy, still depressed, receives a phone call from Pat and runs out into a rainstorm to reunite with him.",
  "wiki": "https://en.wikipedia.org/wiki/State_Fair_(1933_film)"
}