{
  "year": "1932",
  "name": "A Farewell to Arms",
  "plot": "On the Italian front during World War I, Lieutenant Frederic Henry is an American serving as an ambulance driver with the Italian Army . While carousing with his friend, Italian captain Rinaldi, a bombing raid takes place. Frederic meets English Red Cross nurse Catherine Barkley in a dark stairway. Frederic is inebriated and makes a poor first impression on Catherine and her friend Fergie. At a concert, Catherine reveals that she had been engaged to a soldier who was killed in battle. Frederic tries to kiss her and she slaps him, but soon after, she asks him to kiss her again. He seduces her and tells her that he loves her. Before departing for the front, Frederic tells Catherine that he will survive the battle unscathed. Catherine gives him her St. Anthony medal. However, Rinaldi had orchestrated the separation. Catherine is transferred to Milan . At the front, Frederic is badly wounded by an artillery shell. He is sent to a hospital in Milan where Catherine rushes to his bed to embrace him. A priest performs an unofficial wedding for Frederic and Catherine. Months later, Fergie admonishes them for marrying and warns Frederic that she will kill him if Catherine becomes pregnant. Back at the hospital, Frederic is informed that his convalescent leave has been canceled. While waiting for his train, Catherine tells Frederic that she is scared of each of them dying. He promises that he will always return. Later, Catherine reveals to Fergie that she is pregnant and that she is traveling to Switzerland to give birth. While apart, Catherine writes letters to Frederic, never revealing her pregnancy. In Turin , Rinaldi tries to entice Frederic to have some fun, but Frederic is intent on writing to Catherine. Rinaldi secretly ensures that all of Catherine's letters are returned to her without reaching Frederic. The hospital at Milan also returns Frederic's letters. He deserts and travels to Milan to find Catherine. In Milan, Frederic finds Fergie, who refuses to tell him anything other than that Catherine was pregnant and has gone. Rinaldi reveals to Frederic that Catherine is going to have a baby and that she is in Brissago , apologizing for his part in keeping the lovers apart. While Frederic is rushing to Brissago, Catherine is taken to a hospital as the time of birth is near. Frederic arrives as Catherine undergoes a Caesarean section . After the operation, a surgeon tells Frederic that the baby boy was stillborn. When Catherine regains consciousness, she and Frederic plan their future, but she fears that she will die. Frederic tells her that they can never really be parted. She dies in Frederic's arms as the sun rises. Frederic lifts her body and turns slowly toward the window sobbing, \"Peace, Peace.\"",
  "wiki": "https://en.wikipedia.org/wiki/A_Farewell_to_Arms_(1932_film)"
}