{
  "year": "1932",
  "name": "Little Women",
  "plot": "Set in Concord, Massachusetts , during and after the American Civil War , the film is a series of vignettes focusing on the struggles and adventures of the four March sisters and their mother, Marmee, while they await the return of their father, a colonel and chaplain in the Union Army . Spirited tomboy Jo dreams of becoming a famous author, and she writes plays for the family to perform for the local children. She also spends several hours every week reading to her Aunt March, though she dislikes it. Amy is pretty but selfish, Meg works as a governess, and sensitive Beth practices on her clavichord . The girls meet Laurie, who has come to live with his grandfather, Mr. Laurence, their wealthy next-door neighbor. Laurie invites them to a lavish party where Meg meets and becomes interested in his tutor, John Brooke. While Beth and Amy sit on the stairs and watch the party, they meet Mr. Laurence. Mr. Laurence is impressed by Beth's love for music and offers to let her use his piano. During the next several months, John courts Meg, Beth regularly plays Mr. Laurence's piano, and Jo's first short story is published. Meanwhile, Laurie falls in love with Jo, who sees them as no more than best friends. Marmee travels to Washington, D.C. , after learning that her husband is recuperating from an injury in a hospital there. During her absence, Beth contracts scarlet fever from a neighbor's baby and nearly dies. Worried about Beth, the March parents return. Beth recovers but remains in a weakened condition. Later, Meg marries John, which upsets Jo because she wants things to stay the way they are. After the newly-married couple leaves, Laurie confesses his love to Jo, who rejects him. Wanting time to consider her relationship with Laurie, Jo moves to New York City to pursue her writing career. While there, she lives in a boarding house where she meets Professor Bhaer, an impoverished German linguist . With his help and encouragement, Jo improves her writing and resolves her confused feelings about Laurie, who has been living in Europe. Still suffering from the effects of scarlet fever, Beth is near to death. Jo finds out after an evening with the professor and promptly returns to Concord to be with her family. After Beth dies, a grieving Jo learns that Amy, who accompanied Aunt March to Europe, has fallen in love with Laurie and accepted his proposal. Upon the return of Laurie and Amy, who are now married, Jo is happy for them. While the family celebrates, Professor Bhaer arrives from New York City and brings Jo's manuscript for Little Women , which is soon to be published. He confesses his love to Jo and proposes. Jo accepts, welcoming him to the family.",
  "wiki": "https://en.wikipedia.org/wiki/Little_Women_(1933_film)"
}