{
  "year": "1934",
  "name": "It Happened One Night",
  "plot": "Wall Street heiress Ellie Andrews has eloped with glamorous pilot King Westley. Her father Alexander senses that Westley married Ellie for her money. Mr. Andrews sequesters Ellie on his Florida yacht while his lawyers arrange an annulment . However, Ellie breaks out and swims to shore, where she boards a Greyhound bus bound for New York City to reunite with Westley. Mr. Andrews makes headlines by putting out a $10,000 reward (equivalent to $235,050 in 2024) for her safe return. On the bus, Ellie meets Peter Warne, a newly unemployed newspaper reporter. Peter is annoyed by Ellie, who expects special treatment and lacks practical life skills. However, he is drawn to Ellie's strong personality and helps her after a thief steals most of her money. During a scheduled stop in Jacksonville , Ellie misses the bus, having assumed that the driver would wait for her. Peter reads the headlines about Ellie's escape and stays behind to accompany her. He gives her a choice: if she gives him an exclusive on her story, he will help her get back to New York. If not, he will tell her father where she is. Ellie agrees. Because there are no more buses that day, Peter and Ellie rent a motel room together. Peter strings up a makeshift room divider between their respective beds, which he jokingly calls the \" walls of Jericho \". In the morning, Mr. Andrews' private detectives question Peter and Ellie. They evade the detectives by pretending to be a married couple having a stormy argument. When the next bus ditches into a swamp, Peter and Ellie try hitchhiking . They argue about Ellie's privilege and Peter's cockiness, but begin to fall in love. Peter tries and fails to hail a series of cars, while Ellie succeeds on her first attempt by displaying a leg. However, the driver Ellie hails is a highwayman who drives away with their luggage. Peter chases him down and steals his car, allowing them to continue their journey. At a motel in New Jersey , Ellie confesses her love to Peter, who is moved, but rebuffs her advances because he considers himself unworthy of Ellie as long as he remains unemployed. In the early morning, he drives to New York to sell his story to his old newspaper for $1,000. Because he leaves without Ellie, the motel concludes that Ellie is a loose woman and evicts her. Ellie believes that Peter has deserted her and calls her father to drive her home. On her way back, she passes by Peter, who realizes he is too late. Mr. Andrews reluctantly arranges a second, formal wedding with Westley, but shortly before the ceremony, Ellie confesses to her father that she is in love with Peter. She resolves to marry Westley anyway after Peter reaches out to Mr. Andrews about a \"financial\" matter, which she assumes is the $10,000 reward. In reality, Peter just wants Mr. Andrews to reimburse him for his expenses from the trip, which come out to $39.60. Mr. Andrews is impressed by Peter's honesty and asks him whether he loves Ellie; after dodging the question several times, Peter admits that he loves her. While walking Ellie down the aisle, Mr. Andrews reveals Peter's full story. He expresses his approval of Peter and says that if Ellie changes her mind, he will help her escape the wedding and pay Westley to go away. At the last minute, Ellie dumps Westley at the altar. As Mr. Andrews predicted, Westley agrees to give up Ellie for $100,000. Peter, who is anxiously waiting for the annulment to go through before he can sleep with Ellie, telegrams Mr. Andrews that \"the walls of Jericho are toppling\". Mr. Andrews confirms that Peter can \"let 'em topple\". At the honeymooners' motor court, the owners hear a trumpet play and a blanket fall to the floor in the couple's cabin, after which the lights go out.",
  "wiki": "https://en.wikipedia.org/wiki/It_Happened_One_Night"
}