{
  "year": "1934",
  "name": "The Thin Man",
  "plot": "Dorothy Wynant discusses her upcoming wedding with her father Clyde. She is surprised that her fiancé, Tommy, knows all about her family yet still wants to marry her. Later, her father discovers that bonds worth $50,000, intended as a wedding present for his daughter, are missing. The only other person who knows the combination of the safe in which they were kept is his secretary and mistress, Julia Wolf. When he confronts Julia about the missing bonds, she confesses that she cashed them in and has only $25,000 left. He threatens to call the police unless she comes up with the other $25,000. Nick Charles is a retired detective who once did a job for Clyde. Nick and his wealthy wife, Nora, live in San Francisco but are visiting New York City for Christmas, staying in a glamorous apartment-like suite at the Hotel Normandie. While in New York, Nick is pressed back into service by Dorothy, as her father, the \"Thin Man\" of the title, had left on a secret business trip with a promise to return home before his daughter's wedding, but he has mysteriously disappeared. According to his attorney, Herbert MacCauley, he had been sending money to Wynant from time to time while Wynant was away on his trip. Dorothy convinces Nick to take the case, with the assistance of his socialite wife, who is eager to see him in action. What appears to be a missing person situation rapidly turns into a murder case when Julia Wolf is found dead and evidence points to Clyde as the prime suspect. Dorothy refuses to believe that her father is guilty. Nick and Police Lieutenant Guild visit Arthur Nunheim, a petty criminal who regularly provides information to the lieutenant. After being pressed for information, Nunheim excuses himself momentarily, only to slip away down the fire escape. Later he arranges a meeting with the yet-unidentified murderer to collect $5,000 from him, in exchange for keeping quiet about the murder. When Nunheim arrives, however, he is immediately shot four times and killed with what police find was the same gun that killed Julia Wolf. Police think Wynant is guilty of both murders after his ex-wife, Mimi Wynant Jorgenson, provides evidence that implicates him. On a hunch, Nick visits Wynant's closed shop in the dead of night and uses his dog Asta's nose to find a skeletonized, but fully dressed, body, buried under the floor. In the dark shop, Wynant's former bookkeeper, Tanner, a man known to Nick as an ex-con, suddenly appears. He had been hired by Julia Wolf and admits to having stolen money from Wynant, claiming to have come back to return the money and \"clean up the books.\" When the police arrive, they conclude that Wynant committed the murders of Julia, Nunheim, and this newly discovered body, assuming that the remains belong to the \"Fat Man\"—a long-ago enemy of Wynant's—because of its oversized clothing with a belt buckle bearing an \"R\" (for \"Rosebreen\", that notorious figure's surname). Nick—who had accompanied the medical examiner when he X-rayed the buried body—theorizes that the clothes were planted to hide the body's true identity of Clyde Wynant, as the X-ray revealed telltale shrapnel which matched Wynant's old war wound. Nick deduces that the real culprit murdered Clyde once he discovered that the killer had been embezzling from him. The culprit then murdered his own accomplice, Julia Wolf, because she knew about Clyde's murder, and after that, he murdered Nunheim since he had witnessed Julia's murder and was blackmailing him. Since Nick has already all but solved the case, he invites the full cast of suspects to an elegant dinner party to expose the murderer. Nick unfurls his theory to the dinner guests, informing them that Wynant isn't the killer, and that he saw Wynant the night before (not revealing he meant Wynant's corpse). Several guests claim to have also seen Wynant the night before. As Nick provides potential evidence about each guest as the possible murderer, Wynant's attorney Herbert MacCauley panics and tries to shoot Nick. Nick punches him out and declares MacCauley to be the murderer. After murdering Wynant and then Wolf, MacCauley had sought to clean out Wynant's bank account by making it look like Wynant was just away on a business trip. He also paid off Wynant's ex, Mimi Wynant Jorgenson, to throw police off the scent in Julia Wolf's murder, having her provide evidence to the police that would implicate her cheating ex-husband in that case. He didn't inform Mimi that Wynant was dead, and that she was entitled to her ex-husband's entire estate, not just the small bribe MacCauley paid her. Later, Nick and Nora, along with Dorothy and her new husband Tommy, celebrate as they ride a luxury train back to California. Nora, in the lower bunk, wants to sleep with Asta, but Nick tosses Asta to the upper bunk and joins Nora himself. Asta looks down on the couple and covers his eyes with his paw. The film ends with a short rendition of \" California, Here I Come \". [ 5 ]",
  "wiki": "https://en.wikipedia.org/wiki/The_Thin_Man_(film)"
}