{
  "year": "1937",
  "name": "The Awful Truth",
  "plot": "Jerry Warriner tells his wife he is going on vacation to Florida but instead disappears for two weeks without telling anyone where he is really going. He returns home, with a sunlamp tan, to find that his wife, Lucy, spent the night in the company of her handsome voice teacher, Armand Duvalle. Lucy claims his car broke down unexpectedly, but Jerry refuses to believe Lucy’s assurances that nothing untrustworthy happened. Upon seeing the oranges in the basket Jerry brought home from Florida stamped “California”, however, Lucy discovers that Jerry did not actually go to Florida. Their mutual suspicion results in divorce proceedings, with custody of their dog, “Mr. Smith,” in dispute. When the judge pronounces that he will grant custody to whomever Mr. Smith responds to when called, Lucy wins custody with concealed dog toy in her hand. The judge grants Jerry visiting rights to the dog and orders the divorce finalized in 90 days. Lucy moves into an apartment with her Aunt Patsy. Her neighbor is amiable but rustic Oklahoma oilman Dan Leeson, whose mother does not approve of Lucy. On a visitation to Mr. Smith, Jerry subtly ridicules Dan in front of Lucy, which causes Lucy defiantly to cling closely to Dan. Jerry begins dating sweet-natured but simple singer Dixie Belle Lee, unaware that she performs a vulgar act at a local nightclub where a wind machine blows her skirt up. When Lucy and Dan turn up at the nightclub and see the act, Jerry is embarrassed, and Lucy makes witticisms as payback for Jerry’s ridicule of Dan. Convinced that Lucy is still having an affair with Duvalle, Jerry bursts into Duvalle's apartment only to discover that Lucy is a legitimate vocal student of Duvalle and is giving her first recital in front of an audience. When Lucy announces her engagement to Dan, realizing he may still love Lucy, Jerry undermines Lucy's character with Mrs. Leeson, implying Lucy’s infidelity as the cause of their divorce. On a subsequent visit to Mr. Smith, Jerry arrives as Duvalle is paying an unexpected visit to Lucy. Alarmed that Jerry will think Duvalle is there at her request, Lucy asks Duvalle to hide in her bedroom while Jerry plays with the dog. During a game of hide-and-seek, Mr. Smith reveals Duvalle’s forgotten hat where Lucy hid it just before Jerry entered the salon. Meanwhile, Dan and his mother arrive; Jerry sarcastically states that he never had any doubt about Lucy’s fidelity, while Dan and his mother apologize for assuming the worst about her. Jerry discovers Duvalle hiding in Lucy's bedroom and they end up in a fistfight.  When Jerry chases Duvalle out the door, Mrs. Leeson assumes the worst is true, and Dan breaks off his engagement to Lucy; he and his mother return to Oklahoma. A few weeks later, Jerry begins dating high-profile heiress Barbara Vance, whose romance is covered in the society column. Realizing she still loves Jerry, Lucy crashes a party at the Vance mansion the night the divorce decree is to become final. Pretending to be Jerry's sister, she undermines Jerry's character, implying that \"their\" father was working class rather than wealthy. Acting like a showgirl, she recreates Dixie's risqué musical number. The snobbish Vances are appalled. Jerry attempts to explain away Lucy's behavior as drunkenness , and says he will drive Lucy home. Lucy repeatedly sabotages the car on the ride to delay their parting. Pulled over by motorcycle police officers, who believe Jerry is drunk, Lucy manages to wreck the car. The police give the couple a lift to Aunt Patsy's nearby cabin. Although sleeping in different (but adjoining) bedrooms, Jerry and Lucy slowly overcome their pride and a series of comic mishaps in order to admit \"the awful truth\" that they still love one another. They reconcile at midnight, just before their divorce is to be finalized.",
  "wiki": "https://en.wikipedia.org/wiki/The_Awful_Truth"
}