{
  "year": "1938",
  "name": "You Can't Take It with You",
  "plot": "Successful Wall Street banker Anthony P. Kirby returns from Washington, D.C. , where he completed a highly lucrative deal granting him a government-sanctioned munitions monopoly . He intends to buy a 12-block radius around a competitor's factory to force him out of business, but one household refuses to sell. Kirby instructs his real-estate broker, John Blakely, to offer the household a huge sum, and if they still refuse, to cause trouble for the family. Kirby's son Tony, a vice president in the family company, has fallen in love with a company stenographer , Alice Sycamore. When Tony proposes marriage, Alice is worried that his affluent family will look down on her family. In fact, Alice is the only relatively normal member of the eccentric Sycamore family, led by Grandpa Martin Vanderhof. Other family members include Alice's parents Penny, a playwright, and Paul, who manufactures fireworks in the cellar; her sister Essie Carmichael, an aspiring dancer who makes homemade candies; and Essie's husband Ed, a musician and printer who delivers Essie's candies. Unbeknownst to the Kirbys, Alice's family lives in the house that will not sell. Grandpa is protecting not only his property but the families and businesses in the 12-block area Kirby wants. Kirby and his wife strongly disapprove of Tony's choice for marriage. Tony not only loves Alice but feels she encourages his taste for spontaneous fun and farcical humor. Before she accepts, Alice insists that Tony bring his parents to meet their future in-laws, but when Tony purposely brings his parents a day earlier than planned (reasoning that the two families should meet as they are, not in a formal \"stuffed-shirt\" setting), the Sycamore family is caught off-guard, and the house is in disarray. As the Kirbys are leaving after a disastrous meeting, the police arrive to arrest Ed for flyers he placed in Essie's candy boxes to advertise Paul's fireworks, and which the police perceive as communist propaganda . When the fireworks in the cellar accidentally go off, they arrest everyone in the house. Held in the drunk tank preparing to see the night-court judge, Mrs. Kirby repeatedly insults Alice and makes her feel unworthy of Tony, while Grandpa explains to Kirby the importance of having friends, and that despite all the wealth and success in business, \"you can't take it with you\". At the court hearing, the judge dismisses the charge for disturbing the peace against Grandpa and fines him $100 for the illegal fireworks; Grandpa's neighborhood friends pitch in to pay the fine. The judge refuses to dismiss the charges against the Kirbys unless they explain why they were at the Vanderhof house. Grandpa covers for the Kirbys by claiming it was to discuss selling the house, but Alice reveals it was because she was engaged to Tony, before spurning him because of how poorly she has been treated by his family. This causes a sensation in the papers, and Alice flees the city. With Alice gone, Grandpa sells the house, thus meaning all his neighbors must vacate their properties. As a result, the Kirby companies merge, creating a huge fluctuation in the stock market and ruining Ramsey, Kirby's competitor. Tony tells his father that he is quitting his job at the company, which he never wanted in the first place. Ramsey dies from a heart failure after confronting Kirby for being ruthless and a failure of a man, saying he too will end up ruined, alone and friendless. Realizing Ramsey was right, Kirby abruptly leaves the board meeting where the contract signing is scheduled to occur. As the Vanderhofs are vacating the house, Tony tries to speak with Alice, who locks herself in her room. Kirby arrives and talks privately with Grandpa, sharing his realization. Grandpa responds by inviting him to play a duet of \" Polly Wolly Doodle \" on the harmonica that he gave Kirby. The rest of the family join in the merriment, while Alice and Tony happily reconcile after Kirby expresses his approval of their marriage. Later, at the dinner table, Grandpa says grace for the Sycamore family and the Kirbys, revealing that Kirby has sold back the houses on the block.",
  "wiki": "https://en.wikipedia.org/wiki/You_Can%27t_Take_It_with_You_(film)"
}