{
  "year": "1939",
  "name": "Stagecoach",
  "plot": "In June 1880, stage driver Buck prepares a stagecoach from Tonto, Arizona Territory , to Lordsburg, New Mexico . Among the passengers are Dallas, a prostitute driven out of town by the \"Law and Order League\"; the alcoholic doctor Josiah Boone; snobbish belle Lucy Mallory, who is travelling to join her cavalry officer husband; and diminutive whiskey salesman Samuel Peacock. Meanwhile, Henry the \"Ringo Kid\" has broken out of prison to avenge the murder of his father and brother by Luke Plummer, a dangerous gunslinger who is in Lordsburg with his two brothers. The Plummers also accused Ringo of killing their foreman, which led to Ringo's conviction. Marshal Curley Wilcox decides to ride shotgun on the stage and find Ringo. U.S. Cavalry Lieutenant Blanchard announces that Geronimo and his Apache warriors are on the warpath, therefore Blanchard's troop will provide a temporary escort to Dry Fork station. Hatfield, a chivalrous gambler and former Confederate Army officer, offers Mallory his protection and climbs aboard. Ellsworth H. Gatewood, an arrogant banker, also boards. En route, the stage encounters Ringo, stranded after his horse went lame. Though Curley and Ringo are friends, Curley takes Ringo into custody. When they reach Dry Fork, they learn the expected cavalry detachment has gone on to Apache Wells station. Most of the party votes to proceed. The group is taken aback when Ringo, unaware of her profession, bonds with Dallas as the journey progresses. At Apache Wells, Mallory learns that her husband was wounded in battle with the Apaches and rushed to Lordsburg. She faints, and stunning the group, goes into labor. Doc Boone sobers up and delivers the baby with Dallas assisting. Later that night, Ringo asks Dallas to marry him and live on a ranch he owns across the border in Mexico . Afraid to reveal her past, she is evasive. The next morning, she accepts with Boone's encouragement, but is unwilling to leave Mallory and the newborn; instead, she encourages Ringo to escape, promising to meet him in Mexico later. Before Ringo can leave, he sees smoke signals heralding nearby Apache and returns to custody. The stage reaches a ferry crossing, which the Apaches have murderously sacked. Curley uncuffs Ringo to help lash logs to the stagecoach and float it across the river. The Apache eventually attack and a long chase ensues, during which Buck and Peacock are wounded. Down to his last bullet, Hatfield prepares to humanely dispatch Mallory when he is mortally wounded. The stage is then rescued by the 6th Cavalry . At Lordsburg, Gatewood is arrested for attempting to abscond with his bank's funds. Mallory learns that her wounded husband will fully recover; she thanks Dallas, who gives Mallory her shawl. Peacock invites Dallas to visit his home in Kansas City, Kansas . Ringo escorts Dallas to her destination in a seedy part of town and finally learns who she is, but he reiterates his desire to marry her. Luke Plummer, who is playing poker in one of the saloons, hears of Ringo's arrival and summons his brothers to join him in the showdown. Ringo guns down the Plummers in a shootout, then surrenders to Curley, expecting to go back to prison. As Ringo takes his seat on a buckboard , Curley invites Dallas to ride with them to the edge of town. But when she gets aboard, Curley and Boone stampede the horses, happily letting the couple speed off together towards Ringo's ranch.",
  "wiki": "https://en.wikipedia.org/wiki/Stagecoach_(1939_film)"
}