{
  "year": "1940",
  "name": "Rebecca",
  "plot": "On the French Riviera , Maxim de Winter stands at a cliff edge, seemingly contemplating suicide. A young woman shouts at him to stop him in his tracks, but he curtly asks her to walk on. Later, at a Monte Carlo hotel, the same young woman, serving as a paid companion to the pompous aging Mrs. Van Hopper, again encounters the debonair widower de Winter.  Aspiring to social prominence, Mrs. Van Hopper is obsequious to the aristocratic de Winter, but is soon confined to her room due to illness. Maxim invites the companion on excursions, such as tennis lessons, which she conceals from her employer. The young woman soon becomes infatuated, though puzzled by such attention. Upon her recovery, Mrs. Van Hopper decides to leave Monte Carlo; her companion furtively informs Maxim of her departure, and Maxim unexpectedly proposes marriage. After being informed of the proposal by Maxim, a shocked Mrs. Van Hopper privately tells her companion that Maxim is marrying her as a desperate distraction, because he is still tormented by thoughts of his beloved dead wife, Rebecca. She asserts that her companion is ill-prepared to be the second Mrs. de Winter and cannot hope to succeed as the mistress of the stately Manderley . Maxim brings his new bride back to Manderley, his grand mansion by the sea in Cornwall . Manderley is dominated by its austere housekeeper, Mrs. Danvers, a cold and unyielding woman, a confidante of the first Mrs. de Winter. Danvers harbors deep resentment for the new Mrs. de Winter, who she views as an usurper. Danvers feeds the bride's insecurity by showing her Rebecca's lavish bedroom suite, left untouched and denied to the new wife, and by retaining items throughout the house with Rebecca's monogram. Eventually, constant reminders of Rebecca's glamour and sophistication convince the new Mrs. de Winter that Maxim is still in love with his tragically drowned first wife, which could explain his restlessness and irrational outbursts of anger. She tries to assert her new role by holding a costume party as Maxim and Rebecca had done annually. Danvers suggests she copy the dress that one of Maxim's ancestors is seen wearing in a portrait. However, when she appears in the costume, Maxim is appalled as Rebecca had worn an identical dress at her last ball, just before her death. When Mrs. de Winter confronts Danvers about this, Danvers tells her she can never take Rebecca's place and tries to persuade her to jump to her death from the second-story window of Rebecca's room. At that moment, however, the alarm is raised because a ship has run aground due to the fog and, during the rescue of its crew, a sunken boat with Rebecca's body in it has been discovered. Maxim now confesses to his new wife that his first marriage had been a sham from the start. Rebecca had declared that she had no intention of keeping to her vows but would pretend to be the perfect wife and hostess for the sake of appearances. When Rebecca implied she was pregnant by her cousin and lover, Jack Favell, she taunted Maxim that the estate might pass to someone other than Maxim's line. During a heated argument, Rebecca fell, struck her head, and died. Afraid he would be blamed for her death, Maxim took the body out in a boat which he then scuttled; some days later, he identified another body that washed ashore as Rebecca's. The crisis causes the second Mrs. de Winter to shed her naïve ways. When the inquest considers the possibility of suicide, Favell attempts to blackmail Maxim, threatening to reveal a letter from Rebecca hinting at a pregnancy that made suicide improbable. When Maxim informs the police of the attempted blackmail, they must investigate Favell's accusations that Maxim murdered Rebecca. Further investigation with a doctor, however, reveals that Rebecca was not pregnant but terminally ill due to cancer, so the suicide verdict stands. Maxim realizes Rebecca had been trying to goad him into killing her to ruin him. As a free man, Maxim returns home to see Manderley on fire, set ablaze by the deranged Mrs. Danvers. All escape except Danvers, who dies when the ceiling collapses on her.",
  "wiki": "https://en.wikipedia.org/wiki/Rebecca_(1940_film)"
}