{
  "year": "1942",
  "name": "The Talk of the Town",
  "plot": "Mill worker and political activist Leopold Dilg is accused of arson and murder, setting fire to a woolen mill, killing the mill foreman, Clyde Bracken. In the middle of the trial, Dilg escapes from jail and seeks shelter in a remote cottage owned by former schoolmate Nora Shelley, on whom he has had a crush for years. Shelley, now a schoolteacher, has rented the unoccupied cottage for the summer to distinguished law professor Michael Lightcap, who plans to use this secluded location to write a book. Both Lightcap and Dilg arrive within minutes of each other, so Shelley decides to hide Dilg in the attic. When Dilg is spotted by Lightcap, Shelley passes him off as her gardener, Joseph. A visitor suddenly arrives, Senator Boyd. The senator informs Lightcap that he is about to be nominated to the Supreme Court by the president.  Meanwhile, Lightcap and Dilg enjoy having spirited discussions about the law, Lightcap arguing from an academic viewpoint, with Dilg subscribing to a more practical approach. As a result of their spirited debates, they become good friends, but also romantic rivals, as Lightcap falls in love with Nora. As a result of prodding by Shelley and Dilg's lawyer, Lightcap becomes suspicious of mill owner Andrew Holmes, foreman Clyde Bracken and Regina Bush.  In spite of his initial reluctance, Lightcap starts to investigate the charges against Dilg. As a ruse, he romances Bush, the girlfriend of the supposed murder victim and discovers that foreman Bracken is still alive and hiding in Boston . Shelley, Lightcap and Dilg go to Boston and find him. They bring him back to Lochester and get him to admit his guilt and that of the mill owner for setting the fire. While the three argue about whether to call the police, Bracken catches them unawares, knocks them unconscious and escapes. Dilg is held for trial while the town's anger at him is stoked into a riotous mob.  Lightcap takes a gun from the cottage and seeks out the foreman, forcing him at gunpoint to go to the courthouse just as the mob is about to break in to lynch Dilg. Firing the revolver to draw attention, Lightcap announces that the supposedly dead foreman is now present.  He then gives an impassioned speech to the mob about the importance of the law, both in principle and in practice.  In due course, the foreman and owner of the mill are indicted and Dilg is set free. Soon afterwards Lightcap is appointed to the Supreme Court . Shelley visits him in his chambers and he tells her that his dream of 20 years has been realized.  With more happiness than a man could want, he says the only thing left is to see his friends likewise happy, and suggests that Shelley should marry Dilg. While both Dilg and Shelley are attending court at the first seating of Lightcap as an Associate Justice, Dilg interprets an affectionate look shared between Lightcap and Shelley as a sign that she has chosen to marry Lightcap, and leaves the courtroom abruptly. Shelley follows him, and Dilg eventually realises that she has chosen him.",
  "wiki": "https://en.wikipedia.org/wiki/The_Talk_of_the_Town_(1942_film)"
}