{
  "year": "1942",
  "name": "49th Parallel",
  "plot": "In the Gulf of St. Lawrence , German U-boat U-37 sinks a Canadian freighter and then evades the RCN and RCAF by sailing into Hudson Bay . While a raiding party of six is ashore in search of food and fuel, the U-boat is sunk by RCAF bombers. The six survivors head for the neutral United States, led by Lieutenants Hirth and Kuhnecke. When a floatplane is dispatched to investigate reports of the sinking, the Germans open fire, killing the pilot and some of the local Inuit . They steal the aircraft but cannot achieve takeoff because they are overloaded. After a sailor is shot and killed by an Inuk, the load is light enough for takeoff. [ 9 ] Heading south, the floatplane exhausts its fuel and crashes into a lake in Manitoba , killing Kuhnecke. The Germans are welcomed by a nearby Hutterite farming community. Hirth assumes that the Hutterites are sympathetic to the Nazi cause, but his fanatical speech is refuted by Peter, the community's leader. One of the sailors, Vogel, would rather join the community, but he is tried by Hirth and executed for desertion and treachery. Hirth, Lohrmann and Kranz arrive in Winnipeg . Hirth decides that they will travel west to Vancouver and catch a steamship for Japan . They hijack a car and then board a train that stops in Banff, Alberta , during Banff Indian Days. [ 10 ] A Canadian Mountie addresses the crowd and Kranz is arrested when he panics. Fleeing across the Rocky Mountains , the two remaining men are welcomed to a lakeside camp by eccentric English writer Philip Armstrong Scott, who takes them for lost tourists. After they burn his manuscript and precious paintings, Scott and his men pursue them. Lohrmann finally rebels against Hirth's leadership and takes off by himself. Lohrmann is cornered in a cave. Scott is wounded but enters the cave and beats Lohrmann unconscious. Hirth, the last fugitive, meets Andy Brock, a Canadian soldier who is absent without leave , in a freight car on a train near the international border. Hirth knocks Brock unconscious with the butt of his gun and steals his uniform and dog tags. After the train crosses the border at Niagara Falls , Hirth surrenders his gun to a customs official and demands to be taken to the German embassy. Brock tells the official that Hirth, now globally famous, is wanted in Canada for murder. The customs officials are powerless to do anything, but then Brock has an inspiration: he says that because neither man is listed on the freight manifest, they cannot enter the country. Using this technicality, the officials reject the cargo and send the train back to Canada. As the train passes over the bridge, Brock dons his uniform cap and announces his intent to take back his pants.",
  "wiki": "https://en.wikipedia.org/wiki/49th_Parallel_(film)"
}