{
  "year": "1942",
  "name": "Wake Island",
  "plot": "A map is shown with a voiceover giving a brief history of the United States military on Wake Island to November 1941. U.S. Marine Corps Major Geoffrey Caton departs Pearl Harbor naval base in Hawaii aboard the Pan American Clipper to take command on Wake Island where he clashes with a military contractor named McClosky. When Caton's inspection identifies Privates Randall and Doyle as troublemakers, he has them dig a large slit trench by hand. McClosky has a construction contract for large trenches and living quarters, and drives his crew to complete the work on time. There are numerous conflicts between the military and the civilians, including practicing for air raids . On Sunday, December 7, 1941, Randall's enlistment is up. As he prepares to board the Clipper news arrives about the Japanese attack on Pearl Harbor . Wake Island is placed on alert and Randall, unsure what to do, goes to a bomb shelter with the civilians as enemy planes approach. Four American are sent against 24 Japanese bombers, downing several but unable to prevent heavy bomb damage on the ground. Following the raid, Caton tells Randall he is no longer a civilian. McClosky stays to dig trenches and other shelters with his heavy equipment. Caton informs pilot Lieutenant Bruce Cameron that his wife was killed at Pearl Harbor. When enemy ships approach the Marines camouflage their equipment and Caton orders them to hold their fire during the Japanese naval bombardment. Caton refuses to answer a Japanese call for surrender, and opens fire on the Japanese ships once they've reached to 4700 yards distance. Their fire repels the landing attempt and sinks several ships. A reconnaissance flight spots a Japanese heavy cruiser that can fire on the island from outside the defenders' weapon range. Caton approves Cameron's plan to strip a fighter plane down to just 15 gallons of fuel and a double bomb load. After successfully bombing the ship, Cameron is wounded by a Japanese fighter, but lands his plane safely before dying. Caton asks Captain Lewis to fly back to Honolulu aboard a U.S. Navy patrol plane to provide intelligence to the U.S. Navy Department . When Lewis refuses, Caton makes it an order. As they run out of large- caliber ammunition, Caton spreads his men wider with smaller guns. Japanese planes continue to bomb the island repeatedly inflicting major damage and casualties. The last American pilot, Captain Patrick, is killed bailing out of a damaged plane. The Japanese again signal for surrender. Caton replies, \"Come and get us\" and orders his posts to act independently. When communications fail, Caton orders the last man out of his command post with a written message. McClosky walks in, asking for a weapon and they make their way to an abandoned machine-gun position where Caton mans the gun. The Japanese land and overrun the American positions. The film ends as the last of the main characters are killed in action and a voiceover declares:  \"This is not the end.\"",
  "wiki": "https://en.wikipedia.org/wiki/Wake_Island_(film)"
}