{
  "year": "1944",
  "name": "Going My Way",
  "plot": "Father Charles \"Chuck\" O'Malley, an incoming priest from East St. Louis , is transferred to St. Dominic's Catholic Church in New York City . On his first day, his unconventional style gets him into a series of mishaps; his informal appearance and casual attitude initially make a poor impression with the elder priest, Father Fitzgibbon. The very traditional Fitzgibbon is further put off by O'Malley's recreational habits – particularly his golf-playing – and his friendship with the even more casual Father Timmy O'Dowd. O'Dowd tricks O'Malley into revealing that he was actually sent by the bishop to replace Fitzgibbon and take charge of the parish's affairs, with Fitzgibbon remaining on as pastor. To spare Fitzgibbon's feelings, O'Malley pretends that he was sent to serve as the elderly priest's assistant. The difference between O'Malley and Fitzgibbon's styles is openly apparent as they deal with events like a parishioner being evicted and a young woman named Carol James having run away from home. The most consequential difference arises in their handling of the church youth, many of whom consistently get into trouble with the law in a gang led by Tony Scaponi. Fitzgibbon is inclined to look the other way, siding with the boys because of their frequent church attendance. O'Malley wants to help  the boys' to improve their lives, befriending Scaponi and eventually convincing the boys to form a church choir. The noise of the practicing choir annoys Fitzgibbon, who goes to the bishop and asks for O'Malley to be transferred to another parish. In the course of their conversation, Fitzgibbon realizes the bishop sent O'Malley to take charge of the parish. To avoid an uncomfortable situation, Fitzgibbon asks the bishop to put O'Malley in charge, and then, resigned to his fate, he informs O'Malley of his new role. Distressed, Fitzgibbon goes walking in a rainstorm for several hours and returns late that night. O'Malley puts the older priest to bed, and the two finally begin to bond. They discuss Fitzgibbon's long unfulfilled desire to go to Ireland to visit his mother, now over 90 years old. O'Malley puts Fitzgibbon to sleep with an Irish lullaby, \" Too Ra Loo Ra Loo Ral \". O'Malley runs into Jenny Tuffel, an old girlfriend whom he left to join the priesthood. Jenny now has a successful career singing with the Metropolitan Opera , under the stage name Genevieve Linden. As she prepares to go onstage in a performance of Carmen , the two discuss their past, and she learns that her world travels with a previous opera company caused her to miss O'Malley's letter explaining he had entered the priesthood. O'Malley next pays a visit to Carol, now suspected of living in sin with Ted Haines Jr., the son of the church's mortgage holder. O'Malley describes to the young couple his calling in life, to follow the joyous side of religion and lead others to do the same, sung as his composition \"Going My Way\". When the junior Haines is later confronted by his father, the father discovers that he and Carol have married, and he has joined the Army Air Corps. Jenny visits O'Malley at the church, sees the boys' choir, and reads the sheet music of \"Going My Way\". She, O'Malley, and O'Dowd devise a plan to rent out the Metropolitan Opera House, have the choir perform the song with a full orchestra, then sell the publishing rights, saving the church from its financial woes. When Max Dolan, the music executive brought on to hear the song does not believe it will sell, the choir decides to make the most of its opportunity on the grand stage, and sings \" Swinging on a Star \". The executive overhears the song and wants to buy it, providing enough money to pay off the church's mortgage. With everything settled, O'Malley is transferred to a new assignment; O'Dowd will be Fitzgibbon's new assistant, with Tony Scaponi in charge of the choir. However, the church is damaged by a massive fire. On Christmas Eve, parishioners gather in a temporary church for a Mass that also serves as O'Malley's farewell. As a parting gesture, O'Malley has sent for Fitzgibbon's mother in Ireland. As mother and son embrace for the first time in 45 years, the choir sings \"Too-ra-loo-ra-loo-ral\", as Father O'Malley quietly slips away into the night.",
  "wiki": "https://en.wikipedia.org/wiki/Going_My_Way"
}