{
  "year": "1944",
  "name": "Double Indemnity",
  "plot": "Wounded from a gunshot, insurance salesman Walter Neff stumbles late at night into his empty Los Angeles office. He records a dictaphone confession for claims manager Barton Keyes. One year earlier, Neff flirts with Phyllis Dietrichson during a house call about her husband's automobile insurance. Phyllis asks about getting a policy on Mr. Dietrichson's life without his knowledge. Deducing that she is contemplating murder, Neff wants no part of it but is fascinated with her and struggles with temptation to use his knowledge to outsmart the insurance company. Later, Phyllis visits his apartment, where Neff concocts a plan to have Dietrichson sign a life insurance policy without realizing it, murder him, and frame it as an accident to trigger the policy's double indemnity clause with a higher payout. Dietrichson signs the policy slipped in as a “copy” of his automotive insurance renewal. Before the murder can take place, Dietrichson unexpectedly breaks his leg, delaying and complicating the scheme. Neff hides in the back seat of Phyllis' car while she drives Dietrichson to a train station. Neff breaks Dietrichson's neck, leaving the dead body in the car with Phyllis, while he boards the train posing as Dietrichson, with a fake plaster cast on his leg. A helpful passenger almost foils the plan, requiring Neff to keep his hat pulled low and face averted; to vacate the observation car, Neff sends him on an errand for cigars. Neff jumps off the train at a pre-arranged spot, where Phyllis helps him stage Dietrichson's body on the tracks. Neff's boss believes Dietrichson's death a suicide . Keyes, a dogged claims manager proud of his track record in spotting fraud, nevertheless scoffs at the idea he considers statistically implausible. Keyes does find it strange that Dietrichson did not file a claim after breaking his leg. He begins to suspect that Phyllis and an accomplice murdered Dietrichson. Reasoning that Dietrichson was unaware of the policy, Keyes questions Neff, the salesman, who affirms that Dietrichson signed the policy. Based on 11 years of respect and friendship, the ordinarily suspicious Keyes does not question Neff's account. Meanwhile, Neff befriends Phyllis' stepdaughter, Lola, who has a resentful boyfriend named Nino Zachetti, a medical school dropout for lack of funds. Lola tells Neff that she saw Phyllis trying on mourning clothes several days before Dietrichson's death and that she believes Phyllis, her mother's nurse during an illness, had killed her mother to marry Dietrichson. Lola now fears that Phyllis plans to kill her next for the money. Neff now begins to see the extent of Phyllis's manipulations. Keyes finds the witness from the train's observation car who says that the man he saw on the train was not the Dietrichson in photos, but fails to recognize Neff, who is present. Neff warns Phyllis that pursuing the insurance claim in court risks exposing the murder, and insists that they should not see each other until the investigation ends. Nino Zachetti has been visiting Phyllis every night since the murder, and Keyes now suspects Nino is her accomplice. Suspecting that Phyllis is now manipulating Nino to eliminate him and kill Lola, Neff confronts Phyllis and threatens to kill her. Phyllis shoots Neff, but when he comes closer and dares her to shoot again, she does not. She says that she never loved him \"until a minute ago, when I couldn't fire that second shot.\" As they embrace, Neff shoots her twice with her gun. As Neff leaves, he sees Nino walking up to the house. Neff convinces Nino to call Lola and make up with her. Finishing recording his confession, Neff looks up to see Keyes, summoned by a janitor who saw blood drippings. When Neff asks how long Keyes has been listening, Keyes responds “Long enough.” Asking for a head start, Neff intends to flee to Mexico, but Keyes says he won't make it to the elevator. Neff collapses in the doorway as Keyes calls for an ambulance and the police, and the two wait for them to arrive. Chuckling ruefully, Neff says that Keyes couldn't solve this one because the culprit was too close, right across the desk. Keyes responds, “Closer than that, Walter.” Walter responds, “I love you, too.”",
  "wiki": "https://en.wikipedia.org/wiki/Double_Indemnity"
}