{
  "year": "1945",
  "name": "Spellbound",
  "plot": "Dr. Constance Petersen is a psychoanalyst at Green Manors, a mental hospital in Vermont , accused by an unsuccessful suitor colleague of being icy and unemotional. The hospital's director, Dr. Murchison, is forced into retirement shortly after returning from an absence due to nervous exhaustion. His replacement, Dr. Anthony Edwardes, turns out to be surprisingly young. Uncharacteristically, Petersen is immediately smitten with Edwardes, who returns her feelings. While kissing him, Petersen notices that Edwardes has a peculiar phobia about sets of parallel lines against a white background, displayed on several occasions. She compares his signature with an autographed copy of one of his books, realizing when they do not match that he is an impostor. He confides to her that he has killed the real Edwardes, who was treating him, and taken his place. Suffering from amnesia, he does not know who he really is, but they deduce that he is a doctor when he displays medical knowledge. Petersen believes he is an innocent man with a guilt complex . Overnight, he disappears. Edwardes' assistant arrives and discloses that the Edwardes who spoke to her on the phone is an impostor, and that the real Edwardes is ominously missing. Petersen tracks the impostor to a New York City hotel, where he is living under the pseudonym \"John Brown\". Despite his insistence that she leave, she convinces him that psychoanalysis can recover his memories. The two travel to Rochester, New York , and stay with Dr. Alexander Brulov, Petersen's former mentor and friend. The two psychoanalysts interpret a dream that \"Brown\" describes. He is playing cards in a mysterious club when a scantily clad woman resembling Petersen starts kissing everybody there. His card partner, an older man, is accused of cheating and threatened by the club's masked proprietor. The scene changes to the older man standing on the precipice of a sloped roof and falling off. The proprietor is found to be standing behind a chimney and dropping a wheel he held in his hand. \"Brown's\" dream concludes with him chased down a hill by a great pair of wings. \"Brown's\" phobia of dark lines on white represents ski tracks in the snow, and the older man in his dream is the real Edwardes, who died in a skiing accident. The detail of the wings they deduce to represent Gabriel Valley ski lodge. \"Brown\" and Petersen travel there to recreate the circumstances of Edwardes' death. However, \"Brown\" fears that, if he really was Edwardes' murderer, he may impulsively kill again in the same situation. As they ski down the slope, \"Brown\" remembers details of his former life: he has a guilt complex, rooted in a childhood accident where he accidentally killed his brother by sliding down a concrete banister and knocking him onto a spiked fence. He also recognizes the cliff where Edwardes fell off, and then \"Brown\" recalls his own real name: John Ballantyne. Petersen and Ballantyne later meet with the police, who find Edwardes' body with Ballantyne's directions. However, the corpse has a bullet wound in his back. Ballantyne is arrested, tried, and convicted of murder. Heartbroken, Petersen returns to Green Manors. Murchison, once again the director, lets slip that he knew Edwardes slightly and disliked him, contradicting his earlier statement that they had never met. This inspires Petersen to re-examine her notes of Ballantyne's dream: the masked proprietor represents Murchison and the wheel represents a revolver. Murchison therefore murdered Edwardes and left the gun on the ski slope. Confronting Murchison to prove her hunch, Petersen gets him to admit that the man in the dream likely represents himself. She presents her accusation, and Murchison replies that she got every detail right but one: he still has the revolver and draws it on her. Calmly, Petersen points out that while he could plead insanity and get a lesser charge for Edwardes' murder, shooting her in cold blood would guarantee his execution. With the gun still pointed at her, she leaves the office to phone the police, before Murchison turns the gun and shoots himself. Petersen and Ballantyne, now married, receive well-wishes from Dr. Brulov before departing on their honeymoon at Grand Central Terminal .",
  "wiki": "https://en.wikipedia.org/wiki/Spellbound_(1945_film)"
}