{
  "year": "1946",
  "name": "The Best Years of Our Lives",
  "plot": "Three returning World War II veterans meet on a flight to their midwestern hometown of Boone City: USAAF bombardier captain Fred Derry, U.S. Navy petty officer Homer Parrish, and U.S. Army sergeant Al Stephenson. Each had left a very different life behind: Fred Derry had been a drug store soda jerk who lived with his parents on the wrong side of the tracks. Before shipping out, Fred married a gold-digger named Marie after a whirlwind romance. Marie has since been working in a nightclub to fill her time (and her nightlife) in spite of Fred's generous combat pay as an Air Force officer. Al Stephenson was an executive at a bank and lived in a luxury apartment with his wife, Milly, and their teenage children, Peggy and Rob. Homer Parrish was a star high school athlete living with his middle-class parents and younger sister. Homer had also been dating his next-door neighbor Wilma, whom he intended to marry upon his return from the war. Each man faces challenges integrating back into civilian life. Homer lost both hands in the war and though he has become functional in the use of his mechanical hooks , he cannot believe that Wilma will still want to marry him. Al, tired and jaded from the war, returns to the bank and is given a promotion, but wrestles with alcohol. Though highly decorated, Fred suffers from PTSD flashbacks by night. Fred arrives home and cannot locate his party girl wife, who does not expect him. The Stephensons and their daughter Peggy invite Fred along with them for the evening, bar hopping in celebration of Al's return. An inebriated Fred keeps asking Peggy who she is, and she reminds him that she is \"Al's daughter.\" When Fred is unable to get into his apartment, the Stephensons offer him a bed for the night. Later, Peggy calms Fred during a nightmare, and the two gradually become attracted to each other. When Peggy and her boyfriend invite Fred and Marie out to dinner, Peggy realizes how shallow and materialistic Marie is and becomes determined to break up her and Fred's marriage. Although proficient in managing the challenges of his disability, Homer is frustrated by his loss of independence and adjusting to his relationship with Wilma. Concerned that Wilma does not fully understand the difficulties of being married to him with his disabilities, Homer demonstrates to her how she will need to assist him at bedtime when he removes his harness with his prosthetic hands, leaving him helpless. Wilma reaffirms her love for Homer and says she can commit herself to him for life. Al continues to struggle with re-entry into civilian life. Widely respected by the bank's senior management for his past business acumen, Al is criticized after approving an unsecured loan to a farmer and fellow veteran who wants to buy forty acres, but has no collateral. With inhibitions lowered by excessive drinking , Al gives a speech at a work banquet that satirizes requiring a veteran to provide collateral before risking his life to take a hill in battle. With little work experience and unable to find a better job than soda jerk, Fred returns to the same drugstore. Fred and Peggy's attraction grows stronger, which puts Fred at odds with her father Al. When Homer visits Fred at the drugstore, another customer criticizes US involvement in the war, telling Homer his injuries were unnecessary. Homer responds angrily, and Fred intervenes on his behalf, punching the customer and consequently being fired. Meanwhile, Marie, frustrated with Fred's lack of financial success and missing her past nightlife, decides to get a divorce. Bitter and seeing no future in Boone City, particularly with Al telling him to stay away from Peggy, Fred decides to catch the next plane out. While waiting at the airport, Fred walks into an aircraft boneyard , climbing into a decommissioned B-17 bomber. Sitting in the bombardier's seat, Fred has another flashback. He is roused out of his stressful memories by a work crew foreman, who tells him the planes are being demolished for use in the growing prefab housing industry. Fred asks if they need help in the budding business and is hired. Al, Milly, and Peggy attend Homer and Wilma's wedding, where Fred is best man. Now divorced, Fred reunites with Peggy after the ceremony. Fred expresses his love but says things may be financially difficult if she stays with him. Peggy's smile expresses her joy and she and Fred kiss.",
  "wiki": "https://en.wikipedia.org/wiki/The_Best_Years_of_Our_Lives"
}