{
  "year": "1946",
  "name": "It's a Wonderful Life",
  "plot": "On Christmas Eve 1945, in Bedford Falls , New York , George Bailey contemplates suicide. The prayers of his family and friends reach Heaven , where guardian angel second class Clarence Odbody is assigned to save George and earn his wings. Clarence is shown flashbacks of George's life. He watches 12-year-old George rescue his younger brother Harry from drowning in a frozen pond, leaving George with deafness in his left ear. George later saves pharmacist Mr. Gower from accidentally poisoning a customer. In 1928, George plans a world tour before college. He is reintroduced to Mary Hatch , who has loved him since childhood. When his father dies from a stroke , George postpones his travel to settle the family business, Bailey Brothers Building and Loan . Avaricious board member Henry F. Potter , who owns most of the town, seeks to dissolve the company, but the board of directors votes to keep it open if George runs it. George works alongside his uncle Billy, giving his tuition savings to Harry with the understanding that Harry will take over the company when he graduates. Harry returns from college married and with a job offer from his father-in-law, and George resigns himself to running the building and loan. George and Mary rekindle their relationship and marry, but abandon their honeymoon to use their savings to keep the company solvent during a run on the bank . Under George, the company establishes Bailey Park, a housing development surpassing Potter's overpriced slums. Potter entices George with a high-paying job, but George rebuffs him when he realizes that Potter's true intention is to close the building and loan. On Christmas Eve, the town prepares a hero's welcome for Harry, a Navy fighter pilot awarded the Medal of Honor for preventing a kamikaze attack on a troopship. Billy goes to Potter's bank to deposit $8,000 ($139,726 in 2024 ) of the building and loan's money. He taunts Potter with a newspaper headline about Harry, but absentmindedly wraps the cash in Potter's newspaper. Potter keeps the money, while Billy cannot recall how he misplaced it. With a bank examiner reviewing the company's records, George fruitlessly retraces Billy's steps. Frustrated and angered by Billy's blunder, which may lead to scandal and jail, George resents the sacrifices he has made and the family that has kept him trapped in Bedford Falls. He appeals to Potter for a loan, offering his meager life insurance policy as collateral. Potter scoffs that George is worth more dead than alive and phones the police. George flees Potter's office, gets drunk at a bar, and prays for help. Contemplating suicide, he goes to a bridge. Before George can jump, Clarence dives into the river and George rescues him. When George wishes he had never been born, Clarence takes him into an alternate timeline in which he never existed. George finds that Bedford Falls is now Pottersville, an unsavory town occupied by sleazy entertainment venues and callous people. Mr. Gower was jailed for manslaughter because George did not stop him from poisoning the customer. His mother does not know him, and Uncle Billy was institutionalized after the building and loan failed. Bailey Park is a cemetery, where George discovers Harry's grave; without George to save him, Harry drowned in the frozen pond as a child; and without Harry to save them, the troops aboard the transport were killed. George finds that Mary is an \" old maid \" librarian . When he grabs her and claims to be her husband, she screams and runs away. George races back to the bridge and begs Clarence, and then God, for his life back. His wish granted, he happily rushes home to await his arrest. Mary and Billy have rallied the townspeople, who donate more than enough to replace the missing money. Harry arrives and toasts George as \"the richest man in town\". Among the donations, George finds a copy of The Adventures of Tom Sawyer , a gift from Clarence inscribed: \"Remember, no man is a failure who has friends. Thanks for the wings!\" When a bell on the Christmas tree rings, George's youngest daughter, Zuzu, explains that, \"every time a bell rings, an angel gets his wings\", while those gathered sing \" Auld Lang Syne \".",
  "wiki": "https://en.wikipedia.org/wiki/It%27s_a_Wonderful_Life"
}