{
  "year": "1946",
  "name": "The Razor's Edge",
  "plot": "Elliott Templeton, an American expatriate living in France, returns to the United States after the Great War . His niece Isabel is engaged to marry Larry Darrell, recently returned from the war. Traumatized by his war service, Larry is uninterested in working to support Isabel and plans to live on a $3,000 annual inheritance. Larry and Isabel postpone their wedding so he can go to Paris to discover the meaning of life. Larry lives the life of a student in Paris for a year. When Isabel and her mother arrive, Larry asks her to marry him, but she breaks off the engagement, unwilling to live in poverty. She marries millionaire Gray Maturin instead, acquiring wealth and status. A drunk defrocked priest working with Larry in a coal mine convinces him  to travel to India to learn from a mystic. Larry experiences a moment of enlightenment at a Himalayan monastery, and is urged to return to society with his newfound spiritual awareness. Larry learns Isabel and her family were ruined by the stock market crash of 1929 and are living with Elliott. Writer W. Somerset Maugham arranges for Elliott and his household to meet Larry. They encounter Larry's childhood friend Sophie Nelson, who turned to drugs, alcohol and prostitution following the death of her husband and child. Isabel has chosen estrangement from Sophie but when Larry proposes marriage to her, Isabel begins to act charitably toward her. At a group luncheon at the Ritz, Elliott drinks Persovka , and Isabel has more sent to the apartment. She arranges to meet Sophie to arrange the gift of a wedding dress, and manipulates Sophie into relapsing by invoking memories of her dead daughter and leaving her alone with the Persovka. When Sophie subsequently disappears, Larry searches through seedy bars, following the trail of a woman demanding Persovka. When he finds Sophie at an opium den she flees. A year later, she is murdered in Toulon . Maugham and Larry visit Elliott on his deathbed in Nice . He tells Gray that he can repay his father's debts and rebuild the family business. Larry plans to leave France after Elliott's death, by working on a tramp steamer. Isabel professes her love to Larry and confesses to instigating Sophie's relapse, as a way of saving Larry from Sophie's weakness. Larry feels consolation that Sophie would have preferred to be reunited with her dead husband and child. Isabel is left confused by Larry who she feels still does not understand what he wants. Maugham explains that in fact, Larry found exactly what most people desire but fail to achieve. The film closes on a shot of Larry hoisting cargo on the deck of a storm-tossed ship.",
  "wiki": "https://en.wikipedia.org/wiki/The_Razor%27s_Edge_(1946_film)"
}