{
  "year": "1947",
  "name": "Crossfire",
  "plot": "In Washington D.C. , a former US Army soldier named Joseph Samuels is found dead in a hotel room. Police Captain Finlay suspects that the murderer may be among a group of demobilized servicemen had been with Samuels and his female companion Miss Lewis at a hotel bar the night of his death. One of the soldiers, former police officer Sgt. Montgomery, tells Finlay that he and his friend Floyd Bowers met Samuels at the hotel bar and went up to his apartment to find Samuels talking to Cpl. Arthur \"Mitch\" Mitchell. Soon upon their arrival, a heavily drunk Mitch left Samuels' apartment alone, then Montgomery and Floyd left a minute or so later. Montgomery claims that it was the last time they saw Samuels alive. Sgt. Peter Keeley, concerned that Mitch may be the prime suspect, investigates the murder himself, hoping to clear his friend's name. After helping Mitch escape from police capture, Keeley meets him in a movie theater, where Mitch recalls Montgomery arguing with Samuels inside his apartment. After Mitch left, he spent part of the night with Ginny Tremaine, a working girl he met in a dance hall. When Mitch woke up the next morning in Ginny's apartment, she was not there. After hearing a knock at the door, Mitch met an odd man, who offered to make him coffee, and claimed he was waiting for Ginny too. While the man looked for some cigarettes, Mitch hastily left the apartment. Meanwhile, Montgomery and Floyd meet in an apartment. Montgomery tells Floyd to stay out of sight and to keep their stories straight, that they had no argument with Samuels and left his apartment shortly after Mitch. Keeley knocks on their door and asks Floyd about the killing while Montgomery hides. After Keeley leaves, Montgomery – the actual killer – kills Floyd for refusing to stay out of sight, and then stages a hanging suicide. Escorted by Captain Finlay, Mitch's wife Mary visits Ginny at her apartment, hoping that Ginny will confess to spending the night with Mitch and prove he is innocent. Mary asks Finlay to wait outside, as a cop might make Ginny clam up. Ginny claims to have no knowledge of meeting Mitch, at which point Finlay enters the apartment to question her. Ginny recants and admits to knowing Mitch, but states that she never met him at her apartment. At this point, the odd man appears from a back room and tells Finlay that he remembers Mitch, thereby providing a partial alibi, but not for the estimated time of the murder. Back at the police station, Finlay questions Montgomery a second time, hoping to uncover the motive for Samuels' murder, but sends him on his way. With Keeley in his office, Finlay suspects that antisemitism was the likely motive for Samuels' murder, since Samuels was Jewish and no person involved otherwise knew him personally. Both suspect that Montgomery was responsible for killing both Samuels and Floyd, since he is clearly antisemitic. Finlay delivers a personal antiracist message to Keeley and a naive soldier named Leroy, who was in Montgomery's unit, by recalling the death of his Irish grandfather during earlier historical bigotry . Winning over Leroy, Finlay sets a trap to catch Montgomery. Leroy tells a surprised Montgomery that Floyd wants to meet him and shows him an address he wrote down where he can find Floyd. Montgomery shows up at the apartment where he killed Floyd, presumably to check if he is still alive, and encounters Finlay and another cop. Finlay tells Montgomery he gave himself away as the address on the piece of paper was actually to a different building, nevertheless he came to the right apartment, proving he had been there before when he killed Floyd. Montgomery tries to escape but is shot dead by Finlay. After Montgomery is killed, Finlay and Keeley say their goodbyes. As Finlay drives away, Keeley offers to buy Leroy a cup of coffee.",
  "wiki": "https://en.wikipedia.org/wiki/Crossfire_(film)"
}