{
  "year": "1948",
  "name": "The Treasure of the Sierra Madre",
  "plot": "In 1925, in the Mexican town of Tampico , American drifters Fred C. Dobbs and Bob Curtin are hired by a contractor, Pat McCormick, to work on oil rigs for $8 a day. After the job is completed, McCormick disappears without paying them. Penniless, Dobbs and Curtin encounter an elderly prospector named Howard in a flophouse , who tells them about gold mining and its dangers. Dobbs and Curtin see McCormick walking down the street, follow him into a cantina and demand the money he owes them. McCormick tries to get them intoxicated by buying them drinks but they insist on being paid. A fight ensues, with Dobbs and Curtin beating McCormick unconscious. They take the $300 he owes them and another $100 which they give to the cantina owner. Soon after, Dobbs wins a small lottery prize, and the three pool their funds to begin prospecting in the remote Sierra Madre Occidental . After fending off a bandit attack during their journey, the trio arrives at a promising site where Howard identifies gold. They begin mining and accumulate a substantial fortune, but growing distrust sets in—particularly from Dobbs, who becomes increasingly paranoid and suspicious of his partners. During a supply trip, Curtin is followed back to camp by a stranger named Cody, who proposes joining their operation. The three initially consider killing him, but before they act, a gang of bandits led by Gold Hat arrives. In the ensuing gunfight, Cody is killed. Afterward, the group discovers a letter from Cody's wife, revealing his personal struggles. Howard and Curtin agree to send her a portion of their earnings, though Dobbs refuses. Later, Howard is summoned to a nearby village to aid a sick child. When the boy recovers, the villagers insist he remain with them as an honored guest. While he is away, tensions between Dobbs and Curtin escalate until Dobbs attempts to murder Curtin and flee with all the gold. Curtin survives and is rescued by the villagers. Dobbs is later killed at a waterhole by Gold Hat's gang, who unknowingly discard the gold dust, mistaking it for sand. The wind scatters the treasure. The bandits are captured and executed after being identified while trying to sell the stolen burros. Howard and Curtin reunite in Durango only to discover that the gold has been lost. After initially reacting with shock, they share a moment of ironic laughter. Howard decides to stay with the villagers, while Curtin returns to the United States with plans to find Cody’s widow.",
  "wiki": "https://en.wikipedia.org/wiki/The_Treasure_of_the_Sierra_Madre_(film)"
}