{
  "year": "1949",
  "name": "A Letter to Three Wives",
  "plot": "Friends Deborah Bishop, Rita Phipps and Lora Mae Hollingsway are just about to take a group of children on a riverboat outing when they receive a message from their \"dear friend\" Addie Ross (heard but unseen during the film) informing them that she has left town and taken one of their husbands as a lover. However, Addie does not specify which woman's husband is involved. In flashbacks, each woman considers reasons why it might be hers. The first flashback involves Deborah, who was raised on a farm. Her first experience with the outside world came when she joined the Navy WAVES during World War II , where she met her future husband Brad. When they return to civilian life, Deborah does not feel welcome in Brad's sophisticated social circle, and is uncomfortable with her old-fashioned dress and overly curly hairdo as she prepares for her first country club dance. She over-imbibes at home to calm her nerves, but this backfires at the dance. Adding to her insecurity, she learns everyone expected Brad to marry Addie, a woman on whom all three husbands lavish their attention. Deborah is comforted by Brad's friend Rita, who writes stories for radio soap operas . Her husband George is a high school English teacher and enjoys inspiring his students. While Rita wishes George would be more ambitious, he is disappointed that Rita constantly caters to her boss, Mrs. Manleigh. Rita is so intent on pleasing Mrs. Manleigh that she invites the Manleighs for dinner and forgets George's birthday. George forgives Rita's mistake but, to his delight, a birthday gift of a rare Brahms recording arrives from Addie (piquing Rita's jealousy). When the Manleighs arrive, they are rude, accidentally break the Brahms record, and are miffed with George's sly critique of their beloved soaps. After they leave, George discovers Rita was hoping he would be hired at the radio station and is upset at his wife's attitude. Lora Mae grew up in poverty. She catches the eye of Porter, the older, divorced owner of a statewide chain of department stores where she works. Porter is attracted to Lora Mae and dates her a number of times, but is frustrated when she makes it clear she's holding out for marriage. Matters come to a head when Lora Mae sees a framed picture of Addie on the piano in Porter's mansion. Lora Mae says she wants her picture on the piano and his home to become hers. When Porter tells Lora Mae he's not interested in marriage, she ends the relationship. However, Porter skips a New Year's Eve party at Addie's to visit Lora Mae and grudgingly \"proposes\" (\"OK, OK, you win. I'll marry you. How about it?\") Lora Mae is less than thrilled, but kisses Porter regardless. Back in real time, the women return from the outing. Rita is overjoyed to find George at home - his mysterious disappearance was simply a trip to the school where he taught. He tells Rita he had been asked to direct the high school's dramatic society production of Shakespeare's \"Twelfth Night\", and the first rehearsal was that day. He and Rita reconcile, and she vows to not allow herself to be at Mrs. Manleigh's mercy any longer. Porter is late coming home, causing Lora Mae to fear he has left with Addie. When he appears and hears his wife's suspicions, he accuses her of being happy at the thought of establishing grounds to divorce him and reap a big chunk of his fortune. Nevertheless, he grumpily agrees to accompany her to the country club dance as planned. When Deborah returns home, the houseboy hands her a message saying Brad called and will not return that night. Deborah is heartbroken at her perceived loss, but greets George and Rita glamorously dressed and coiffed and goes to the dance with them. At the couples' table, Porter complains about Lora Mae dancing with another man. Deborah says Porter has no idea how much Lora Mae really loves him. Porter scoffs, still certain Lora Mae sees him only as a money source. Unable to take the strain any longer, Deborah decides to leave, announcing to the group that Brad left with Addie. Porter stops her, confessing it was he who planned to flee with Addie, but changed his mind. As Deborah happily leaves for home, Porter tells Lora Mae that admitting his intended abandonment in front of witnesses (George and Rita) is enough for her to divorce him and take everything. To his shock, Lora Mae says, \"If you said something, I just didn't hear it.\" Finally convinced of her love, Porter is overjoyed. He asks her to dance and they kiss passionately, smiling at each other on the dance floor. The melancholy voice of the still unseen Addie Ross - left all alone -  bids the audience a good night.",
  "wiki": "https://en.wikipedia.org/wiki/A_Letter_to_Three_Wives"
}