{
  "year": "1949",
  "name": "The Heiress",
  "plot": "In 1849 New York City , Catherine Sloper, an inhibited, plain young woman, lives with her wealthy father, Dr. Austin Sloper, in prestigious Washington Square. Catherine's beautiful and accomplished mother died giving birth, and Catherine’s awkwardness constantly reminds her father of the poor exchange for his beloved wife. Widowed Aunt Lavinia Penniman, on an extended visit with her brother, helps Catherine improve her social skills. At a ball, Catherine meets handsome, charming Morris Townsend, a polished young man who squandered a small inheritance on a European Grand Tour . Encouraged by Aunt Penniman, Morris artfully pursues Catherine, who he knows through her family connections will inherit $40,000 annually. At first Catherine is overwhelmed by his persistence; starved for affection, however, she quickly falls in love. Suspecting Morris is a fortune hunter, Dr. Sloper consults with Morris's widowed sister, who reluctantly makes admissions that confirm Sloper’s opinion. Before approaching Sloper to formally request Catherine's hand in marriage, Morris improperly makes Catherine pledge herself to him. Pointing out the impropriety, Sloper rejects him. When Catherine persists, Sloper insists on taking her on an extended European trip to separate the pair as a test. Catherine informs Morris that she already has a substantial $10,000 inheritance from her mother and does not need her father's approval. Morris claims that he is loath to estrange her from her father, and she should appease him. While Catherine and her father are away, Morris frequents the Sloper home like a private club, enjoying Aunt Penniman’s hospitality and Sloper’s cigars and brandy. Disappointed with his daughter’s intransigence in her devotion to Morris, Sloper cuts the trip short. Upon returning home, he reveals to Catherine his low opinion of her merits, believing her dim for thinking any suitor would have an interest in her beyond her inheritance. He threatens to cut her out of his will if she marries Morris. Catherine now fully realizes the depth of her father's disdain. Wounded and angry, Catherine is convinced that Morris's love is compensation for her father's coldness. She begs Morris to arrange their immediate elopement, not wanting to spend another night in her father's home. Morris holds out hope that her father will eventually relent, but Catherine insists that even if her father relents, she will never accept anything from him again. Reluctantly, Morris agrees to elope and leaves to pack his belongings. Catherine waits with her bags packed, and Aunt Penniman stays with her, dismayed that Catherine revealed to Morris that there would be no money from her father. As the appointed time comes and passes without his arrival, Catherine realizes that Morris has abandoned her. Pondering why Morris was not satisfied with her substantial $10,000 left by her mother, her aunt explains it is a disappointment because he expected she would also receive an additional $30,000 upon her father's death. Days afterward, Sloper reveals he is dying and asks Catherine when she plans to leave with Morris. When Catherine admits that the elopement is off, Sloper expresses pride that Catherine has rejected Morris, but Catherine bitterly informs him that she was jilted. Catherine shrilly expresses that Sloper has denied her even the chance to \"buy\" a husband who at least would hide that he does not love her. She tells her father that if he leaves her his money, he will never know whether she wastes it on Morris or another fortune hunter. Sloper admits that he does not want to disinherit her and accepts that she can do as she pleases when he is gone. Hardened, Catherine refuses to come to his bedside as he is dying. Years later, wealthy, independent, and single, Catherine still lives in the Washington Square house with her aunt. Aunt Penniman informs Catherine that Morris has returned from California and wishes to explain himself. Initially reluctant, Catherine eventually agrees to see him. Now destitute, Morris attempts to win Catherine back, saying that he left, selflessly, not to estrange her from her father. Chiding him for not being as impetuous as he used to be, Catherine suggests they carry out the delayed elopement. Morris eagerly leaves to pack. When Morris returns to take her away, Catherine has bolted the door against him, leaving him desperately pounding on the door as she turns off the lights and goes to bed.",
  "wiki": "https://en.wikipedia.org/wiki/The_Heiress_(film)"
}