{
  "year": "1949",
  "name": "Twelve O'Clock High",
  "plot": "In 1949, former United States Army Air Forces officer Harvey Stovall spots a familiar Toby Jug in an English antique shop and learns it came from Archbury, where Stovall served during World War II. Convinced it's the same jug from the airfield's officers' club, he buys it and journeys to the derelict airfield, where he reflects on his wartime experiences. In a flashback , the setting shifts to 1942, when the 918th Bomb Group at Archbury has gained a reputation as a \"hard luck group\". After a  disastrous mission, group commander Colonel Keith Davenport appears exhausted and demoralized. His defeatist attitude spreads through the group's senior leadership, including his Air Exec, Lieutenant Colonel Ben Gately. Ordered to fly another mission the next day at a dangerously low altitude, Davenport protests to his friend, Brigadier General Frank Savage, the Assistant Chief of Staff for Operations at VIII Bomber Command . Savage reluctantly shares with Major General Pritchard, the commanding general of VIII Bomber Command, his belief that Davenport has become too emotionally close to his men and may no longer be fit to command. That night, Pritchard and Savage visit the group headquarters to investigate the cause of the mission's heavy losses. When Davenport refuses to discipline failed navigator Lieutenant Zimmerman, Pritchard realizes Savage is right, relieves Davenport of command, and places Savage in command. Savage takes a harsh approach to restoring the group's discipline and morale. He reprimands Gately, demotes him to aircraft commander, and insists he fly every mission. Savage assigns Gately the least competent crewmen and orders him to paint the name \"Leper Colony\" on his airplane. Rough-and-ready Major Cobb impresses Savage with his independent spirit and replaces Gately as Air Exec. Savage conducts a series of training missions and waits for an opportunity to restore the group's pride in its abilities. Upset by the contrast of Savage's stern leadership with Davenport's easygoing ways, all of the group's pilots apply for transfer. Savage asks the Group Adjutant , Major Stovall, to delay processing their applications to buy him some time. When several groups are ordered to abort a combat mission due to heavy weather, Savage ignores the recall order and the 918th is the only group to successfully bomb the target. Savage claims he didn't hear the recall due to a radio malfunction and persuades a furious Pritchard to recommend the group for a Distinguished Unit Citation . Savage also convinces Lieutenant Jesse Bishop, a Medal of Honor recipient, to be Savage's eyes and ears among the combat aircrews.\nWhen the Inspector General arrives to investigate the transfer requests, Savage packs his belongings, expecting to be relieved or court-martialed. But, led by Bishop, the pilots withdraw their requests. Savage softens his attitude towards the men as he becomes more closely involved with them. Gately goes on to win Savage's respect by demonstrating extraordinary leadership and courage in combat. With enemy resistance intensifying as the air war advances deeper into Germany, missions become longer and riskier and many of Savage's best men are shot down or killed. Pritchard tries to get Savage to return to a staff job at VIII Bomber Command, but Savage feels that the 918th is not yet ready to do without him. Reluctantly, Pritchard leaves him in command. Ordered to return to the same target after a particularly brutal raid on a ball bearing factory, Savage finds himself physically unable to haul himself up into his B-17 . Gately takes his place as lead pilot and strike commander for the mission. While waiting for the group's return, Savage becomes catatonic . Only as they return to Archbury does he regain his composure and fall asleep. The story then returns to 1949, as Stovall pedals away from Archbury.",
  "wiki": "https://en.wikipedia.org/wiki/Twelve_O%27Clock_High"
}