{
  "year": "1950",
  "name": "King Solomon's Mines",
  "plot": "In British East Africa ( Kenya Colony ) in 1897, experienced British safari guide Allan Quatermain is persuaded by Elizabeth Curtis to find her husband, who disappeared in the unexplored African interior while searching for the legendary King Solomon ’s mines. She has a copy of the map that her husband had followed. Elizabeth and her brother John Goode join the adventure. Allan has no use for women on a safari, but during the long and grueling journey, he and Elizabeth begin to fall in love. The party encounters Van Brun, a lone white man living with a tribe, and learn that he had met Mr. Curtis. However, when Allan recognizes him as a fugitive who will not let them depart, they take him hostage to leave the village safely. Van Brun tries to shoot Allan, killing his faithful right-hand man Khiva instead. Allan dispatches Van Brun and the party flees from the angry villagers. They meet a tall mysterious native, Umbopa, who joins them. When they finally reach the region where the mines are believed to exist, they are met by people who resemble him and they discover that Umbopa is royalty who has returned to attempt to dethrone the usurper King Twala. Umbopa leaves with his supporters to raise a rebellion, while Allan, Elizabeth and John travel to a tense meeting with Twala at his kraal . With his last rifle bullet, John kills an attacker, temporarily quelling the natives. The king's advisor Gagool communicates that the tribe has seen Mr. Curtis and leads them to a cave that contains a trove of jewels and skeletal remains. While they are distracted, Gagool triggers a booby trap that seals the adventurers inside. They find a way out through an underground river and return to Twala's compound just as Umbopa and his followers arrive. Umbopa's people decide a disputed kingship by having the two claimants duel to the death. Despite cheating by one of Twala's men, Umbopa wins. He then provides an escort for his friends' return trip.",
  "wiki": "https://en.wikipedia.org/wiki/King_Solomon%27s_Mines_(1950_film)"
}