{
  "year": "1950",
  "name": "Born Yesterday",
  "plot": "Bullying, uncouth junkyard tycoon Harry Brock checks into a hotel suite in Washington, D.C., with his brassy girlfriend, former showgirl Emma \"Billie\" Dawn, and his crooked lawyer, Jim Devery, to \"influence\" a politician or two. As a legal precaution, Devery presses Harry to marry Billie, as a wife cannot be forced to testify against her husband . To hide and safeguard Harry's assets from the government, Devery persuades Harry to sign over many of his assets to the reliably docile and unquestionably obedient Billie. With aspirations to become a power broker among D.C. dignitaries, Harry likes to exert dominance over political figures he pays off, sometimes humiliating them when they are not sufficiently compliant. Though his own behavior is much worse, Harry is embarrassed by Billie's oblivious behavior with a prominent congressman's wife, disgusted with Billie's ignorance and lack of manners, which he believes reflect badly on him. When journalist Paul Verrall comes to interview him, Harry is impressed by his unintimidated and spirited demeanor. Offering Paul a hefty fee as a way of exerting dominance over a better-educated but underpaid member of the Fourth Estate , Harry hires Paul to educate Billie and give her some culture. Paul soon finds that Billie has a limited vocabulary and is completely uninterested in areas of common knowledge outside of her sphere. Attracted to Paul, Billie suggests they have a fling, reassuring him that Harry has always remained unaware because he does not pay attention to anything outside of his business interests. Paul demurs politely but shows Billie respect and patience, using her attraction to him to stimulate her interest in world affairs. Starting with reading the daily newspaper, Paul encourages Billie to circle items she does not understand. Initially, Billie circles every article she attempts to read and complains that she has to look up nearly every word. They discuss the related issues and vocabulary. Blossoming under Paul's encouragement and her own hard work, Billie learns about literature, history, politics and the law, and turns out to be much smarter than she or anyone else knew. Billie starts thinking for herself and applying her learning to her situation. She also falls in love with Paul, who begins to appreciate her intellectual development and reciprocate her feelings. When Billie begins to read the documents that Harry has her sign for businesses under her name, she disapproves of a crooked deal and refuses to sign. Harry reacts violently, striking her and forcing her to sign the contracts related to his crooked deal. After consulting a dictionary during the heat of the argument, Billie calls him a \"fascist\"; missing the mark, the increasingly out-of-his-depth Harry counters that he does not belong to any organized religion. Tension grows in Billie and Harry's relationship as he deals with her newfound inquisitiveness and independence. Growing wary, Harry tries to intimidate her into signing his assets back to him. With Paul's help, gathering evidence against Harry in a safe place as a precaution, Billie uses her leverage to escape from Harry's domination. She promises to give Harry back his property little by little as long as he \"behaves\" in his business dealings and leaves them alone. Later, when Paul and Billie are driving out of D.C., they are stopped for speeding by a traffic policeman who asks Paul for his \"license\"; Billie hands over their marriage license and the sympathetic officer lets them go. When Billie comments that their marriage was \"predestination\", the officer says that he does not know what that means, and Billie—the advocate for expanding vocabulary—responds, \"Look it up.\"",
  "wiki": "https://en.wikipedia.org/wiki/Born_Yesterday_(1950_film)"
}