{
  "year": "1950",
  "name": "All About Eve",
  "plot": "At the Sarah Siddons Award ceremony honoring rising actress Eve Harrington, narration from acerbic theatre critic Addison DeWitt introduces the attendees and hints that there is more to Eve's story. The narration switches to Karen Richards, wife of playwright Lloyd Richards. She recalls the previous October, when she introduced Eve to aging Broadway star Margo Channing, who was starring in a play written by Lloyd. Eve tells Karen, Lloyd, and Margo's maid Birdie that she followed Margo's last theatrical tour to New York City after seeing her perform in San Francisco . She tells of her impoverished childhood and losing her husband in the South Pacific during World War II , and, moved by Eve's story, Margo takes her into her home as her assistant. Eve quickly manipulates her way into Margo's life as both secretary and adoring fan. Margo is also concerned about her romantic relationship with Bill Sampson, eight years her junior, who is directing a film in California. Without telling Margo, Eve arranges a midnight long-distance phone call from Margo to Bill on his birthday. Eve hopes the unexpected late call will show Bill that Margo forgot his birthday and also sends her own greeting. Margo realizes that Eve set her up and asks producer Max Fabian to hire Eve at his office to get her away from Bill; instead, Eve has Karen convince Fabian to make Eve Margo's understudy without Margo's knowledge. As Margo's irritation grows, Karen sympathizes with Eve, believing that Margo is overdramatizing her resentment towards her. Hoping to humble Margo, Karen conspires for her to miss a performance so Eve can perform in her place. Eve secretly invites the city's theater critics, including Addison, to attend the performance. Eve's performance is a triumph. Later that night, Eve attempts to seduce Bill, but he rejects her. Addison interviews Eve for a column, which harshly criticizes Margo for resisting younger talent. Eve apologizes to Lloyd for the things said in the article, and subtly convinces him to consider her instead of Margo for the lead role, Cora, in his next play. Margo and Bill announce their engagement while dining out with Lloyd and Karen. Eve, who had been dining at the same restaurant with Addison, summons Karen to the ladies' room. After first appearing regretful, she delivers an ultimatum: Karen must recommend her to Lloyd to play Cora or she will have Addison expose Karen's part in Margo's missed performance in his newspaper column. When Karen returns to the table—to her relief—Margo surprisingly announces that she does not wish to play Cora. Margo admits that she is too old for the ingénue role, and her impending marriage means that the theater no longer has to be her entire life. Eve is cast as Cora, despite the objections of Bill, who is directing the play. Just before the out-of-town opening , Eve tells Addison that she had seduced and plans to marry Lloyd so that he can write plays for her to star in. Angered by Eve's audacity, Addison reveals he knows her backstory is false; her real name is Gertrude Slescynski, she never went to San Francisco, she was never married, and she was paid to leave town over an affair with her married boss. He blackmails Eve, forbidding her from trying to marry Lloyd and saying she now \"belongs\" to him. The story catches up to the opening scene; months later, Eve is a Broadway star headed for Hollywood. While accepting the Sarah Siddons Award, Eve thanks Margo, Bill, Lloyd, and Karen, who react with indifference. Eve skips the after-party and returns home, where she encounters Phoebe, who claims to be a teenage fan who slipped into her apartment and fell asleep. Eve is angry but softens after Phoebe professes her adoration and ingratiates herself. Eve is considering inviting her to stay over rather than take the long subway ride back home when the doorbell buzzes. Phoebe offers to answer the door and recognizes Addison, who was bringing Eve's award back from the after-party. Addison quickly realizes that Phoebe isn't her real name and that she, like Eve, has her sights on stardom. Phoebe lies to Eve that a taxi driver had dropped off the award. When she is alone, Phoebe puts on Eve's elegant cloak and poses in front of a floor-length mirror, holding the award and bowing.",
  "wiki": "https://en.wikipedia.org/wiki/All_About_Eve"
}