{
  "year": "1951",
  "name": "A Streetcar Named Desire",
  "plot": "Blanche DuBois , a middle-aged high school English teacher from Auriol, Mississippi, arrives in New Orleans . She takes a streetcar designated \"Desire\" [ 6 ] to the French Quarter , where her sister Stella and Stella's husband Stanley Kowalski live in a small, dilapidated tenement apartment. Blanche claims to be on leave from her job due to anxiety. Blanche's demure manner is a stark contrast to Stanley's crude behavior, making them mutually wary and antagonistic. Stella welcomes having her sister as a guest, but Stanley patronizes and criticizes her. Blanche reveals that the DuBois family estate, Belle Reve, was lost to creditors. She was widowed at a young age after her husband's suicide. When Stanley suspects Blanche may be hiding an inheritance, she shows him proof of the foreclosure. Looking for further proof, he knocks some of Blanche's private papers to the floor. Weeping, she gathers them, saying they are poems from her dead husband; Stanley explains he was only looking out for his family, and then announces that Stella is pregnant. Blanche meets Stanley's friend Mitch, whose courteous manner and sensitivity is in sharp contrast to Stanley and his other friends, and the two fall in love. During a poker night with his friends, Stanley explodes in a drunken rage, striking Stella; Blanche and Stella flee upstairs to neighbor Eunice Hubbell's apartment. After his anger subsides, Stanley remorsefully bellows for Stella from the courtyard below. Stella is drawn downstairs by her attraction to Stanley, and they go to bed together. The next morning, Blanche urges Stella to leave Stanley, calling him a sub-human animal. As weeks pass into months, tension mounts between Blanche and Stanley. Blanche is hopeful about Mitch, but anxiety and alcoholism have her teetering on mental collapse while anticipating a marriage proposal. Meanwhile, Stanley discovers that Blanche had been fired for sleeping with an underage student . He passes this news on to Mitch. Stella angrily blames Stanley for this catastrophic revelation, but their fight is interrupted when she goes into labor. Later, Mitch arrives and confronts Blanche about Stanley's claims. She pleads for forgiveness, but Mitch, hurt and humiliated, ends their relationship. Later that night, while Stella's labor continues, Stanley returns from the hospital to sleep. Dressed in a tattered gown, Blanche pretends she is departing on a cruise with an old admirer. Stanley admonishes her for lying about her past and mistreating him; the two fight and it is implied that he rapes her. Weeks later, during another poker game at the apartment, doctors arrive to take the nearly catatonic Blanche to a mental hospital. Blanche has told Stella what happened, but Stella cannot bring herself to believe it. On seeing the doctor and nurse, Blanche resists at first, but the doctor talks to her gently and she goes with them willingly, saying that she has \"always depended on the kindness of strangers\". As Blanche is led away, Mitch tries to attack Stanley but is pulled away by the other poker players. Realizing that Blanche had told her the truth, Stella takes her baby upstairs to the Hubbells' apartment, determined to leave Stanley.",
  "wiki": "https://en.wikipedia.org/wiki/A_Streetcar_Named_Desire_(1951_film)"
}