{
  "year": "1952",
  "name": "Moulin Rouge",
  "plot": "In 1890 Paris , crowds gather at the Moulin Rouge as artist Henri de Toulouse-Lautrec finishes a bottle of cognac while sketching the dancers. Regular patrons arrive: singer Jane Avril teases Henri, dancers La Goulue and Aicha argue, and owner Maurice Joyant offers Henri free drinks for a promotional poster. After closing, Henri reveals his 4-foot-6-inch (137 cm) stature. A flashback shows that, as a child, he injured his legs in a fall, which never healed due to a genetic disorder from his parents being first cousins . On his way home to Montmartre , Henri helps streetwalker Marie Charlet escape the police. Impressed by her lack of judgment about his disability, Henri allows her to stay with him. He soon realizes poverty has made her both harsh and free from societal hypocrisy. After a night out, she insults a portrait he painted of her, and he throws her out, sinking into alcoholism. His landlady Madame Louet contacts his mother Countess Adele, who urges him to find Marie to lift his spirits. Henri finds her drunk in a café, where she admits she stayed with him only to save money for her boyfriend, who has now left her. Depressed, Henri returns home and contemplates suicide but finds sudden inspiration to complete the Moulin Rouge poster. Surviving his crisis, he arranges for Marie to receive money for a new life. Henri delivers the poster to Maurice, who accepts it despite its unconventional style. His success grows, but one of his risqué portraits leads his father to denounce his work. Henri continues depicting Parisian nightlife, gaining fame but few friends. One day, he meets a young woman, Myriamme Hyam, on the Pont Alexandre III , seemingly about to jump into the Seine. She assures him she is not suicidal and throws a key into the river. Later, while shopping with Jane, Henri recognizes Myriamme modeling gowns. A friend of Jane's, she lives independently. Henri is surprised when Myriamme reveals she bought his portrait of Marie at a flea market. The key Myriamme discarded belonged to a suitor, Marcel de la Voisier, who wanted her as a lover but refused to marry her. Though cynical about love, Henri begins to fall in love with her. One evening, Henri and Myriamme encounter La Goulue, now a washed-up, drunken figure, and Henri realizes the Moulin Rouge has become respectable. Myriamme informs Henri that Marcel has proposed. Henri bitterly congratulates her. When she asks if he loves her, Henri lies and says he does not, believing she is toying with his feelings. The next day, Henri receives a letter from Myriamme, confessing her love and that his bitterness has ruined their chance at happiness. He rushes to her apartment, but she has already left. A year later, Henri, now an alcoholic, is found drunk in a dive bar, still obsessed with Myriamme's letter. Taken home, he suffers from delirium tremens and hallucinates cockroaches. While trying to fend them off, he falls down the stairs. Taken to his family's chateau, his condition worsens. On his deathbed, Henri's father informs him he will be the first living artist to be exhibited in the Louvre and begs for forgiveness. In his final moments, Henri envisions figures from his Moulin Rouge paintings dancing around his room.",
  "wiki": "https://en.wikipedia.org/wiki/Moulin_Rouge_(1952_film)"
}