{
  "year": "1952",
  "name": "The Greatest Show on Earth",
  "plot": "Brad Braden is the no-nonsense general manager of the world's largest railroad circus . The show's board of directors want a short 10-week season rather than risk losing money in a postwar economy. Brad bargains to keep the circus on the road as long as it is profitable, thus keeping the 1,400 performers and staff employed. Brad tells Holly, his aerialist girlfriend, that she is no longer the starring act with top billing . World-famous aerialist (and notorious ladies man) \"The Great Sebastian\" has been hired as the main star to increase attendance. Heartbroken Holly claims Brad has no feelings. Meanwhile, beloved Buttons the Clown, who never appears without his makeup, seems to possess medical knowledge. Holly later reads a newspaper article about a mercy killer , but does not immediately connect the doctor who killed his wife to Buttons. Sebastian arrives and is coldly greeted by two former lovers: Angel, who performs in the elephant act with the pathologically jealous Klaus, and Phyllis, another circus performer who does both an iron jaw and vocal performance act. Sebastian, attracted to Holly, offers her the center ring, knowing Brad will never allow the change. Disappointed, Holly vows her ring will become the main focus. Buttons' mother attends a performance, warning him the police are on his trail. Meanwhile, the competition between the two aerialists becomes increasingly dangerous. The aerial duel ends when Sebastian removes his safety net , then suffers a serious fall when a stunt goes wrong. Buttons tends to him before the ambulance arrives, impressing the circus' doctor. Holly regains the center ring and star billing, but is devastated by how she attained it. Brad is unable to comfort her because she has romantic feelings for Sebastian. Brad catches and fires crooked midway concessionaire Harry for cheating customers. Harry hangs about the show's periphery sowing disaffection, particularly with the jealous Klaus. Sebastian eventually rejoins the show, but with his right arm paralyzed, can only do menial work. A guilt-ridden Holly professes she loves Sebastian, believing Brad has no feelings for her. When Angel starts a relationship with Brad, Klaus threatens to kill Angel during a performance with one of the elephants. Brad intervenes and fires Klaus. An FBI special agent hunting the mercy killer accompanies the circus train , believing the doctor might be hiding in the show. Brad, never having seen Buttons out of makeup, does not recognize the doctor's photo. Meanwhile, Buttons tells Brad that Sebastian has regained some feeling in his hand. Brad, having made the connection, casually mentions that the FBI man will be taking fingerprints at the next stop, allowing Buttons to escape or lie low. Harry and Klaus stop the first train to rob the pay wagon. Klaus sees the second section coming, and realizes that Angel is aboard. He turns his car's headlights down the track to warn the oncoming train. Unable to brake in time, the second train smashes the car, killing Klaus and Harry, then collides with the first section, causing destruction and mayhem. Brad is pinned in the wreckage and severely bleeding. Holly stops Buttons from slipping away and begs him to help Brad. Buttons gives Brad a direct blood transfusion from Sebastian. Special Agent Gregory assists him and afterwards reluctantly arrests Buttons. Holly takes command, mounting a parade and an open-air performance. Brad realizes he loves Holly, and Sebastian proposes to Angel. Holly leads the performers in an improvised \"spec\" around the three rings – a recovery from the disaster that insures the circus will continue its national tour.",
  "wiki": "https://en.wikipedia.org/wiki/The_Greatest_Show_on_Earth_(film)"
}