{
  "year": "1954",
  "name": "Seven Brides for Seven Brothers",
  "plot": "In 1850 Oregon Territory , backwoodsman Adam Pontipee goes to town for supplies and to find a bride. He meets Milly, the pretty young cook at the town bar. Seeing her strength, hardworking attitude, and culinary skills, he proposes. She accepts and they immediately marry, but upon arriving at the Pontipee mountain homestead, Milly discovers that Adam has six younger brothers – Benjamin, Caleb, Daniel, Ephraim, Frank, and Gideon – who are uncouth and expect Milly to clean and cook for them.  Milly angrily ruins dinner and retreats to the bedroom, where she bans Adam from their bed. Adam, at first, crawls out the window to sleep in a nearby tree; eventually, Milly and Adam reconcile, with Milly regretting her high hopes concerning marriage. Milly begins teaching Adam's brothers hygiene and manners; eventually, this extends to advice on romance and courtship. At a town barn-raising event, the Pontipees display their newly acquired social graces as they meet Dorcas, Ruth, Martha, Liza, Sarah, and Alice, who are immediately attracted to the brothers. The girls' initial suitors, overcome with jealousy, attack the Pontipees during the barn-raising. In the ensuing brawl, the barn is destroyed. Winter sets in. The brothers pine for their loves back in town. To console them, Adam reads from Milly's copy of Plutarch 's Parallel Lives about the Sabine women , whom the ancient Romans kidnapped to be their wives. Adam then claims his brothers should do the same to get their prospective brides. The Pontipees sneak into town at night and kidnap the girls. As they race back to the homestead, the men trigger an avalanche that blocks the mountain pass, stopping their pursuers. However, the Pontipees realize they neglected to procure a parson to conduct the wedding ceremonies and are snowed in until spring. Milly is furious with Adam and the brothers and exiles them to the barn while the girls stay in the house. Humiliated and angry by Milly's rebuke, Adam leaves for the Pontipees' trapping cabin to spend the winter alone. Over the winter, the girls vent their anger by pranking the brothers, but their feelings gradually soften towards them. Meanwhile, Milly reveals she is expecting a baby. By springtime, the girls and the Pontipees have happily paired off. When Milly has a baby girl, Gideon goes to tell Adam. He refuses to return. Gideon chastises Adam over his selfishness and behavior toward Milly. Adam returns after the snow melts and meets his daughter. He and Milly reconcile. Adam admits that being a father, he now understands how families feel about their daughters and tells his brothers they must return the girls. The heartbroken brothers agree to take them home. However, the girls hide and refuse to go back. As the brothers search, the girls' angry families reach the Pontipees' homestead. As the townsmen sneak up to the farm, Alice's father, Reverend Elcott, hears a baby crying. Fearing the worst, he asks the girls whose baby it is. They immediately conspire together and simultaneously answer \"mine!\" The fathers begrudgingly allow their daughters to marry the brothers in a collective shotgun wedding .",
  "wiki": "https://en.wikipedia.org/wiki/Seven_Brides_for_Seven_Brothers"
}