{
  "year": "1954",
  "name": "Three Coins in the Fountain",
  "plot": "Young American secretary Maria Williams arrives in Rome and is greeted by Anita Hutchins, the woman whom she is replacing at the United States Distribution Agency. They drive to the Villa Eden, which Anita shares with Frances, the longtime secretary of American author John Frederick Shadwell, an expatriate living in Rome. On their way into town, the three women stop at the Trevi Fountain . Frances and Anita tell Maria that according to legend, if she throws a coin in the fountain and makes a wish to return to Rome, she will. Maria and Frances throw in their coins, while Anita, who is planning to return to the United States to marry, declines. Anita takes Maria to the agency and introduces her to Giorgio Bianchi, a translator. Maria senses that Anita and Giorgio are attracted to each other, though Anita states that the agency forbids its American and Italian employees to fraternize. Later that evening at a party, Maria becomes smitten with the handsome Prince Dino di Cessi, despite being warned by Frances and Anita of his reputation as a womanizer who is notorious for taking his girlfriends to Venice for romantic trysts. Dino charms Maria, telling her to ignore what she has heard about him. Walking home after the party, Anita confesses to Maria that she has no fiancé but believes she has a better chance of finding a husband in the United States, since wealthy Italian men are not interested in mere secretaries, and the men who are interested are too poor. They later encounter Giorgio, who invites Anita to attend a celebration with him at his family's country farm the next day. Anita reluctantly agrees. The next morning, as Giorgio picks Anita up in his cousin's dilapidated truck, they are spotted by her boss, Burgoyne. On Giorgio's family farm, Giorgio tells Anita that he hopes to become a lawyer, despite his poverty. The couple later give in to their attraction and they kiss. Meanwhile, back at the apartment, Dino asks if Maria will accompany him to Venice. Desiring to see Venice but not wanting to lose Dino's respect, Maria arranges for Frances to chaperone them—to Dino's disappointment. At the agency on Monday, Burgoyne questions Maria about Anita's weekend with Giorgio, and although she maintains that Anita did nothing wrong, Burgoyne assumes Anita is having an affair with Giorgio. The following day, he fires Giorgio. Anita blames Maria for betraying her confidence and insists on moving out of their apartment. She visits Giorgio, worried that she might have ruined his chances of becoming a lawyer. Giorgio has no regrets. Determined to win Dino's affections, Maria collects information about his interests and preferences, including his love of modern art and his favorite food and wine. She also lies about being \"three-quarters Italian\". Beguiled by how much he apparently has in common with Maria, Dino introduces her to his mother, the Principessa, who expresses her approval. When Dino confides in Maria that his mother is the only woman whom he has ever completely trusted, she confesses her subterfuge, showing Dino her notebook listing his interests. He angrily takes her home. Frances meets Anita, who admits that she and Giorgio are in love but will not marry because he is too poor. Frances returns home to comfort the guilt-stricken Maria, who also plans to leave Rome because Dino has not contacted her since her admission. The next morning, Frances suddenly announces to Shadwell that she is returning to the United States, not wanting to end up as an old maid in a foreign country. Shadwell, unaware that Frances has been in love with him for 15 years, offers her a marriage of convenience based on mutual respect, which she accepts. The next day, Shadwell learns that he is terminally ill and has less than a year to live unless he goes to the US for experimental treatment. Shadwell returns to his villa and coldly ends his engagement to Frances. After learning from Shadwell's doctor the truth about his condition, Frances follows him to a café, where they drown their sorrows while bickering about whether he should pursue treatment. After taking an intoxicated Frances back to the villa, Shadwell visits Dino and informs him that he is leaving for the United States, where he will marry Frances. Shadwell uses reverse psychology to convince Dino that he loves Maria. After Anita and Maria are packed and ready to leave, Frances telephones and asks to meet them at the Trevi Fountain. There, Maria and Anita are disappointed to see the fountain emptied for cleaning. When they are joined by Frances, however, the water springs up again, much to the women's excitement. Dino and Giorgio arrive, and as the men embrace their respective girlfriends, Frances is joined by Shadwell, and they happily admire the fountain.",
  "wiki": "https://en.wikipedia.org/wiki/Three_Coins_in_the_Fountain_(film)"
}