{
  "year": "1954",
  "name": "On the Waterfront",
  "plot": "New York prizefighter Terry Malloy's career was cut short when he purposely lost a fight at the request of mob boss Johnny Friendly. Terry now works for Friendly's labor union as a longshoreman while his older, more educated brother Charley is Friendly's right-hand man. Terry is coerced into luring fellow worker Joey Doyle onto a rooftop, where he believes Friendly's henchmen want to talk Joey out of testifying to the Waterfront Crime Commission . When they instead murder Joey by throwing him off the roof, Terry confronts Friendly, but is threatened and bribed into acquiescence. Joey's sister Edie and priest Father Barry try to inspire the dockworkers to stand up to Friendly. Terry attends the meeting as a snitch, but when it is violently broken up by Friendly's men, he helps Edie escape and misses Father Barry convincing one worker to testify. After the testimony, the worker is killed in a staged workplace accident. Terry's unwillingness to testify is softened by his growing feelings for Edie, and her and Father Barry’s pursuit of justice. He confesses his role in Joey's death to both. Shocked by this, Edie distances herself from him. Friendly sends Charley with a job offer to keep Terry quiet. Knowing refusal will get Terry killed, Charley urges him to comply. When Terry expresses regret about throwing his best fight and blames Charley for setting up the fix, Charley hands him a gun and tells him to run. Terry finds Edie and they kiss. After hearing someone in the street, they find Charley murdered. Determined to kill Friendly, Terry is convinced by Father Barry to instead testify in court. Following the hearing, Friendly loses his powerful connections and faces indictment . When he is excluded from the next hiring call at the harbor, Terry confronts Friendly together with the other workers, saying that he is proud of testifying and no longer betraying himself. After seeing Terry get beaten severely by Friendly’s thugs, the longshoremen refuse to work without him and renounce Friendly, wishing to run the union \"on the up-and-up\". Encouraged by Edie and Father Barry, Terry stumbles to the warehouse. The men follow him inside and the door closes, leaving Friendly outside, ignored by the workers and shippers.",
  "wiki": "https://en.wikipedia.org/wiki/On_the_Waterfront"
}