{
  "year": "1955",
  "name": "Marty",
  "plot": "Marty Piletti is an Italian-American butcher who lives in The Bronx with his mother. Unmarried at 34, the good-natured but socially awkward Marty faces constant badgering from customers, family and friends to settle down (\"You ought to be ashamed of yourself\") as they point out all his brothers and sisters are married, most of them with children. Not averse to marriage but disheartened by his lack of prospects, Marty has reluctantly resigned himself to bachelorhood. After being harassed by his mother into going to the Stardust Ballroom one Saturday night, Marty connects with Clara, a plain high school science teacher, who is weeping outside on the roof after being abandoned by her blind date. Marty and Clara spend the evening together dancing, walking the busy streets, and talking in a diner. Marty eagerly spills out his life story and ambitions, and they encourage each other. He takes Clara to his house, where he awkwardly tries to kiss her and is rebuffed. Clara explains she just didn't know how to handle the situation; she does like him and wants to see him again. They kiss briefly and embrace. At this point, Marty's mother returns, not pleased to see her son with a strange woman. Clara joins a brief chat with her and Marty, but Mrs. Piletti clearly does not care for her or her opinions. Marty takes Clara home by bus, promising to call her at 2:30 the next afternoon, after Mass. Overjoyed on his way back home, he punches the bus stop sign and weaves between the cars, looking for a cab instead. Meanwhile, Marty's Aunt Catherine reluctantly moves in with Marty and his mother (at the plea of Marty's cousin and his wife, who are having a hard time with a new baby and a demanding live-in mother-in-law). Catherine privately warns her sister that Marty will soon marry and cast her aside. Fearing that Marty's new romance could spell her abandonment, his mother belittles Clara to Marty the next day before Mass. Marty's friends, with an undercurrent of envy, deride Clara for her plainness. They try to convince Marty to forget her and remain with them, unmarried, in their fading youth. Harangued into submission by the pull of his friends, Marty fails to call Clara. That night, back in the same lonely rut, Marty realizes he is giving up a woman whom he not only likes but who makes him happy. Over his friends' objections, he dashes to a phone booth to call Clara, who is disconsolately watching television with her parents. When his friend Angie asks what he's doing, Marty bursts out: Just before calling Clara, Marty needles Angie with the same words he's heard so often himself: \"Hey Ange, when are *you* gonna get married? You should be ashamed of yourself.\" Marty closes the phone booth door when Clara answers the phone. In the last line of the film, Marty says, \"Hello...Hello, Clara?\"",
  "wiki": "https://en.wikipedia.org/wiki/Marty_(film)"
}