{
  "year": "1956",
  "name": "Giant",
  "plot": "In the mid-1920s, wealthy Texas rancher Jordan \"Bick\" Benedict Jr. travels to Maryland to purchase a horse and meets socialite Leslie Lynnton. The two marry and return to the Benedict family's expansive cattle ranch, Reata, in Texas. Upon arrival, Leslie clashes with Bick’s strong-willed sister, Luz, who resents her presence and maintains control over the household. Leslie gradually discovers the deeply rooted patriarchal norms and racial hierarchies in Texas society, particularly the systemic discrimination against the region’s Hispanic population. During a tour of the ranch with Jett Rink, a ranch hand infatuated with Leslie, she observes the harsh living conditions of the Hispanic workers and urges Bick to improve their circumstances. Her efforts include arranging medical care for Angel Obregón Jr., the infant son of one of the workers, though Bick is initially reluctant to allow their family doctor to treat non-white patients. Luz is killed after being thrown from Leslie’s horse, War Winds. In her will, she bequeaths a small parcel of land to Jett, angering Bick. Jett declines Bick’s offer to purchase the property and names it \"Little Reata.\" Leslie and Bick have twins, Jordan III (\"Jordy\") and Judy, followed by a daughter, Luz II. Marital tensions lead Leslie to take the children to her parents in Maryland for an extended stay. Bick follows, and the couple reconciles and returns to Texas. Meanwhile, Jett works his land and eventually strikes oil. With his newfound wealth, he attempts to persuade Bick to permit oil drilling on Reata, but Bick refuses, determined to preserve the ranch’s cattle legacy. By 1941, the Benedict children have grown, and new tensions emerge. Bick expects Jordy to take over the ranch, but Jordy wishes to become a doctor. Leslie wants Judy to attend finishing school in Switzerland, though Judy aspires to study animal husbandry at Texas Tech . Each child successfully convinces one parent to support their goals. At the family’s Christmas gathering shortly after the attack on Pearl Harbor , Bick offers Judy’s husband, Bob Dace, a postwar position on the ranch, which he declines in favor of building an independent life with Judy. Realizing his children are unlikely to continue the family ranching tradition, Bick finally agrees to allow oil drilling on Reata. The family grows wealthier, but Angel Obregón Jr. is killed in the war. Jordy later marries Juana, the daughter of the Hispanic doctor who had treated Angel as a child. Jett, now a powerful oilman, hosts a lavish event at his Austin hotel and invites the Benedicts. A flirtation between Jett and Luz II ends after she rejects his awkward marriage proposal. Jett becomes intoxicated and orders that Hispanics not be served at his hotel, resulting in Juana being ignored at the beauty salon. When Jordy confronts Jett, he is assaulted and removed from the premises. Bick challenges Jett but, recognizing his inebriated state, refrains from physical retaliation. Jett later collapses during an attempt to deliver a speech at the event. Luz II overhears his lament over his long-unrequited love for Leslie and departs, visibly affected. The next day, while driving home, the Benedicts stop at a diner where the owner, Sarge, insults Juana and her and Jordy’s young son. When Sarge attempts to eject a Hispanic family, Bick intervenes and engages in a fight, ultimately being knocked unconscious. Back at Reata, he reflects on his perceived failure to uphold the family legacy. Leslie reassures him, stating that his actions at the diner made him her hero and that their legacy is embodied in their two grandsons—one white and one Hispanic. [ 6 ]",
  "wiki": "https://en.wikipedia.org/wiki/Giant_(1956_film)"
}