{
  "year": "1957",
  "name": "Witness for the Prosecution",
  "plot": "Senior barrister Sir Wilfrid Robarts is nearing retirement after a heart attack . He agrees to defend Leonard Vole, despite Nurse Plimsoll's objections and Sir Wilfrid's doctor having warned against taking stressful criminal cases. Leonard is accused of murdering Emily French, a wealthy, childless widow who fell in love with him and named him as the main beneficiary in her will. Sir Wilfrid speaks with Leonard's German wife, Christine, whom he finds cold and self-possessed; she provides a not entirely plausible alibi. During the trial in the Old Bailey , the Crown introduces testimony that Mrs. French had seen Leonard with a younger woman and planned to confront him, but Sir Wilfrid believes his client to be innocent. He is shocked when Christine is called to give evidence against Leonard as a prosecution witness. While a wife cannot be compelled to testify against her husband , it is revealed that her marriage to Leonard is invalid, as she was already married to another man, Otto Helm, still alive and living in Germany. She states that she never loved Leonard, and her conscience compels her to tell the truth. She explains that she had a marriage ceremony with Leonard, a Royal Air Force sergeant serving in Berlin's British occupation zone , solely to escape from Soviet-controlled territory to the West. According to her testimony, Leonard confessed that after being confronted by Mrs. French, he had killed her to avoid being disinherited from her will. While fearing his client will be convicted and sentenced to hang , Sir Wilfrid is unexpectedly contacted by a woman who offers to sell him letters written by Christine to a lover named Max. The handwriting is genuine, and the woman has a legitimate reason for providing the letters: her lover attacked and disfigured her face. During cross examination, Sir Wilfrid reads the letters, which disclose a conspiracy between Max and Christine to frame Leonard. The jury acquits Leonard. Sir Wilfrid's worries prove justified when Christine, brought into the courtroom to protect her from the departing crowd, explains how she won the acquittal. After Sir Wilfrid had previously told Christine that a jury would not believe a loving spouse's alibi, she posed as a hateful, double-crossing wife. She also wrote letters to a non-existent lover (Max) and impersonated the disfigured woman who gave Sir Wilfrid the letters to discredit her own testimony. Christine loves Leonard, but knew he was guilty. Christine told the truth about the murder in the witness-box: Leonard did confess to her. Christine overhears Leonard gleefully boasting that he manipulated and murdered Mrs. French. Sir Wilfrid, who had believed in his client's innocence, is outraged. However, due to English double jeopardy laws, no further legal action can be taken against Leonard. Leonard says he is having an affair with the much younger woman seen by Mrs. French, and intends to abandon Christine. He smugly states that though Christine will be tried for perjury , he and she are now even, having saved each other's lives. A devastated Christine grabs a knife and fatally stabs Leonard. As she is arrested, Sir Wilfrid decides to further delay his retirement to defend Christine.",
  "wiki": "https://en.wikipedia.org/wiki/Witness_for_the_Prosecution_(1957_film)"
}