{
  "year": "1957",
  "name": "The Bridge on the River Kwai",
  "plot": "In February 1943, a contingent of British prisoners of war , led by Colonel Nicholson, arrive at a Japanese prison camp in Thailand . United States Navy Commander Shears describes the horrific conditions to Nicholson, who forbids any escape attempts because they had been ordered to surrender by their own headquarters. Colonel Saito, the camp commandant, informs the prisoners the camp needs no fences because the surrounding jungle makes escape impossible and that they will be used as labour to construct a bridge over the River Kwai for the railway connecting Thailand and Burma . Nicholson objects, citing the Geneva Convention exempting officers from manual labour. Saito threatens to have the officers shot, but Major Clipton, the British medical officer, warns him there are too many witnesses. The officers are left standing in the intense heat until evening when Saito confines them to a punishment hut. Nicholson is beaten and locked in an iron box. Shears becomes the only survivor of an escape attempt and recuperates in British Ceylon after being tended to by Thai civilians. British sabotage and deliberately slow work impedes bridge construction, made worse by incompetent Japanese engineering. When Nicholson is released from confinement, he is shocked by the poor job his men have done and orders the construction of a proper bridge that he feels will be a lasting tribute to the British Army 's superiority. Clipton unsuccessfully argues it is collaboration with the enemy. Even though Saito had given in to his principled stand and excused the British officers from manual labour, Nicholson volunteers them to join in the physical work. Shears' comfortable life in Ceylon is shaken up when Major Warden tries to recruit him for a commando mission to destroy the bridge. Shears reveals he impersonated an officer to get better treatment in the camp, but Warden already knew of his deception and arranged his attachment to the British military, forcing him to participate. Warden, Shears, Chapman and Joyce parachute into Thailand. Chapman dies on landing, and Warden is wounded in an encounter with a Japanese patrol. Khun Yai, a village chief, and a group of Thai women guide the trio to the river. Under cover of darkness, Shears and Joyce plant explosives at the base of the bridge towers and plan to destroy it and the first train to cross, scheduled for the next morning. Sunrise reveals the river level has dropped, exposing the wire leading to the detonator. Nicholson spots the wire, and he and Saito investigate as the train approaches. Nicholson pulls up the wire on the riverbank, leading them toward Joyce, who is manning the detonator. Joyce breaks cover and stabs Saito to death. Nicholson calls for help and attempts to stop Joyce from reaching the detonator. After Joyce is shot, Shears swims across the river to detonate the explosives but is fatally wounded. Recognizing Shears, Nicholson exclaims, \"What have I done?\" Warden fires a mortar , wounding Nicholson. Dazed, Nicholson stumbles towards the detonator and falls on the plunger, blowing up the bridge; the train tumbles into the river. Warden, turning toward the group’s horrified guides, pleads, \"I had to do it! They might have been taken alive!\". Witnessing the carnage, Clipton exclaims, \"Madness! ... Madness!\"",
  "wiki": "https://en.wikipedia.org/wiki/The_Bridge_on_the_River_Kwai"
}