{
  "year": "1958",
  "name": "Cat on a Hot Tin Roof",
  "plot": "Late one night, a drunken Brick Pollitt is on a track field trying to recapture his glory days of high school sports by leaping hurdles, reminiscing about his moments as a youthful athlete. He breaks his ankle, leaving him dependent on a crutch. The next day, Brick and his wife Maggie (\"the Cat\") visit his family's plantation in the Mississippi Delta to celebrate the 65th birthday of Brick's father, Big Daddy. Depressed, Brick has spent the last few years drinking while resisting the affections of his wife, who shares with him her worries about the inheritance of Big Daddy's wealth. There is speculation in the family about why Maggie is childless, while Brick's brother Gooper and his wife Mae have five children and another on the way. Big Daddy and Big Mama arrive home from the hospital by private airplane and are greeted by Gooper, Mae, and their children, along with Maggie. Annoyed by the rehearsed display that his grandchildren gave him, Big Daddy ignores them and drives to the house with Maggie. The news is that Big Daddy is not dying of cancer . However, his doctor meets privately, first with Gooper and then with Brick, to divulge that it is a deception: Big Daddy has inoperable cancer and will likely be dead within a year, and the truth is being kept from him, as well as from all the women in the family. Brick reveals this to Maggie, and she is heartbroken. Maggie wants Brick to take an interest in his father for both unselfish and selfish reasons, but he stubbornly refuses. As the party winds down, Big Daddy meets with Brick in his room, and says that he is fed up with Brick's behavior and alcoholism, demanding to know why he is so stubborn. At one point, Maggie joins them and, at Brick's insistence, reveals what happened a few years ago, on the night when Brick's best friend and football teammate, Skipper, took his life. Maggie was jealous of Skipper because he had more of Brick's time. She explains that Brick's infatuation with Skipper was misguided, as Skipper was far less good on the field and in life than Brick wanted to believe, and Skipper depended on Brick much more than Brick depended on Skipper. She says that Skipper was lost without Brick at his side. She thought about ruining their relationship \"by any means necessary\". To this end, she considered making love with Skipper, and use this information to let her husband question Skipper's loyalty. However, when she found herself in Skipper's hotel bedroom, she realized that she could have lost Brick instead, she changed her mind and ran away. That very same night, Skipper phoned Brick falsely claiming to have made love with Maggie. Since then, Brick had blamed Maggie for infidelity, hence refusing making love to her. Also, Brick had blamed himself for not having answered further phone calls from Skipper that night, hence his self-destruction with alcohol out of sense of guilt for Skipper's death. After an argument, Brick lets it slip to Big Daddy that Big Daddy will die of cancer, and that this birthday will be his last. Shaken, Big Daddy retreats to the cellar. Meanwhile, Gooper, who is a lawyer, and his wife Mae argue with Big Mama about the family's cotton business and Big Daddy's will, which Gooper, egged on by the scheming Mae, plans to use to cut Brick and Maggie out of the family fortune. Brick descends into the cellar, a labyrinth of antiques and family possessions, mostly bought by Big Mama, according to the decorative role typically reserved to a wealthy man's wife. Brick and Big Daddy confront each other in front of a large cutout of Brick in his glory days as an athlete. After Big Daddy tells Brick about his hobo father, a veteran of the Spanish-American War who, despite being a poor tramp, loved his young son and kept him with him always, the pair reaches a reconciliation of sorts. The rest of the family begins to crumble under pressure, with Big Mama stepping up as a strong figure. Maggie says that she would like to give Big Daddy her birthday present: the announcement of her pregnancy. After the jealous Mae calls Maggie a liar, Big Daddy and Brick defend her, although Brick knows that Maggie is not pregnant, and Big Daddy suspects it. In their room, Maggie and Brick reconcile and kiss, with the implication that they will make Maggie's lie come true.",
  "wiki": "https://en.wikipedia.org/wiki/Cat_on_a_Hot_Tin_Roof_(1958_film)"
}