{
  "year": "1958",
  "name": "Auntie Mame",
  "plot": "Patrick Dennis, orphaned in 1928 when his father Edwin dies unexpectedly, is placed in the care of his aunt, Mame Dennis, in Manhattan . Mame is flamboyant and exuberant, hosting frequent parties with a variety of guests and free-spirited friends, including the frequently drunk actress Vera Charles; Acacius Page, who runs a progressive school with nudist exercises; and Lindsay Woolsey, a book publisher and devoted suitor. Quickly becoming maternal toward Patrick, Mame aims to give him as broad a view of life as possible. Patrick's inheritance is managed by Dwight Babcock, a trustee of the highly conservative Knickerbocker Bank, who was appointed in Edwin's will to restrain Mame's liberal influence. Without Babcock's knowledge, Mame enrolls Patrick in Page's school. When this is discovered, Babcock forcibly enrolls Patrick into his own alma mater boarding school, preventing Mame from seeing her nephew except during holidays and the summer. When Mame is bankrupted by the 1929 stock market crash , she tries acting with Vera, but Mame's overacting to enhance a small role causes a debacle. She then takes a series of jobs which end disastrously. During one job as a Macy's salesgirl, Mame meets Southern oil baron Beauregard Jackson Pickett Burnside, who seeks her out to relieve her distress when she is fired due to her ineptitude on his large toy order to orphans. Both are smitten, and Beau invites Mame to his estate, where his erstwhile fiancée, Sally Cato MacDougall, makes an attempt on Mame's life by maneuvering her onto an unmanageable horse. Mame and Beauregard are married, travelling around the world on an extensive honeymoon. Mame continues to exchange letters with Patrick, indicating Babcock is influencing him into a more conventional personality, and Patrick joins them periodically. After Beau dies while climbing the Matterhorn in 1937, Mame, now a rich widow, comes home after a prolonged period of mourning to discover the now-adult Patrick has given her a dictaphone, typewriter, and secretary, Agnes Gooch. He, Vera, and Lindsay persuade Mame to write her autobiography but arrange for a collaborator/ ghostwriter , Brian O'Bannion, who rapidly proves to be a fortune hunter. Patrick announces to Mame that he is engaged to Gloria Upson, a girl approved by Babcock from a \" restricted \" community in Connecticut called Mountebank. Initially angered by the change in Patrick's character, Mame relents to please him. She also sabotages O'Bannion's attempted wooing by sending Agnes to a party in her place, lying to O'Bannion that Agnes is a secret heiress. When an inebriated Agnes returns, she barely remembers the evening; she thinks they saw a movie with a wedding scene and that O'Bannion was keen to meet her mother but abandoned her on the way to the working-class neighborhood. After meeting Gloria, who proves to be spoiled and bigoted, Mame visits Gloria's parents in Mountebank at their house, \"Upson Downs\". Finding them boorish and anti-Semitic, Mame invites them and Gloria to a dinner party at her apartment with Patrick, Babcock, and an assortment of friends. On the night of the party, Patrick meets Mame's new secretary, Pegeen, and the two are attracted to each other; Agnes also lives there, now pregnant due to her night with O'Bannion and presumed to be unmarried. The entire party is choreographed to show up the Upsons: Lindsay surprises the attendees with galleys from Mame's autobiography, reminding Patrick of forgotten adventures. The book's release prompts a telegram from O'Bannion demanding half the royalties for his efforts, also revealing that he married Agnes on their night out. When Gloria insults Mame's company, Patrick instead defends them and insults Gloria's own circle, ending their relationship. To the Upsons' horror, Mame dedicates her royalties to a home for refugee Jewish children to be built adjoining the Upson property in Mountebank. The Upsons leave in a huff. Mame berates Babcock for his attempts to manipulate Patrick's life; he also leaves. By 1946, Patrick and Pegeen are married and have a son, Michael. Mame and Michael persuade his parents to let Mame take the child on a journey to India, and the movie fades as Mame tells Michael of all the wondrous sights they will see.",
  "wiki": "https://en.wikipedia.org/wiki/Auntie_Mame_(film)"
}