{
  "year": "1959",
  "name": "The Diary of Anne Frank",
  "plot": "In 1945, after World War II , Otto Frank returns to the Amsterdam garret where his family hid for more than 2 years before being arrested by the Nazis . He is accompanied by Miep Gies and Mr. Kraler , his Christian employees who shielded the Jewish Frank family and 4 others. When Otto searches for the diary kept by his youngest daughter, Anne , Miep promptly retrieves it for him. In July 1942, Anne writes of the restrictions placed on Jews that drove the Franks into hiding over their spice factory. Sharing the Franks' hiding place are the Van Daans and their teenage son, Peter. Kraler and Miep have conspired with Otto to prepare the hideaway. Those hiding are warned to maintain strict silence during daylight while workers are present. Kraler delivers food and a box for Anne, compiled by Otto, containing her beloved movie star photos and a blank diary. As months pass, Anne teases Peter, whose only attachment is to his cat, Mouschi. Otto teaches Anne and her sister, Margot , while Petronella Van Daan passes the time reminiscing of her youth. The strain of confinement causes the Van Daans to argue and pits Anne against her mother, Edith . Kraler brings a radio that provides news of the world. Conditions are growing more dire, with Jews suddenly disappearing, shipped to concentration camps. Kraler asks them to take in another person, Miep's Jewish dentist named Albert Dussel , who confirms that many of their friends have disappeared. Dreaming of one of her friends in a concentration camp, Ann wakes up screaming. In October 1942, news comes of the Allied landing in Africa, and the bombing of Amsterdam intensifies. During Hanukkah , Van Daan abruptly announces that Peter must get rid of Mouschi, who consumes too much food. Their argument is cut short when they hear a prowler break in the front door; the room falls silent until Peter crashes into an object while trying to catch Mouschi. The startled thief grabs a typewriter and flees. A watchman summons police officers, who search the premises, but on hearing Mouschi voice a sound, they are reassured the noise was caused by a stray cat and leave. In January 1944, Anne begins to attract Peter's attention, and Miep brings the group a luxurious cake. Van Daan asks Miep to sell Petronella's fur coat so he can buy cigarettes. Kraler warns that one of the employees asked for a raise after implying that something strange is going on in the attic. Dussel dourly comments that it is just a matter of time before they are discovered. Blaming the adults for the war that has destroyed all hope, Anne storms out of the room; Peter follows to comfort her. Anne confides her dreams of becoming a writer, and Peter voices frustration over his inability to join the war effort. Catching Van Daan trying to steal bread, Edith denounces him, ordering his family to leave. As Dussel and Mrs. Van Daan quarrel over food, word comes over the radio of the Allied invasion of France , and Van Daan breaks into tears of shame. Heartened by the news, everyone apologizes for their harsh words. Anne dreams of being back in school by autumn. By July 1944 the invasion bogs down, and Kraler is hospitalized with ulcers. The police have found the stolen typewriter, and Anne muses that her diary provides a way to live on after death. The Van Daans resume quarrelling, and Peter declares he cannot tolerate the situation. Anne soothes him by reminding him of the goodness of those who have come to their aid. The sirens of an approaching police van interrupt their conversation. Certain of impending arrest, they kiss. As the German police break open the bookcase entrance, Otto declares they no longer live in fear, but can go forward in hope. In 1945, Otto relates to Miep and Kraler his long journey from Auschwitz . Learning of the deaths of Edith, Margot, the Van Daans, and Dussel, he hoped that Anne had survived until meeting a woman from Bergen-Belsen who confirmed Anne's death. Opening Anne's diary, Otto reads, \"In spite of everything, I still believe that people are really good at heart,\" reflecting upon Anne's unshakeable optimism.",
  "wiki": "https://en.wikipedia.org/wiki/The_Diary_of_Anne_Frank_(1959_film)"
}