{
  "year": "1959",
  "name": "Ben-Hur",
  "plot": "In AD 26 [ b ] Jerusalem , Judah Ben-Hur , a wealthy Jewish prince and merchant, lives with his mother, Miriam, and younger sister, Tirzah. The family's steward, Simonides, has a daughter named Esther . Judah grants Simonides' request for Esther to marry a freeman and grants Esther her freedom as a wedding gift. Apart since childhood, Judah and Esther quickly fall in love. Judah's Roman childhood friend, Messala, returns to Jerusalem as commander of the Fortress Antonia . He fully embraces Rome's glory and imperial power while Judah remains devoted to his faith and the Jewish people's freedom. When Messala demands that Judah surrender potential rebels to Roman authorities, Judah refuses and cuts all ties. The procession of Judean governor Valerius Gratus enters the city. As Judah and Tirzah watch from the upper terrace, loose roof tiles fall, spooking the governor's horse and throwing him off. Messala realizes it was accidental but condemns Judah to the galleys and imprisons Miriam and Tirzah. Messala also arrests Simonides. While he and other prisoners are transported, they stop in Nazareth . Denied water, Judah collapses but is revived when a carpenter gives him a drink. After three years in the galleys, Judah is assigned to Roman Consul Quintus Arrius' flagship. Arrius notices Judah's determination and self-discipline and offers to train him as a gladiator or charioteer, which Judah refuses. When Macedonian pirates attack the Roman fleet, Arrius orders that Judah be unchained. The ship's hull is rammed, flooding the galley. Judah frees the other rowers and then rescues Arrius, who was thrown overboard. After being rescued, Arrius learns the battle was won. He later petitions Emperor Tiberius to free Judah, and adopts him as his son . In Rome, Judah becomes a champion charioteer. While returning to Judea, Judah meets Balthasar and Arab Sheik Ilderim. Seeing Judah's prowess as a charioteer, the sheik asks him to drive his four horses in a race before the new Judean governor, Pontius Pilate . Judah declines, despite knowing that Messala is competing. Balthasar tells Judah about a prophet he seeks who preaches love and forgiveness and urges Judah to cast off his consuming hate and vengeance. Judah returns to Jerusalem to search for his mother and sister. At his abandoned house, he finds Esther, who never married, living with her debilitated father and also Malluch, a mute former prisoner. Messala tortured Simonides, who has protected Judah's fortune nonetheless. Presenting himself as Quintus Arrius' son, Judah confronts Messala and demands to know Miriam and Tirzah's fates. Messala orders their release from the dungeons. Both are now lepers and secretly expelled to the Valley of the Lepers. Before leaving the city, the women find and beg Esther to conceal their condition from Judah. Esther tells Judah they are dead to stop him searching. Seeking revenge, Judah agrees to drive Sheik Ilderim's four horses against Messala in the chariot race. The sheik goads Messala into making an enormous wager on himself before revealing Judah is his driver. During the race, Messala drives a beaked chariot , having cutters on the wheel hubs to disable competitors. He attempts to destroy Judah's chariot but wrecks his own instead. Dragged behind his horses, he is trampled by another chariot, while Judah wins the race. Before dying, Messala tells Judah his mother and sister are alive in the Valley of the Lepers. At the leper colony, Judah encounters Esther and Malluch bringing supplies to Miriam and Tirzah. Esther persuades him to conceal himself as his family would wish. She then follows a crowd and Balthasar to hear what is possibly Jesus Christ 's Sermon on the Mount . Judah meets with Pontius Pilate, who fears Judah's victory will stoke rebellion against Roman rule. Judah rejects his patrimony and Roman citizenship. Returning to the leper colony, he reveals himself to Miriam and finds that Tirzah is dying. Judah and Esther take them to see Jesus Christ, but the trial of Jesus has begun. While carrying his cross through the streets , Jesus collapses. Judah recognizes him as the man who gave him water earlier and tries to give him water but a Roman soldier intervenes. As Judah and Balthasar witness Jesus' crucifixion , Miriam and Tirzah are sheltered in a cave with Esther during a violent storm and are miraculously cured. Realizing that forgiveness is better than revenge, Judah returns to his house and finds them healed. Embracing, the four rejoice at the miracle.",
  "wiki": "https://en.wikipedia.org/wiki/Ben-Hur_(1959_film)"
}