{
  "year": "1959",
  "name": "The Nun's Story",
  "plot": "Gabrielle \"Gaby\" Van Der Mal, whose widowed father, Hubert, is a prominent surgeon in Belgium, enters a convent of nursing sisters in the late 1920s, hoping to serve in the Belgian Congo. After receiving the religious name of Sister Luke, she undergoes her postulancy and novitiate which foreshadow her future difficulties with the vow of obedience. She takes her first vows and is sent to the Institute of Tropical Medicine in Antwerp . There, she experiences a crisis when another sister, a weaker student, accuses her of pride. The local superior poses a startling challenge to Sister Luke, suggesting that she deliberately fail her oral examination to demonstrate humility. Hesitating to answer and clearly agonizing over the choice, she eventually passes the exam, finishing fourth in a class of eighty. Afterward, she is assigned not to the Congo but to a European mental hospital, where she assists with the most difficult and violent cases. A violent patient with psychosis, known as the \"Archangel Gabriel\", tricks Sister Luke into opening the cell door in violation of the rules. She attacks Sister Luke, who barely escapes and once again faces the shame of her disobedience. Sister Luke takes her solemn vows and is sent to her long-desired posting in the Congo. Once there, she is disappointed that she will not be nursing the natives, but will instead work in a segregated whites/European patient hospital. She develops a strained but professional relationship with the brilliant, atheistic surgeon there, Dr. Fortunati. Eventually, the work strains and spiritual struggles cause her to succumb to tuberculosis . Fortunati, not wanting to lose a competent nurse and sympathetic to her desire to stay in the Congo, engineers a treatment plan that allows her to remain there rather than having to convalesce in Europe. After Sister Luke recovers and returns to work, Fortunati is forced to send her to Belgium as the only nurse qualified to accompany a VIP who has become mentally unstable. She spends an outwardly reflective but inwardly restless period at the motherhouse in Brussels before the superior general gives her a new assignment. Due to the impending war in Europe, she cannot return to the Congo, and is assigned as a surgical nurse at a hospital near the Dutch border . While at her new assignment, Sister Luke's struggle with obedience becomes impossible for her to sustain as she is repeatedly forced into compromises to cope with the reality of the Nazi occupation , including that they have killed her father. No longer able to continue as a nun, she requests and is granted a dispensation from her vows. She is last seen changing into lay garb and exiting the convent through a back door.",
  "wiki": "https://en.wikipedia.org/wiki/The_Nun%27s_Story_(film)"
}