{
  "year": "1960",
  "name": "The Apartment",
  "plot": "C.C. \"Bud\" Baxter is a lonely minor office worker at a large insurance company in New York City. To climb the corporate ladder, he allows four company managers to take turns borrowing his Upper West Side apartment for their extramarital affairs. Baxter meticulously juggles the \"booking\" schedule; overheard sounds of women and partying from his apartment and empty liquor bottles in his trash convince his neighbors that he is a playboy. Baxter earns glowing performance reviews from the four managers, flagging the attention of personnel director Jeff Sheldrake. Sheldrake deduces the real reason, but promises Baxter a promotion in return for a key to his apartment, starting that night. As compensation for such short notice, he gives Baxter two tickets to The Music Man and promotes him (Baxter has a personal office now). Baxter asks Fran Kubelik, an elevator operator in the office building to whom he is attracted, to join him. She explains she already has a date for the evening, but agrees to meet him at the theater before showtime. Her date turns out to be with Sheldrake, whom she had been trysting before breaking it off. When Sheldrake tells her that he plans to divorce his wife to be with her, she agrees to go with him to Baxter's apartment, while Baxter waits forlornly outside the theater. She leaves a compact with a cracked mirror in the apartment, which Baxter then gives to Sheldrake During the company's raucous Christmas Eve party, Baxter is very proud to tell Fran about his promotion until he sees in her hands the pocket mirror, she had left at home and realizes that it is her that Sheldrake is seeing in secret. Baxter doesn't tell Fran what he has realized. Sheldrake's secretary Miss Olsen tells Fran that her boss has had numerous affairs with office personnel, including herself. Later, Fran confronts Sheldrake at Baxter's apartment. When she gives him a wrapped Christmas present, he gives her a $100 bill from his wallet and tells her to buy herself something expensive. Claiming he loves her, he rushes for the train back to his family in White Plains . Finding out that Fran is the woman Sheldrake has been taking to his apartment, Baxter gets drunk at a local bar. Killing time before he can go home, he allows himself to be picked up by a married woman; they then head back to his apartment. There, he discovers Fran passed out on his bed from an overdose of his sleeping pills. He ditches the woman and enlists his neighbor, Dr. Dreyfuss, to revive Fran. Baxter implies that he was responsible for the incident; Dreyfuss scolds him for philandering and advises him to \"be a mensch .\" Fran spends two days recuperating in Baxter's apartment, during which a bond develops between them, especially after he confesses to his own suicide attempt over unrequited love back in his hometown of Cincinnati. Fran says that she has always suffered bad luck in her love life. During Fran's stay, one of the managers arrives for a tryst. Baxter persuades him to leave, but the manager recognizes her and later informs his colleagues. Though impressed, they are nonetheless annoyed that they have not had the same ready access to the apartment since Baxter's promotion. When Fran's brother-in-law Karl shows up at the office building looking for her, he is sent to Baxter's apartment, catching him in the middle of preparing a romantic dinner. Baxter deflects Karl's anger over Fran's wayward behavior by once again assuming all responsibility. Karl punches him, prompting Fran to kiss Baxter on the forehead for protecting her. When Sheldrake learns that Miss Olsen has ratted him out to Fran, he fires her. She retaliates by spilling all to his wife, who throws him out. Now free, Sheldrake tries to renew his pursuit of Fran. Having promoted Baxter to Assistant Personnel Director, Sheldrake expects to be lent the key to his apartment yet again. Baxter gives him one — to the building's \"executive washroom\" — proclaiming that he is quitting the firm in favor of becoming a mensch . Back home, he begins to pack his things at his apartment room. That night, at a New Year's Eve party, Sheldrake indignantly tells Fran about Baxter quitting, complaining that Baxter refused to let him use his apartment. Fran abandons Sheldrake and runs to the apartment. At the door, she hears an apparent gunshot, but Baxter opens the door holding a bottle of frothing champagne. Fran retrieves a deck of cards to resume a game of gin rummy they had started earlier. Baxter declares his love for Fran with a tender smile. She replies: “Shut up and deal”.",
  "wiki": "https://en.wikipedia.org/wiki/The_Apartment"
}