{
  "year": "1961",
  "name": "The Guns of Navarone",
  "plot": "In 1943, the Axis powers plan an assault on the island of Keros , where 2,000 British soldiers are marooned , hoping to convince neutral Turkey to join them. Rescue by the Royal Navy is prevented by two enormous radar -directed large-calibre guns on Navarone Island. Aerial bombing fails to destroy the guns and Allied Intelligence assigns a commando unit to infiltrate Navarone and destroy the guns. Led by Major Roy Franklin, the team is composed of Captain Keith Mallory, an ex-spy and an officer with the Long Range Desert Group ; Colonel Andrea Stavros from the Greek Army ; Franklin's friend Corporal Miller, an explosives expert and chemistry professor; Greco-American Spyros Pappadimos, a native of Navarone; and \"The Butcher of Barcelona\" Brown, an engineer and knife fighter. Disguised as Greek fishermen they cross the Aegean Sea and overwhelm the crew of a German patrol boat. Mallory confides to Franklin that Stavros has sworn to kill him after the war, because Mallory was inadvertently responsible for the deaths of Stavros's wife and children. After being shipwrecked on the coast of Navarone, Mallory leads the team up the cliff and Franklin injures his leg. Mallory stops Franklin's trial to kill himself, and lies that their mission has been scrubbed in favour of an amphibious assault. They rendezvous with two resistance fighters, Spyros's sister Maria and her friend Anna, who had been tortured by the Germans before escaping. The group is captured trying to find a doctor for Franklin's gangrenous leg. They overpower their captors and escape in German uniforms, leaving Franklin behind to receive medical attention. Franklin is injected with scopolamine and repeats Mallory's misinformation. The Germans redeploy forces from the fortress, to counter the anticipated coastal landing. In the village of Navarone, Miller discovers his explosives have been sabotaged by Anna who confesses the Germans recruited her in exchange for her release. Maria shoots her dead before Mallory can execute her. Mallory and Miller infiltrate the gun position while Stavros and Spyros create distractions in town. Maria and Brown steal a boat for their escape. Spyros dies in a shootout with a German officer, and Brown is stabbed during the boat theft. Mallory and Miller plant explosives on the guns and prepare a booby trap on the track of an ammunition hoist . The Germans force entry into the gun emplacement and defuse the explosives planted on the guns as Mallory and Miller escape down the cliff and into the stolen boat. A wounded Stavros is helped aboard by Mallory, resolving their feud. Allied destroyers approach to rescue the trapped British troops and the Germans open fire on them. When the hoist reaches Miller's booby trap, the hidden explosives blast apart the fortress and the guns are silenced. Mallory's team is rescued by the British convoy. Stavros has fallen in love with Maria and returns to Navarone with her. Mallory and Miller observe the aftermath of their success from a destroyer.",
  "wiki": "https://en.wikipedia.org/wiki/The_Guns_of_Navarone_(film)"
}