{
  "year": "1962",
  "name": "Lawrence of Arabia",
  "plot": "T. E. Lawrence dies in a motorcycle accident in 1935. At a memorial service at St Paul's Cathedral , it becomes clear that several influential Britons dislike him. During the First World War , Lawrence is a misfit lieutenant in the British Army , notable for his effrontery and education. Mr. Dryden of the Arab Bureau sends him to meet with Colonel Harry Brighton, who advises Prince Feisal in his revolt against the Turks . Lawrence is outraged when his guide is killed by Sherif Ali ibn el Kharish for drinking from the latter's well. Lawrence accuses Ali of being a barbarian and is dismayed to learn that the latter is Feisal's advisor. Relations between the United Kingdom and the Arabs are tense. While Britain will supply guns to the Arabs, it will not provide artillery , which would make Feisal an independent force. Brighton asks Feisal to fall back and help the British defend the Suez Canal . Lawrence violates Brighton's orders by encouraging Feisal to attack. Feisal is impressed by Lawrence's familiarity with the Quran and his honesty about British interests in Arabia . Lawrence convinces Feisal to launch a surprise attack on the port of Aqaba to improve his supply lines. Ali protests, as Aqaba is protected from land attacks by the harsh Nefud Desert and the local Turkish enforcer, Howeitat tribal leader Auda Abu Tayi . Feisal gives Lawrence just fifty men. Lawrence hires teenage orphans Daud and Farraj as his attendants. During the march to Aqaba, Lawrence wins over Feisal's men by turning back into the desert to rescue Gasim. The grateful Arabs give Lawrence traditional clothing. Lawrence convinces Auda to switch sides by promising him a Turkish gold hoard at Aqaba. Lawrence is shaken when he must execute Gasim to prevent a conflict. Lawrence and Auda capture Aqaba, but there is no gold. To placate Auda, Lawrence agrees to ask his superiors in Cairo for more money. Daud is drowned by quicksand along the way. In Cairo, Lawrence perplexes the British officers with his Arab clothes and his insistence that Farraj be treated with the same respect as a British officer. General Edmund Allenby promotes him to major and agrees to back the Arabs with arms and money. Before returning to his desert forces, Lawrence asks Allenby whether the Arabs are correct that the British seek to dominate Arabia and demands artillery for Feisal's army. Allenby lies to him on both counts. Lawrence launches a guerrilla war against the Turks. The American media romanticise Lawrence's exploits and make him famous, as American journalist Jackson Bentley is looking to highlight the \"more adventurous aspects\" of war to help draw the United States into the fight . Ali urges Lawrence to slow down, but Lawrence ignores him. Farraj is injured on one raid, and Lawrence kills him to save him from the Turks, who torture their captives. The Turks capture Lawrence while he scouts Deraa . The Turkish Bey orders him stripped, ogled, prodded and beaten—and, it is implied, raped. Ali rescues him and nurses him back to health. The experience leaves Lawrence shaken and humbled. Dryden informs Lawrence about the Sykes–Picot Agreement , which will partition the Middle East between Britain and France . Allenby urges Lawrence to return to Arabia to support the \"big push\" on Damascus . Lawrence feels betrayed but complies. He recruits an army with little interest in Arab liberation. Lawrence hopes that if the Arabs can take Damascus before the British, they will be able to demand an independent Arab state. Lawrence's army sights a column of retreating Turkish soldiers who have just massacred the residents of Tafas . One of Lawrence's men is from Tafas and demands no prisoners . Ali insists on proceeding to Damascus, but the man charges alone and is killed. Lawrence takes up his battle cry, and the Arabs massacre the Turks. The Arabs beat the British to Damascus. Lawrence advises them to run the city without British support, but the tribesmen bicker constantly, the public utilities fail, and the understaffed hospitals barely function. Feisal discards Lawrence's dream of Arab independence in exchange for British support. Lawrence returns to the British Army. The British promote Lawrence to colonel and order him to Britain. As he leaves Damascus, he looks longingly at the departing Arabs before his car is passed by a motorcyclist.",
  "wiki": "https://en.wikipedia.org/wiki/Lawrence_of_Arabia_(film)"
}