{
  "year": "1962",
  "name": "To Kill a Mockingbird",
  "plot": "The story is set during the Great Depression in the fictional town of Maycomb, Alabama . Scout, aged six, lives with her older brother Jem and their widowed father Atticus , a white middle-aged lawyer. Guided by a strong social conscience, Atticus often represents poor farmers who pay him in produce or firewood. Jem and Scout befriend Dill, a boy who visits each summer. The three are both frightened and intrigued by their reclusive neighbour, Arthur \"Boo\" Radley. They fuel each other's imaginations with tales about him and devise ways to lure him outside. After two summers, Scout and Jem begin finding small gifts left in a tree outside the Radley house. Atticus is appointed to defend Tom Robinson, a black man accused of raping Mayella Ewell, a young white woman and the daughter of Bob Ewell, a violent and racist drunkard. The case inflames racial tensions in the town, and Jem and Scout are taunted at school. On the night before the trial, Atticus positions himself outside the jail where Tom is being held. A lynch mob arrives. The children unexpectedly intervene, and Scout, recognizing the father of a schoolmate, starts a friendly chat. Embarrassed, he persuades the mob to disperse. Jem and Scout sneak into the courtroom to see Tom's trial. With no available seats on the main floor, a local pastor invites them up to the coloured balcony . Mayella states that she invited Tom in to chop up a chifforobe , and that he grabbed her round the throat, beat her and raped her. Witnesses testify that she had bruises on her neck and both arms, and had been heavily 'knocked about' the right side of her head. Atticus points out that the attacker must have been left handed, and that Tom had entirely lost the use of his left arm some years earlier in a farming accident. In spite of witness assertions, there was no medical evidence of any rape, and no doctor was called. Atticus suggests that Mayella was actually beaten by her own (left-handed) father. She denies it, though unconvincingly. Tom testifies that Mayella had invited him in to help with some chores, as she had done many times before. When he noted that the house was unusually quiet, Mayella explained that she had saved up and sent the children off into town to buy ice creams. She then kissed him against his will. Feeling extremely uncomfortable, Tom was attempting to leave when Mayella's father appeared, drunk and enraged. Asked by the prosecution lawyer why he had been doing chores for Mayella without payment, Tom replies that he had  \"felt sorry for her\" – words that offend the white spectators. Atticus urges the all-white jury to put aside prejudice and recognise Tom's innocence. Nonetheless, Tom is found guilty. As Atticus leaves the courtroom, the black spectators in the gallery rise in respect. Atticus hopes for an appeal, but learns from Sheriff Tate that Tom has been shot dead while trying to escape. He breaks the news to Tom's family. Bob Ewell appears and spits in his face. Autumn arrives. While walking home through the woods, Jem and Scout are attacked. Jem suffers a broken arm and is knocked unconscious but, amid the confusion, someone intervenes and Scout sees a strange man carrying Jem home. Atticus calls for a doctor and for Sheriff Tate. As Scout finishes telling the sheriff what happened, her father introduces her to a man shyly standing behind the door: their rescuer is Boo Radley. Ewell is found dead at the scene. Atticus mistakenly assumes Jem must have stabbed him in self-defense, but Sheriff Tate knows that Boo acted to protect the children. Realizing, however, that no purpose would be served by prosecuting Boo, he insists that Ewell must have fallen on his own knife. Scout walks Boo home, taking a moment to stand on the Radley porch to imagine life from his perspective. An adult Scout narrates, recalling that eventful summer and how Atticus had sat all night by Jem's bed, ready to be there for him when he awoke.",
  "wiki": "https://en.wikipedia.org/wiki/To_Kill_a_Mockingbird_(film)"
}