{
  "year": "1962",
  "name": "Mutiny on the Bounty",
  "plot": "In the year 1787, the Bounty sets sail from Britain for Tahiti under the command of Captain William Bligh . His mission is to collect a shipload of breadfruit saplings and transport them to Jamaica . The government hopes the plants will thrive and provide a cheap source of food for the slaves. The voyage gets off to a difficult start with the discovery that some cheese is missing. Seaman John Mills accuses Bligh, the true pilferer, and Bligh has Mills brutally flogged for showing contempt to his superior officer, to the disgust of his second-in-command, First Lieutenant Fletcher Christian . Bligh tries to reach Tahiti sooner by attempting the shorter westbound route around Cape Horn . The strategy fails and the Bounty backtracks eastward, costing the mission much precious time. Singlemindedly, Bligh makes up the lost time by pushing the crew harder and cutting their rations. When the Bounty reaches her destination, the crew revels in the easygoing life of the tropical paradise – and in the free-love philosophies of the Tahitian women. Christian himself is smitten with Maimiti, daughter of the Tahitian king. Bligh's agitation is further fueled by the fact that the dormancy period of the breadfruit means more months of delay until the plants can be potted. As departure day nears, three men, including seaman Mills, attempt to desert but are caught by Christian and clapped in irons by Bligh. On the voyage to Jamaica, Bligh attempts to bring back twice the number of breadfruit plants to atone his tardiness, and reduce the water rations of the crew to water the extra plants. One member of the crew falls from the rigging to his death while attempting to retrieve the drinking ladle, as the other assaults Bligh and is fatally keelhauled . Mills taunts Christian after each death, trying to egg him on to challenge Bligh. When a crewman becomes gravely ill from drinking seawater, Christian attempts to give him fresh water, in violation of the Captain's orders. Bligh strikes Christian when he ignores his second order to stop. In response, Christian strikes Bligh. Bligh informs Christian that he will hang for his actions when they reach port. With nothing left to lose, Christian takes command of the ship and sets Bligh and the loyalist members of the crew adrift in the longboat with a compass and meager rations, telling them to make for the island of Tofua . Bligh, bent on revenge, avoids Tofua and the rest of the islands by lying to his loyalists about the locals there practicing cannibalism , and instead crossing the Pacific westward in order to reach the Dutch colony of Kupang at the island of Timor . He returns to Britain with remarkable speed and weeks later, a court martial exonerates Bligh of any misdeeds for the loss of the Bounty and recommends an expedition to arrest the mutineers and bring them to trial.  The court also comes to the conclusion that the appointment of Bligh as Captain of the Bounty was a mistake.  This conclusion is based on the fact that several superb officers with commendable records participated in the mutiny against him. In the meantime, Christian sails back to Tahiti to pick up supplies, Maimiti and the girlfriends of the crew. They sail to several islands until they reach Pitcairn Island , which is marked incorrectly on the charts and would be virtually impossible for the British Navy to find because all charts reflect the same error. However, once on Pitcairn, Christian decides that it is their duty to return to Britain and testify to Bligh's wrongdoing, and he asks his men to sail with him. To prevent this possibility, Mills and the rest set the Bounty on fire and Christian is fatally burned after retrieving (and eventually losing) the ship's sextant. Christian dies in Maimiti's arms as the Bounty burns and sinks.",
  "wiki": "https://en.wikipedia.org/wiki/Mutiny_on_the_Bounty_(1962_film)"
}