{
  "year": "1963",
  "name": "How the West Was Won",
  "plot": "Zebulon Prescott and his family set out west for the frontier on the Erie Canal . They are pulled through the first section on a barge and then build rafts to continue on the Ohio River . Along the journey, they meet mountain man Linus Rawlings, who is traveling to Pittsburgh to trade his furs . Rawlings and Zebulon's eldest daughter, Eve, are attracted to each other, but he is not ready to settle down. Rawlings stops at an isolated trading post, which is actually a front run by a clan of river pirates . Linus is led into a cave, stabbed in the back, and then pushed down a hole. The pirates steal his furs and sink his canoe. Wounded, Linus follows them. When they are about to rob the Prescott party, Linus intervenes and helps the Prescotts kill all of the pirates. The Prescotts continue down the river. When the lead raft is caught in rapids , Zebulon and his wife Rebecca drown; Linus arrives to help bury them. Deciding he cannot live without Eve, he asks to marry her and take her to Pittsburgh, but she insists on homesteading at the spot where her parents died. Eve's sister Lilith chooses to go back east, dreaming of becoming rich, and years later becomes a singer and dancer in St. Louis . While performing at a music hall , she attracts the attention of professional gambler Cleve van Valen, who learns that she has just inherited a California gold mine . On a wagon train heading west, Lilith partners with an elderly woman named Agatha; Cleve joins them to avoid his debts and to swindle Lilith of her gold. Wagonmaster Roger Morgan and Cleve court her along the way, but she rejects them both. Surviving an arduous trek and an attack by the Cheyenne together, Lilith falls for Cleve. The pair eventually arrive at the mine, but discover that it is worthless. Cleve leaves; Lilith returns to work in a camp town's dance hall, heartbroken. Morgan finds her and again proposes marriage, to no avail. Later, Lilith performs on a Sacramento riverboat . By chance, Cleve is a passenger. The pair happily reunite, and Cleve proposes to her, telling her of the business opportunities waiting in San Francisco . She accepts his proposal. Linus Rawlings has joined the Union army as a captain in the American Civil War . Despite Eve's wishes, their son Zeb enlists as well, seeking adventure and an escape from farming. The bloody Battle of Shiloh shows Zeb the cruel realities of war, and his father dies there. Zeb encounters a disillusioned Confederate soldier who suggests deserting. By chance, they eavesdrop on Generals Ulysses S. Grant and William Tecumseh Sherman . The Confederate realizes he has the opportunity to shoot them, leaving Zeb no choice but to kill him. Zeb continues to serve for the rest of the war. When the war ends, Zeb returns home as a lieutenant and learns his mother died, having lost the will to live after losing Linus. Zeb gives his share of the family farm to his brother and leaves, deciding to stay in the army. In the late 1860s, two competing railroad lines, the Central Pacific Railroad and the Union Pacific Railroad , open up new territories that attract American and European settlers. Zeb serves in the U.S. Cavalry , trying to maintain peace with the Native Americans with the help of buffalo hunter Jethro Stuart, an old friend of Linus's. When railroad man Mike King violates a treaty by building on Native American territory, the Arapahos retaliate by stampeding buffalo through his camp, killing many. Disgusted by Mike's unchecked greed and callousness, Zeb resigns from the army, and then visits Jethro at his mountain cabin before moving on. [ 5 ] [ 6 ] In San Francisco, the widowed Lilith auctions off her possessions to pay off debts. She travels to Arizona , inviting Zeb and his family to oversee a cattle ranch, her last remaining asset. Zeb (now an Arizona marshal), his wife Julie, and their children meet Lilith at Gold City's train station. There, Zeb runs into outlaw Charlie Gant. Zeb had killed Gant's brother in a gunfight. When Gant makes threats against Zeb and his family, Zeb turns to his friend, Gold City marshal Lou Ramsey. However, Gant is not wanted for anything in that territory, so Ramsey can do nothing. Zeb suspects Gant plans to steal a train's gold shipment, and prepares an ambush with Ramsey's reluctant help. Gant and his gang are killed in the shootout and resulting train wreck. Lilith and the Rawlings family travel by wagon to their new home.",
  "wiki": "https://en.wikipedia.org/wiki/How_the_West_Was_Won_(film)"
}