{
  "year": "1963",
  "name": "Lilies of the Field",
  "plot": "Homer Smith, a drifting handyman, stops at a remote Arizona farm seeking water for his car. He encounters a group of nuns from the former East Germany—led by the stern Mother Maria Marthe—struggling to maintain their modest desert homestead. Though initially resistant, Homer agrees to repair their roof. The nuns, who speak little English, humorously dub him \"Schmidt\" (the German equivalent of Smith), slowly endearing themselves to him. Through interactions with locals, including Juan, a café owner, and a traveling priest, Homer learns of the nuns' harrowing escape from behind the Iron Curtain and their impoverished existence. Despite their inability to pay, he begrudgingly prolongs his stay, lured by the challenge of building a chapel for the nearby Mexican American community. Homer's initial reluctance gives way to ambition when he confesses his unrealized dream of becoming an architect. Using donated materials and his dwindling savings, he begins constructing the chapel single-handedly, insisting on perfection. Tensions flare with Mother Maria, who prioritizes pragmatism over his ideals, leading Homer to abandon the project temporarily. He returns hungover but remorseful, finding renewed purpose as the community gradually rallies to assist. Locals donate supplies and labor, transforming Homer's solitary endeavor into a collective effort, though he initially resists their involvement. As construction progresses, Homer's leadership earns respect, even from Ashton, a dismissive contractor who later offers him a job. The chapel's completion culminates in a bittersweet victory: Homer secretly signs his work, symbolizing pride and humility. On the eve of the dedication, Mother Maria subtly implores him to stay, but Homer departs quietly at nightfall. The nuns’ echoing rendition of “ Amen \"—a hymn they learned from him—underscores their unspoken gratitude as he drives away.",
  "wiki": "https://en.wikipedia.org/wiki/Lilies_of_the_Field_(1963_film)"
}