{
  "year": "1965",
  "name": "Ship of Fools",
  "plot": "The ship's medical officer, Dr. Schumann, takes a special interest in La Condesa , a Spanish countess with an opiate addiction, being deported from Cuba to a Spanish prison in Tenerife for illegally aiding agitators . The 600 field workers in steerage , being deported to Spain due to the low market price of Cuban sugar , cheer the Condesa as she boards the ship under police escort. The Condesa tells the doctor she was motivated by seeing the impoverished conditions in which 5,000 laborers lived, under patronage of the man with whom she lived in luxury. She manipulates the doctor for drugs , but her activism aligns with the doctor's humanitarian ideals that the laborers in steerage be treated like human beings rather than cargo. Their shared sympathies soon evolve into love, though both realize it is a hopeless situation. The doctor conceals having a heart condition. Selected passengers—mostly Aryan Germans—are invited to dine each night at the captain's table. Some are amused and others offended by the anti-Jewish rants of a German businessman, Rieber, who begins an affair with Lizzi, a statuesque blonde, who admires him for his vitality and mind, until she learns he is married. Austrian-born Rieber extols the virtues of German nationalism and eugenics . The captain is reassured by Rieber's rants, believing that nobody can ever take the Nazi party seriously. Though Jews and a dwarf are excluded from the table, the Hutten’s dog, Baby , is allowed. When Baby is thrown overboard by children from steerage, the dog is saved, but an animal-loving laborer drowns in the rescue, despite the doctor's ministrations. The Huttens fuss over the dog, oblivious that its rescuer has died, even when informed by the doctor. The Jewish Lowenthal is seated at a side table with a dwarf named Glocken, and the two bond over their social exclusion . Later Freytag, a German passenger, is moved to this table when Rieber learns Freytag's wife is Jewish. Eventually Freytag discloses that he is separated from his Jewish wife due to pressure from his family and his employer. \nRevealing his Iron Cross 2nd class he earned in World War I , Lowenthal discusses with Glocken what it means to be German, including the Nazi party and its anti-Jewish sentiment , which Lowenthal hopes to be temporary saying Jews have been good for Germany. Lowenthal is ultimately positive about the future of Jews in Germany, while Glocken is diametrically opposed in his pessimism. Glocken tells Lowenthal that he may be the biggest fool on the ship. An American artist couple, David and Jenny, have a passionate but tumultuous relationship. David is disconsolate at his lack of success as a socially committed artist; the independent Jenny dislikes his \"unsellable\" art and does not wish to compete with it in the relationship. He is dismissive of her artistic talent, which she herself undervalues. David expresses that whoever shares his life will need to accept that his art will always supersede her. Jenny fears that their life together will be endlessly fighting, with neither willing to put the other's needs before their own. Passengers are entertained nightly by a troupe of flamenco musicians and dancers, whose leader pimps the women in the troupe. Johann, an unpaid caregiver to Herr Graf, his invalid uncle, ignores the wholesome and insecure Elsa, who is traveling with her parents. Instead, Johann is attracted to one of the dancers, who rejects him for inability to pay. Johann threatens his stingy uncle if he does not give him money which has been promised to him in his uncle's will. He loses his virginity to one of the dancers, who treats him with gentleness when he pays. Mary Treadwell, a divorced fading beauty hoping to recapture her youth in Paris, is too mature to interest the captain. She disdains the lieutenant who shows interest, dismissing him first as doing his duty to unattended women and later as insignificant. When former baseball player and fellow American Bill Tenny is seated at her table, she finds him crass and ignorant. Tenny expresses surprise at the open hostility toward the Jews onboard; she sarcastically replies that maybe he was too busy \"lynching Negroes\" to focus on Jews. Tenny pesters one of the flamenco dancers, believing that buying a magnum of champagne entitles him to her favors . She gives him the cabin number of Mrs. Treadwell. In a drunken stupor, Tenny barges into the cabin and accosts Mrs. Treadwell, who momentarily responds passionately until she realizes that he has mistaken her for a prostitute; she then hits him repeatedly and expels him from the cabin. The ship arrives in Tenerife, where the deported workers from steerage disembark. The doctor briefly considers staying with the Condesa, but the captain calls him foolish, contending that the Condesa manipulated him for drugs. After an emotionally painful farewell with the doctor, the Condesa is forced to exit the ship under Civil Guard escort. When the captain tells the distraught doctor she is not worth his anguish, the doctor explodes in a fit of pique, throwing cognac in his face and rebuking him, expressing that the Condesa took action against injustice, while they just carry out the orders they are given. Apologetic, the captain advises the doctor that he looks ill and should not respond to a call from a passenger for medical attention. The doctor ignores this and dies of a heart attack. Upon arrival in Bremerhaven his body is unloaded in a coffin with his estranged wife and sons in attendance. At disembarkation the passengers are shown descending in turn, going back to their business-as-usual lives. The last passenger to leave the ship is Glocken, who breaks the fourth wall and says he can hear the audience saying, \"What has all this to do with us? ... Nothing \", he chuckles cryptically and walks off.",
  "wiki": "https://en.wikipedia.org/wiki/Ship_of_Fools_(film)"
}