{
  "year": "1966",
  "name": "The Russians Are Coming, the Russians Are Coming",
  "plot": "One September morning, the Soviet Navy submarine Sprut (Octopus) draws too close to the New England coast when its captain wants to see North America. and runs aground on a sandbar near Gloucester Island (a fictional island apparently loosely based on Martha's Vineyard) off the New England coast, with a population of about 200 people. Rather than radio for help and risk an embarrassing international incident, the captain sends a nine-man landing party, headed by his zampolit (Political Officer) Lieutenant Yuri Rozanov, to find a motor launch to help free the submarine. The men arrive at the house of Walt Whittaker, a vacationing playwright from New York City. Whittaker is eager to get his wife Elspeth and children, Pete and Annie, off the island now that summer is over. Pete tells his disbelieving dad that armed Russians are near the house, but Walt is soon met by Rozanov and one of his men, Alexei Kolchin, who identify themselves as strangers on the island and ask if there are any boats available. Walt is skeptical and asks if they are armed Russians. Startled, Rozanov admits that they are and pulls a gun on Walt. Rozanov promises no harm to the Whittakers if they surrender their station wagon. Elspeth provides the car keys, but before the Russians depart, Rozanov orders Alexei to prevent the Whittakers from fleeing. The station wagon quickly runs out of gasoline, forcing the Russians to walk. They steal an old sedan from Muriel Everett, the postmistress; she calls Alice Foss, the gossipy telephone switchboard operator, and soon, rumors about Russian parachutists and an air assault on the airport throw the island into confusion. Police Chief Link Mattocks and his deputy Norman Jonas try to squelch a \"citizens' militia\" led by Fendall Hawkins, head of the local VFW . Meanwhile, Walt, Elspeth and Pete overpower Alexei when Alison Palmer, an 18-year-old neighbor and Annie's babysitter, arrives for work, giving them an opening. Alexei flees, but when Walt, Elspeth, and Pete leave to find help, he returns to retrieve his weapon from the house, where only Alison and Annie remain. Despite wanting no fighting, Alexei must obey his superiors in guarding the residence. He promises not to harm anyone and offers to surrender his gun as proof. Alison trusts him and does not want his firearm. Walt is recaptured by the Russians in the telephone central office. After subduing Mrs. Foss, tying her and Walt together and disabling the island's telephone switchboard, seven Russians appropriate civilian clothes from a dry cleaner's, steal a cabin cruiser, and head back to the submarine. Back at the Whittaker house, Alexei and Alison talk, kiss, and fall in love. At the phone exchange, Walt and Mrs. Foss hop outside the office. They are eventually discovered by Elspeth and Pete, who untie them. They return to their house; and Walt shoots at and almost kills Rozanov, who reached there ahead of them. With the misunderstandings cleared up, the Whittakers, Rozanov, and Alexei decide to head into town together to explain to everyone what is happening. As the tide rises, the sub floats off the sandbar. The Sprut proceeds on the surface to the island's main harbor to recover the landing party. Chief Mattocks, having investigated and debunked the rumor of an airborne assault, returns to town with the unorganized militia. With Rozanov acting as translator, the Russian captain threatens to open fire on the town unless the seven missing sailors are returned to him; his crew faces upwards of a hundred townspeople armed with everything from .22 caliber rifles and 12 gauge shotguns to military surplus battle rifles . Two small boys climb up to the church steeple to see better. One slips and falls but his belt catches on a gutter, leaving him hanging 40 feet in the air. The American islanders and the Russian submariners unite to form a human pyramid and rescue him. Peace is established between the two groups. However, Hawkins contacted the Air Force by radio. In a joint decision, the submarine leaves the harbor with villagers in small craft protecting it. Alexei says goodbye to Alison. The stolen cabin cruiser with the missing Russians meets the sub, which they board before two Air Force jets arrive. The jets break off after seeing the escorting flotilla of civilian boats. The Sprut is free to proceed to deep water and safety.",
  "wiki": "https://en.wikipedia.org/wiki/The_Russians_Are_Coming,_the_Russians_Are_Coming"
}