{
  "year": "1966",
  "name": "The Sand Pebbles",
  "plot": "In 1926 China during its Warlord Era , Navy Machinist's Mate First Class Jake Holman transfers to the Yangtze River Patrol gunboat USS San Pablo as their new engineer. Almost immediately, he upsets the crew when he will not accept the coolies they use to do most of their duties. Instead, Holman takes personal responsibility of the engine room. He befriends a seasoned sailor named Frenchy. After an engine malfunction caused by a problem Holman noticed, but the captain refused to repair, the chief Chinese engine-room worker dies. Lop-eye Shing, leader of all the Chinese workers onboard, blames Holman. The captain tells Holman he must find a Chinese replacement, so he chooses the simple but genial Po-han. The sailors on shore leave visit a bar and brothel run by a former sailor. A high-priced virgin named Maily captivates the crew. Frenchy discovers that her price is the debt she must pay to get her freedom. Holman's nemesis Stawski conspires with Shing to get Po-han kicked off the boat, in response Holman proposes a boxing match; if Stawski wins, he gets the money needed for Maily, but if he loses, Po-han keeps his job. Stawski is almost beaten when the alarm sounds, forcing the crew to rush back to their boat, but Holman forces the ten count to finish. A Chinese mob has been angered that British warships have fought a battle with Chinese warlords on the Yangtze River. When the Chinese Civil War begins, the San Pablo is ordered to remain neutral, while rescuing stranded Americans up river. Po-han is sent ashore by Shing while the sailors collect Jameson, a missionary, and Shirley Eckert, his schoolteacher assistant. After being caught by a mob, Holman violates the captain's orders to stay neutral by shooting Po-han to end his brutal death on shore. Back in port, Chinese locals openly show their hatred towards the sailors. Jameson and Eckert head off to a new mission. Frenchy tries to buy Maily's freedom, but instead she is put up for auction. Holman tries to help Frenchy pay the higher price, but a fight breaks out. The three of them escape. Frenchy and Maily have an unofficial marriage in an empty church. Holman and Eckert start to meet and fall in love, but he thinks it cannot last, as he will likely be leaving China soon. As winter comes, the boat becomes stuck as the river level drops. Shore leave is cancelled when the Chinese workers abandon the crew and a flotilla of local civilians blockade the ship. To see Maily, Frenchy regularly swims the freezing waters, but eventually he catches pneumonia and dies. Antiforeign Chinese forces kill Maily and frame Holman for her murder. They surround the ship and demand his surrender. With tensions rising and the crew also demanding Holman leave, the captain fires a Lewis gun , ending the matter. Captain Collins decides to rescue Jameson and Eckert from their new mission after hearing of antiforeigner riots in Nanking . However, the San Pablo encounters a line of tethered junks blocking their way sparking an armed conflict. Under fire, Holman chops through the rope. He kills a Chinese militiaman only to recognize the young man as one of Jameson's and Shirley's students. The gunboat arrives at the mission, but Jameson and Shirley Eckert refuse to leave. While they argue, Nationalist soldiers attack, killing Jameson. The patrol retreats, but when Collins is killed, Holman takes command. Shirley and he affirm their love; Holman promises to follow while covering their escape. He kills several soldiers, but is fatally shot as he is about to rejoin the others. A dying Holman bewilderingly asks, \"I was Home ... what happened? What the hell happened?\" Shirley and the remaining sailors reach the boat. The San Pablo slowly steams away.",
  "wiki": "https://en.wikipedia.org/wiki/The_Sand_Pebbles_(film)"
}