{
  "year": "1967",
  "name": "Doctor Dolittle",
  "plot": "In 1845, in the small port town of Puddleby-on-the-Marsh, England, Doctor John Dolittle works as a veterinarian and can talk to animals. A former medical doctor, Dolittle lives with a menagerie . The animals he kept in his home created havoc with his human patients who began to go elsewhere for their medical needs. His sister, who served as his housekeeper, demanded that he dispose of the animals or she would leave. He chose the animals. Dolittle's talking macaw Polynesia can speak over 2,000 animal languages. She offered to teach Dolittle so he could become an animal doctor. Dolittle can now speak nearly 500 animal languages and is in the process of learning how to speak with sea creatures for an upcoming expedition to search for the legendary Great Pink Sea Snail . Dolittle is treating a horse for near-sightedness when its owner, magistrate General Bellowes, bursts in and accuses him of stealing the animal. Bellowes ends up getting chased away by skunks. His niece Emma Fairfax chides Dolittle for his rudeness and lack of compassion for humans. Dolittle expresses his contempt for Bellowes, who hunts foxes, and for her, who, he says, does absolutely nothing. She storms off. To help Dolittle earn money for his expedition, a friend sends him a pushmi-pullyu , a rare creature. Dolittle takes the pushmi-pullyu to a nearby circus , and it becomes the star attraction. Dolittle talks with Sophie, a sad seal that longs to return to her husband at the North Pole . He smuggles Sophie out of the circus, disguises her in women's clothing to convey her to the coast, and throws her in the ocean. Fishermen witness this and have Dolittle arrested for murder. When he appears in court before Bellowes, Dolittle proves that he can converse with animals by talking with Bellowes's dog and revealing details only Bellowes and the dog could know. Certain that he will be set free, he tells his friend Matthew Mugg to get ready to begin their expedition the next day. While he is acquitted on the murder charge, the vindictive Bellowes orders him committed to an insane asylum . Polynesia engineers Dolittle's escape during his transfer to the asylum by obtaining the cooperation of the police horses and dogs. Dolittle, Matthew, Matthew's young friend Tommy Stubbins and some animals set sail in search of the Snail. Dolittle eventually discovers Emma, who is fascinated by him and seeks adventure, is also on board his ship the Flounder . As he will be arrested if he turns back, he agrees to let her be his cook and cabin boy . It is decided by randomly pointing at a map that the crew will search for the Snail on Sea Star Island, a floating island off the western coast of Africa. Assisted by sea creatures, they near Sea Star Island where they encounter a storm that destroys the Flounder . Everyone washes ashore on the Island. The party is soon captured by the island's natives who are highly-educated and cultured from reading books that have washed ashore after innumerable shipwrecks. The tribe blames newcomers for its misfortunes. The tropical island is drifting north into colder waters, which has given all of the animals colds. Dolittle tends to the animals and then persuades a whale to push the island south. The jolt causes a balancing rock to drop into a volcano, condemning Dolittle and his friends to be executed. Just as they are about to be killed, the island collides with Africa and the two pieces fit perfectly, confirming a legend that the Island had broken off from Africa 5,000 years earlier. For bringing them home, the natives cancel the execution and revere Dolittle as a god. A sneeze alerts Dolittle to the presence of the Snail, which lives in a cave on the island. In exchange for curing its cold, the Snail agrees to carry Dolittle's friends back to Britain in its watertight shell as it wants to visit its cousin the Loch Ness Monster anyway. Emma wishes to stay on the island with Dolittle and search for the Giant Lunar Moth, a creature that flies back and forth between Earth and the Moon, but he says he is not good with people. After saying that she will miss Dolittle, Emma kisses him goodbye. Sophie and her husband later bring Dolittle the news that Bellowes has agreed to pardon him after all of the animals in England went on strike to protest his sentence. Having realized that he has feelings for Emma, Dolittle has the natives position themselves in the shape of the Moth so that he may design a saddle to ride it. That night, Dolittle rides the Moth back to Puddleby.",
  "wiki": "https://en.wikipedia.org/wiki/Doctor_Dolittle_(1967_film)"
}