{
  "year": "1969",
  "name": "Z",
  "plot": "The left-wing opposition in an unnamed Mediterranean country (based on Greece under the junta ) plan to have a famous government deputy (based on Grigoris Lambrakis ) give a speech advocating for nuclear disarmament, but the government interferes by pressuring venues to deny them space and setting thugs on them to tear down posters and harass attendees. The opposition receive an anonymous tip about a threat to the deputy's life and report it to government officials, but they dismiss the claims. During the speech, Pirou, another deputy, goes to find their promised protection, but is mistaken for the real target and savagely beaten before his assailants realize they have the wrong man. As the intended target crosses the street from the hall after giving his speech, a delivery truck speeds past him, and a man on the open truck bed strikes him down with a club. The Chief Prosecutor is informed of the incident and the General (head of the state police and a fierce anticommunist) lies that the deputy has been injured by a drunk driver, Yago, who they have in custody. The phone then rings, revealing the deputy has died. At the hospital, the magistrate assigned to the investigation learns that the autopsy indicates the deputy died from blows to the head, not a car crash. He is informed of a witness, but before he can testify, the man is hit by a club from a passing car. The General and the man's family, who are sympathetic to the government, visit the man in the hospital and pressure him not to testify, but he does anyway, saying that Yago (his delivery driver) talked openly about the plan to murder the Deputy. The journalist visits the man and unwittingly spoils an assassination attempt by the Deputy's assailant Vago, who has been placed in the hospital by the government and is arrested. During the interrogation, the magistrate baits Vago into revealing that he is part of a clandestine anti-communist group, the Christian Royalist Organization against Communism (CROC), with ties to the state police. With the help of a CROC informer, the journalist learns more about the organization and photographs members that the informer points out. He then takes the photos to Pirou, who identifies his assailant. It is later revealed that the Colonel bribed Pirou's assailant with a lifetime peddling license and new house to assist in their plan against the deputy. As the magistrate continues to investigate CROC, he demands that the opposition counselor produce the witness who originally told them of the plot against the deputy, revealed to be a fellow deliveryman with ties to the former Greek communist resistance movement. He describes Yago threatening him into silence, and that he saw Yago with the Colonel and the head of CROC. As one of the other opposition lawyers heads to the office to testify, a car attempts to run him down in front of a crowd of witnesses. With a large amount of corroborating evidence, the magistrate plans to charge high-ranking military officers and, upon learning of this plan, the country's attorney general arrives and criticizes his plans, arguing that they will harm the nation. He suggests that the magistrate try Yago and Vago apart, leave the issue of the police to be solved internally, and indict the opposition for inflammatory speech, but he follows through with his plans. The General denies any affiliation with CROC, but the magistrate presents a photo of a banquet he hosted in their honor. The action of the film concludes with one of the deputy's associates rushing to see his widow to give her the surprising news of the officers' indictments, to which she looks distressed. An epilogue provides a synopsis of the subsequent turns of events. Instead of justice being served, the prosecutor is mysteriously removed from the case, several key witnesses die under suspicious circumstances, the assassins receive relatively short sentences, the officers receive only administrative reprimands, the deputy's close associates die or are deported and the photojournalist is sent to prison for disclosing official documents. The heads of the government resign after public disapproval, but before elections are carried out, a coup d'état occurs, and the military seize power. They ban modern art , popular music , avant-garde novelists, modern mathematics , classic and modern philosophers and the use of the letter \" Ζ \" ( Greek : zíta , or Greek : zi , which is used by protesters against the former government), which refers to the deputy and means \"He lives.\"",
  "wiki": "https://en.wikipedia.org/wiki/Z_(1969_film)"
}