{
  "year": "1969",
  "name": "Hello, Dolly!",
  "plot": "In 1890, well-known widowed matchmaker Dolly Levi plans to travel to Yonkers, New York . She seeks a wife for Horace Vandergelder, an unmarried \"half-a-millionaire\". Meanwhile, young artist Ambrose Kemper wants to marry Horace's niece Ermengarde. Horace opposes this, feeling that Ambrose cannot provide financial security. Horace, who owns Vandergelder's Hay and Feed, plans to travel to New York City to march in the 14th Street Parade and to propose to milliner Irene Molloy, whom he met through Dolly. After arriving in Yonkers, Dolly sends Horace ahead to New York. Before leaving, he tells his clerks, Cornelius Hackl and Barnaby Tucker, to mind the store. Cornelius, however, decides that he and Barnaby need to get out of Yonkers. Dolly overhears and decides to set them up with Irene and her shop assistant Minnie Fay. Dolly also helps Ambrose and Ermengarde, entering them in a dance contest at the fancy Harmonia Gardens restaurant, which she and her late husband Ephram frequented. The entire company takes the train to New York. In New York, Irene and Minnie open their hat shop for the afternoon. Irene does not love Horace, but the marriage can provide her with financial security and an escape from her boring job. Cornelius and Barnaby arrive at the shop, pretending to be rich. When Horace and Dolly arrive, Cornelius and Barnaby hide. Minnie screams when she finds Cornelius hiding in an armoire. Horace is about to open the armoire, but Dolly \"searches\" it and pronounces it empty. After hearing Cornelius sneeze, Horace storms out, realizing that there are men hiding in the shop but unaware that they are his clerks. Dolly arranges for Cornelius and Barnaby, who are still pretending to be rich, to take the ladies to dinner at Harmonia Gardens, to make up for their humiliation. The clerks and the ladies attend the Fourteenth Street Association Parade. In a moment alone, Dolly asks for her late husband Ephram's permission to marry Horace, requesting a sign. She resolves to go forward with life. After meeting old friend Gussie Granger on a parade float, Dolly catches up with the annoyed Horace, who is marching in the parade. She says that the heiress Ernestina Simple would be a good match for him and requests that he meet her that evening at Harmonia Gardens. Because the clerks have no money to hire a carriage, they tell the girls that walking to the restaurant is more stylish. At the Harmonia Gardens restaurant, head waiter Rudolph prepares his crew for Dolly's return. Horace arrives to meet his date, who is really Gussie. She is neither rich nor elegant as Dolly implied, and leaves after being bored by Horace, as she and Dolly had planned. Cornelius, Barnaby and their dates arrive, unaware that Horace is also there. Dolly shows up and is greeted by the staff. She sits in the now-empty seat at Horace's table, and says that no matter what he says, she will not marry him. Fearful of being caught, Cornelius confesses to the ladies that he and Barnaby are not wealthy. Irene, who knew all along that they were pretending, offers to pay for the meal. However, Irene realizes that she left her handbag containing all her money at home. The four try to sneak out during the polka contest, but Horace recognizes them, then spots Ermengarde and Ambrose. In the ensuing confrontation, Horace fires the clerks, who are forced to flee as a riot breaks out. Cornelius professes his love for Irene. Horace declares that he would not marry Dolly if she were the last woman on earth. The next morning, at the hay and feed store, Cornelius and Irene, Barnaby and Minnie, and Ambrose and Ermengarde all come to collect the money that Horace owes to them. Chastened, Horace admits that he needs Dolly, who is unsure about the marriage until Ephram sends her a sign. Cornelius becomes Horace's business partner at the store, and Barnaby fills Cornelius's old position. Horace says that life would be dull without Dolly, and she promises that she will \"never go away again\".",
  "wiki": "https://en.wikipedia.org/wiki/Hello,_Dolly!_(film)"
}