{
  "year": "1970",
  "name": "Five Easy Pieces",
  "plot": "Bobby Dupea works in an oil field in Kern County, California . He spends most of his time with his girlfriend Rayette, a waitress who has dreams of singing country music, or with fellow oil worker Elton, with whom he bowls, gets drunk, and philanders. When Bobby gets Rayette pregnant and Elton is arrested, Bobby quits his job and goes to Los Angeles, where his sister Partita is making a classical piano recording. She tells Bobby, who was once also a pianist, that their father has suffered two strokes , and urges him to reconcile with the family at their home in Washington . Rayette threatens to kill herself if Bobby leaves her, so he reluctantly asks her along. Driving north, they pick up Terry and Palm, two stranded women headed for Alaska. The latter launches into a monologue about the evils of consumerism . The four are thrown out of a diner after Bobby argues with an obstinate waitress over his order. Bobby drops off Terry and Palm when they get to Washington. Ashamed to introduce Rayette to his upper-class family, Bobby registers her in a motel before driving alone to the family home on an island in Puget Sound . He finds Partita giving their father a haircut; the old man seems completely oblivious to him. At dinner, Bobby meets Catherine Van Oost, a young pianist studying under and engaged to his amiable brother Carl, a violinist. Despite personality differences, Catherine and Bobby are immediately attracted to each other. Learning that Bobby was once a pianist, she asks him to play for her. She is moved by his rendition of Frédéric Chopin 's Prelude, Op. 28, No. 4 , but Bobby dismisses her, insisting that he played with \"no inner feeling\". Angered by Bobby's rejection, she leaves, but he follows after her and they have sex in her room. Rayette runs out of money at the motel and comes to the Dupea estate unannounced. Her presence creates an awkward situation, but when intellectual family friend Samia Glavia ridicules her, Bobby comes to her defense. Storming out of the room in search of Catherine, he discovers his father's male nurse giving Partita a sensual massage. He picks a fight with the nurse, who easily subdues him. Bobby tries to persuade Catherine to go away with him, but she declines, telling him he cannot ask for love when he does not love himself, or anything at all. After tearfully confessing his regrets to his unresponsive father, Bobby leaves for California with Rayette. Shortly into the trip, they stop for gas and coffee; while Rayette's view is obstructed, Bobby hitches a ride on a truck headed north.",
  "wiki": "https://en.wikipedia.org/wiki/Five_Easy_Pieces"
}