{
  "year": "1971",
  "name": "Fiddler on the Roof",
  "plot": "The film takes place in 1905 in the fictional small village of Anatevka somewhere in Ukraine , in the Russian Empire . The story centers on Tevye , a Jewish milkman and his family. Occasionally, Tevye breaks the fourth wall by talking to the audience or to the heavens for the audience's benefit. Tevye is poor despite working hard, like most other Jews in Anatevka. He and his wife, Golde, have five daughters, and cannot afford a dowry to marry them off. Life in the shtetl of Anatevka is difficult, and Tevye speaks not only of the hardships of poverty but also of the Jewish community's constant fear of harassment from their non-Jewish neighbors. Tevye explains that the lot of the Jews in Russia is as precarious as a fiddler on a roof, trying to eke out a pleasant tune while not breaking their necks. What keeps them alive is the balance they achieve through obedience to their ancient traditions. The fiddler appears throughout the film as a metaphoric reminder of the Jews' ever-present fears and danger. While making his rounds, Tevye meets Perchick, a young man passing through Anatevka; Perchick is a student from the university in Kiev , with radical political ideas. Tevye invites Perchik to his home for the Sabbath meal with his family and offers him room and board in exchange for tutoring his daughters. Yente the matchmaker , has arranged for Tevye's eldest daughter, Tzeitel, to marry widower Lazar Wolf, Anatevka's affluent butcher , who is many years older than she. However, Tzeitel is in love with her childhood sweetheart, Motel the tailor. Tevye does not think very highly of Motel, considering him unambitious, timid and meek. When Tevye tells Tzeitel of the match, she begs her father not to force her to marry the butcher; she and Motel have given each other their pledge to be married. Tevye is incredulous, but he reluctantly gives Tzeitel and Motel permission to marry, in spite of the pact made with Lazar Wolf. Worried that Golde will not accept the marriage, Tevye tells her of a false prophetic dream he had in which Tzeitel is fated to marry Motel, and Lazar's dead wife will haunt her if she marries the butcher. Earlier, Tevye is warned by the Constable that the locals would attack (calling it an \"Unofficial Demonstration\"), on an indefinite date, and the milkman wonders why God would allow this to happen. At the wedding, an argument erupts among the guests over whether a girl should be able to choose her own husband. Perchik addresses the crowd and says it should be left for the couple to decide. He creates further controversy when he asks Tevye's daughter Hodel to dance with him, crossing the barrier between the men and women . Initially, the crowd is shocked but they soon warm to the idea and the wedding proceeds with great joy until a mob arrives and begin a pogrom , attacking the Jews and destroying their property. Perchik tries to intervene, but is subdued by the Czar's men with a candlestick holder, resulting in a concussion. While the attacks continue with the other Jewish villages, Tevye can only wonder why God could not stop the atrocities. Later, as Perchik prepares to return to Kiev to take part in the revolution , he tells Hodel that he loves her, and she agrees to marry him. Tevye is furious when they tell him of their intention to marry with or without his permission, but, as with Tzeitel and Motel, he eventually gives his blessing because they love each other. Weeks later, Perchik is arrested at a demonstration in Kiev and exiled to Siberia . Hodel leaves home to join him there, much to Tevye's sorrow. Meanwhile, Tevye's third daughter, Chava, has fallen in love with a young Christian man, Fyedka. She eventually works up the courage to ask Tevye to allow her to marry him. In a soliloquy, Tevye concludes that while he could accept his older daughters' choosing their own husbands, he cannot countenance Chava marrying a non-Jew, in effect abandoning the Jewish faith. He forbids her to associate with him. Chava and Fyedka elope and marry in a Russian Orthodox Church. Tevye rejects and disowns Chava when she tries to beg forgiveness and acceptance from him. Finally, the Jews of Anatevka are notified that they have three days to vacate the village. Tevye and his family and friends pack and head variously for New York, Chicago, Jerusalem, and other places they know nothing about. Chava and Fyedka arrive to inform Tevye, who ignores the conversation, that the two of them are moving to Krakow, Poland. As they say their goodbyes Tevye mutters 'God be with you', which Tzeitel repeats to the couple. As Tevye pulls the wagon loaded with his family's possessions, he notices the fiddler behind him; the film ends with the fiddler following Tevye and his family down the road.",
  "wiki": "https://en.wikipedia.org/wiki/Fiddler_on_the_Roof_(film)"
}