{
  "year": "1971",
  "name": "The French Connection",
  "plot": "In Marseille , a police detective follows Alain Charnier, who runs a heroin-smuggling syndicate. Charnier's hitman, Pierre Nicoli, murders the detective. Charnier plans to smuggle $32 million worth of heroin into the United States by hiding it in the car of his unsuspecting friend, television personality Henri Devereaux, who is traveling to New York City by ship. In Brooklyn , police detectives Jimmy \"Popeye\" Doyle dressed as Santa Claus and Buddy \"Cloudy\" Russo stake out a bar known for drug trafficking. They later go out for drinks at the Copacabana . Popeye observes Salvatore \"Sal\" Boca and his wife, Angie, entertaining mobsters involved in narcotics. They tail the couple and establish a link between the Bocas and lawyer Joel Weinstock, a buyer in the narcotics underworld. Popeye learns that a shipment of heroin will arrive soon. The detectives convince their supervisor to wiretap the Bocas' phones. Popeye and Cloudy are joined by federal agents Mulderig and Klein. Devereaux's vehicle arrives in New York City. Boca is in a hurry to make the purchase, but Weinstock urges patience, knowing they are being surveilled. Charnier realizes he is being surveilled as well, identifies Popeye as a detective, and escapes on a departing subway shuttle at Grand Central Station . To evade Popeye, he has Boca meet him in Washington, D.C. , where Boca asks for a delay to avoid the police. Charnier wants to conclude the deal quickly. On the flight back to New York City, Nicoli offers to kill Popeye, but Charnier says Popeye would just be replaced by another policeman. Nicoli insists, however, saying they will be back in France before a replacement is assigned. Soon, Nicoli attempts to snipe Popeye in Brooklyn but misses. Popeye chases Nicoli, who boards an elevated subway train . Popeye shouts to a policeman on the train to catch Nicoli and then commandeers a passing car. He gives chase, crashing into several vehicles on the way. Realizing he is being pursued, Nicoli shoots the policeman who tries to intervene, and hijacks the train at gunpoint, forcing the motorman to drive through the next station and shooting the conductor. The motorman suffers a heart attack, and the train is about to collide with another when the emergency brake engages, hurling Nicoli to the floor. Popeye arrives and sees Nicoli descending from the platform. Nicoli sees Popeye and turns to run, but Popeye shoots him dead. After a long stakeout, Popeye impounds Devereaux's Lincoln. In a police garage, mechanics tear the car apart in a search for drugs, initially coming up empty-handed. Cloudy discovers that the car's weight was recorded at 120 pounds over its standard, implying that the contraband must still be in the car – packages of heroin are finally discovered beneath the rocker panels. The police re-hide the contraband and reassemble the car, returning it to Devereaux who delivers it to Charnier. Charnier drives to an old factory on Wards Island , where Boca's brother Lou works, to meet Weinstock and deliver the drugs. After Charnier has the rocker panel covers removed, Weinstock's chemist tests one of the bags and confirms its quality . Charnier removes the drugs and hides the money inside the rocker panels of another car purchased at a junk car auction, which he plans to take back to France. Charnier and Sal drive off in the Lincoln, but a large contingent of police led by Popeye blocks their path. The police chase the Lincoln back to the factory, where Boca is killed during a shootout. Most of the other criminals surrender. Charnier escapes into a nearby abandoned bakery with Popeye and Cloudy in pursuit. Popeye sees a shadowy figure in the distance and opens fire too late to heed a warning, killing Mulderig. Undaunted, he tells Cloudy he will get Charnier. He reloads his gun and runs into another room. A single gunshot is heard. Title cards describe various characters' fates: Weinstock was indicted, but his case was dismissed for \"lack of proper evidence\"; Angie Boca received a suspended sentence for an unspecified misdemeanor; Lou Boca received a reduced sentence; Devereaux served four years in a federal penitentiary for conspiracy; Charnier was never caught and is believed to be back in France. Popeye and Cloudy were transferred out of the narcotics division and reassigned.",
  "wiki": "https://en.wikipedia.org/wiki/The_French_Connection_(film)"
}