{
  "year": "1971",
  "name": "The Last Picture Show",
  "plot": "In 1951, Sonny Crawford and Duane Jackson are high school seniors and best friends in the small oil town of Anarene, Texas . Duane is dating Jacy Farrow, the prettiest girl in town, with the richest parents. Sonny breaks up with his girlfriend due to his secret crush on Jacy. At a Christmas dance, Jacy is invited by Lester Marlow to a skinny-dipping pool party at Bobby Sheen's, a wealthy young man and seemingly better prospect than Duane. At the dance, Sonny kisses Ruth Popper, the depressed middle-aged wife of his high school coach. Duane, Sonny and others take their young, mentally disabled friend, Billy, to a prostitute to lose his virginity. Returning him home, local businessman Sam \"The Lion\" is angered by their treatment of Billy, who habitually sweeps Anarene's main street. He forbids the group from entering any of his businesses, the only entertainment in town: the pool hall, movie theater, and café. Later, when Sam catches Sonny visiting Billy and Genevieve the waitress at the café, Sonny apologizes and Sam lifts the ban on him. Bobby makes an advance on Jacy, but refuses to have sex with her because she is a virgin. On New Year's Eve weekend, Duane and Sonny impulsively drive to Mexico. Before leaving, the nostalgic Sam gives them some extra money to enjoy themselves. When the boys return hungover and tired on Monday morning, they learn that Sam died suddenly of a stroke the day before. Sam leaves Sonny the pool hall in his will. Jacy invites Duane to a motel room for sex, as she wants to be accepted into Bobby's libertine circle. He is unable to get an erection, so she scolds him. Later, they try again and Duane performs briefly, just enough for Jacy to lose her virginity. She breaks up with him by phone, hoping to become involved with Bobby. However, Jacy learns that Bobby has already married another girl. Out of boredom and feeling rejected, she has sex with Abilene, her father Gene's roughneck foreman and her mother's lover. When he drops Jacy off he is brutally cold. Upon entering the house, Jacy's mother Lois catches her and Jacy begins to cry. Despite their own lies and affairs, they both hypocritically complain about men’s brutality. Upset over the breakup, Duane enlists in the Army and is scheduled to serve in the Korean War after basic training. In his absence, Jacy goes for Sonny, who abruptly drops Ruth and dreams of marrying her. Duane returns home on leave, driving a new Mercury . He fights with Sonny over Jacy, smashing a beer bottle into Sonny's eye, sending him to the hospital. During his recovery, he refuses to see Ruth when she visits. Jacy and Sonny elope to Oklahoma . While driving to their honeymoon, Jacy reveals she left a letter to her  parents, telling them of their entire plan. Jacy and Sonny are stopped by a state trooper who takes them to the Farrows’. Gene angrily berates Sonny and drives Jacy home. Sonny rides back with Lois, who reveals Sam was her first true love. She suggests Sonny would be much better off with Ruth than with Jacy. The marriage is annulled and a short time passes. On Duane's last night of leave, Sonny makes amends with him and reveals that Jacy has left for college in Dallas. They go to the theater on its final night. The last picture show is Red River . The next morning, when Sonny sees Duane off, Duane asks Sonny to take care of his Mercury after Sonny admits that he and Jacy \"never made it to the motel.\" As Sonny opens the pool hall, he hears brakes squealing outside. Billy was struck and killed by a truck when he was sweeping the road. The local townsmen surround Billy's body and coldly blame the dead boy for being stupid and careless. Grief-stricken, Sonny yells at them for their behavior and carefully carries Billy's body away, covering his face with his letterman jacket. Angry and depressed with his life, Sonny drives to the city limits. He slowly changes his mind and returns, parking near Ruth's. He shyly asks to come in for a cup of coffee. Depressed, she has shuttered herself inside. Ruth lets him in, then explodes in hurt and anger. She notices that Sonny is completely devastated. Demanding he look at her, he does and gently touches her hand. Ruth's anger melts away and she comforts him. Her last words are “Never you mind, honey. Never you mind” as the film ends.",
  "wiki": "https://en.wikipedia.org/wiki/The_Last_Picture_Show"
}