{
  "year": "1971",
  "name": "A Clockwork Orange",
  "plot": "In a futuristic Britain, Alex DeLarge is leader of a gang of \"droogs\": Georgie, Dim, and Pete. They engage in an intoxicated evening of \"ultra-violence\", which includes beating a vagrant and fighting a rival gang.  They beat writer Frank Alexander to the point of crippling him, and Alex rapes Alexander's wife while singing \" Singin' in the Rain \".  The next day Alex's probation officer, P. R. Deltoid, cautions him. Alex's droogs are not content with petty crime and want more equality and high-yield thefts, but Alex asserts his authority by attacking them. Alex invades the home of a wealthy \" cat-lady \" and bludgeons her with a phallic sculpture while his droogs remain outside. On hearing sirens, Alex tries to flee, but Dim smashes a bottle in his face and leaves him to be arrested. The woman dies of her injuries, and Alex is sentenced to 14 years in prison for murder. Two years into the sentence, Alex accepts an offer to be a test subject for the Minister of the Interior's new Ludovico technique , an experimental aversion therapy for rehabilitating criminals within two weeks. Alex is strapped to a chair, his eyes clamped open, and injected with drugs. He is forced to watch films of sex and violence, some accompanied by his favourite composer, Ludwig van Beethoven . Alex is nauseated and, fearing he will be sick upon hearing Beethoven, begs for an end to the treatment. The Minister demonstrates Alex's rehabilitation to officials. Alex is unable to fight back against an actor who taunts and attacks him, and becomes ill upon attempting to grope a topless woman. The prison chaplain complains that Alex has been robbed of his free will; the Minister asserts that the Ludovico technique will cut crime and alleviate crowding in prisons, allowing more space for political prisoners . Released from prison, Alex finds his possessions have been sold to provide compensation for his victims and his parents have let out his room. A vagrant whom Alex attacked years earlier attacks him with his friends. Alex is saved by two policemen whom he is shocked to find are his former droogs Dim and Georgie. They beat and nearly drown him before abandoning him. Alex collapses on the doorstep of a nearby home. Alex wakes to find himself in the home of Mr Alexander, who now uses a wheelchair. Alexander does not recognise Alex from the previous attack but knows of him and the Ludovico technique from the newspapers. He prepares to present Alex to his colleagues as a political weapon. Alex breaks into \"Singin' in the Rain\" while bathing, and Alexander realises it was he who assaulted his wife and him. Alexander drugs Alex and locks him in a bedroom, then plays Beethoven's Ninth Symphony loudly from the floor below. Unable to withstand the pain, Alex attempts suicide by jumping from the window. Alex awakes in hospital with multiple injuries. During psychological tests, he finds he no longer has aversions to violence and sex. The Minister arrives and apologises, saying the government has had Mr Alexander institutionalised. He offers to take care of Alex and get him a job in return for his co-operation with his election campaign and public relations counter-offensive. The Minister brings in a stereo system playing Beethoven's Ninth. Alex contemplates violence and has thoughts of having sex with a woman in front of an approving crowd, thinking, \"I was cured, all right!\"",
  "wiki": "https://en.wikipedia.org/wiki/A_Clockwork_Orange_(film)"
}