{
  "year": "1972",
  "name": "The Godfather",
  "plot": "In 1945, the don of New York City 's Corleone family , Vito Corleone , listens to requests during his daughter Connie 's wedding to Carlo Rizzi . Vito's youngest son Michael , a Marine and World War II hero who has so far stayed out of the family business, introduces his girlfriend Kay Adams to his family at the reception. Johnny Fontane, a popular singer and Vito's godson , seeks Vito's help in securing a movie role. Vito sends his consigliere , Tom Hagen , to persuade studio president Jack Woltz to offer Johnny the part. Woltz refuses Hagen's request at first, but soon complies after finding the severed head of his prized stud horse in his bed. As Christmas approaches, drug baron Virgil \"The Turk\" Sollozzo asks Vito to invest in his narcotics business to provide police protection. Vito declines, citing that involvement in narcotics would alienate his political connections. Suspicious of Sollozzo's partnership with the Tattaglia crime family, Vito sends his enforcer Luca Brasi to the Tattaglias on an espionage mission. Brasi is garroted to death during the initial meeting. Later, hitmen gun down Vito and coerce Hagen into a meeting. With Vito's first-born Sonny now in command, Sollozzo pressures Hagen to persuade Sonny to accept the narcotics deal. Vito survives the shooting and is visited in the hospital by Michael, who finds him unprotected after corrupt police captain Mark McCluskey, on Sollozzo's payroll, orders NYPD police officers to clear out Vito's guards. Michael stops the attempt on his father's life but is then beaten up by Captain McCluskey. After the attempted hit at the hospital, Sonny retaliates with a hit on Bruno Tattaglia. Sollozzo and McCluskey request to meet with Michael and settle the dispute. The Corleones agree to the meeting and devise a plan to plant a handgun in the bathroom of the Bronx restaurant where the meeting will be held. Michael speaks with Sollozzo for several minutes then excuses himself, retrieves the gun, and shoots both men dead. Despite a clampdown by the authorities for the killing of a police captain, the Five Families erupt in open warfare. Michael takes refuge under the protection of Don Tommasino in Sicily , and Vito's second son Fredo is sheltered by Jewish mobster Moe Greene in Las Vegas . In Sicily, Michael meets and marries a local woman, Apollonia . Sonny publicly attacks and threatens Carlo for physically abusing Connie. When he abuses her again, Sonny speeds to their home but is ambushed and murdered by gangsters at a highway toll booth. Apollonia is killed shortly thereafter by a car bomb intended for Michael. Devastated by Sonny's death and tired of war as the capo dei capi , Vito sets up a meeting with the Five Families. He assures them that he will withdraw his opposition to their narcotics business and forgo avenging Sonny's murder. His safety guaranteed, Michael returns home to enter the family business and marry Kay. They have two children in the early 1950s. With his father nearing the end of his life and Fredo not suited to lead, Michael assumes the position of head of the Corleone family. Vito tells Michael that he now knows that their true adversary had been Don Barzini all along. He warns him that Barzini would try to kill him at a meeting organized by a traitorous Corleone capo . With Vito's support, Michael relegates Hagen to managing operations in Las Vegas as he is not a \"wartime consigliere\". Michael travels to Las Vegas to buy out Moe Greene's stake in the family's casinos and reprimands Fredo for defending Greene, whom Barzini had turned against the family. In 1955, Vito dies of a heart attack while playing with Michael's son Anthony . At Vito's funeral, Tessio asks Michael to meet with Barzini, signaling his betrayal. The meeting is set for the same day as the baptism of Connie's baby. Michael, remembering his father's warning, deduces the plot and Tessio is led off to be murdered. While Michael stands at the baptismal font as the child's godfather , Corleone hitmen murder the dons of the four other families as well as Greene for not selling his hotel. Michael extracts Carlo's confession that he had conspired with Barzini on Sonny's assassination. He assures Carlo that he is being exiled, not murdered. However, Clemenza strangles Carlo in a car shortly afterwards. Connie confronts Michael about his involvement in Carlo's death while Kay is in the room. Kay asks Michael if he ordered Carlo's death, which Michael denies, leaving Kay relieved. As she leaves, capos enter the office and pay reverence to Michael as \"Don Corleone\".",
  "wiki": "https://en.wikipedia.org/wiki/The_Godfather"
}