{
  "year": "1972",
  "name": "The Emigrants",
  "plot": "In 1844, the Nilsson family lives on a small farm in Korpamoen in Ljuder Parish in the Swedish province of Småland . Eldest son, Karl Oskar, runs the farm after his father, Nils, is injured. Karl Oskar marries Kristina Johansdotter. In the following years, Karl Oskar and Kristina have four children, Anna, Johan, Märta and Harald. The family struggles with rock-filled fields, poor weather, and bad harvests, leaving them hungry and in debt. Kristina rebukes Karl Oskar for his irreligious attitude, partially blaming it for causing their problems. Karl Oskar's daydreaming and bookish younger brother, Robert, tired of being overworked and regularly beaten as an indentured farmhand at Aron's farm, reads about how wonderful America is and decides to emigrate. He asks Arvid, his fellow farmhand, to come with him. Arvid agrees, but their hopes are dashed upon realizing they are unable to afford passage. Robert wants to sell his share of the family farm to Karl Oskar, only to learn that Karl Oskar has also considered going to America. Despite the potential for a better life, Kristina is unenthusiastic, not wanting to leave her homeland and concerns about the arduous journey. However, when daughter Anna dies after gorging on uncooked porridge that ruptures her stomach, a devastated Kristina agrees to Karl Oskar's plan to leave Sweden. Meanwhile, Danjel Andreasson, Kristina's uncle, is being persecuted by Brusander, the local provost , for rejecting the official religion and holding fundamentalist religious services at his home. He and his wife, Inga-Lena, and their four young children are exiled, so they join Karl Oskar in his move to America. Ulrika of Västergöhl, a former prostitute who is one of Danjel's followers, and her illegitimate sixteen-year-old daughter, Elin, also join them, and Jonas Petter, a neighbor, is interested to escape his unhappy marriage. Robert is able to persuade Danjel to hire Arvid and pay his fare. Before their departure, Kristina tells Karl Oskar she is pregnant. The emigrants travel to Karlshamn and board the wooden brig Charlotta , bound for New York City . On board, Karl Oskar and Kristina meet Måns and Fina-Kajsa Andersson, an elderly couple heading for the Minnesota Territory to settle on their son Anders' farm near a town called Taylor's Falls . After hearing how good the land is there, Karl Oskar and Kristina decide to follow them. During the voyage, Inga-Lena and Måns Andersson die of unrelated sudden illnesses, and Kristina nearly dies from a severe nosebleed. Upon arrival in New York, Karl Oskar and his party, along with Fina-Kajsa, travel westward to Minnesota, first by train, and then by riverboat. Throughout the whole journey from Sweden, the pious Kristina has been prejudiced against Ulrika for her past immorality, but they reconcile after Ulrika finds Kristina's missing child at a riverboat stop who was almost left behind. Soon after, while still on the riverboat, Danjel's infant daughter dies after a brief illness. After finally arriving at the town of Stillwater , the party, with help from Pastor Jackson, a friendly Baptist minister, finds their way to Anders' farm in what is now known as the Chisago Lakes area. He lives in a wooden shack, but the land is fertile, and Danjel and Jonas Petter choose fine farmland tracts nearby. Karl Oskar, however, heads deep into the woods to explore the lands along the shore of Lake Ki Chi Saga that he hears are even better. Upon arrival, he finds the topsoil is excellent and stakes a claim by carving his name into a tree overlooking the lake.",
  "wiki": "https://en.wikipedia.org/wiki/The_Emigrants_(film)"
}