{
  "year": "1974",
  "name": "The Conversation",
  "plot": "Harry Caul, a surveillance expert in San Francisco , specializes in audio recordings . He and his team are hired by a client known as \"the Director\" to eavesdrop on a couple, whom they record walking in circles in Union Square . Despite the background noise, Harry filters and merges the tapes to create a clear recording with ambiguous meaning. Harry is intensely private, obsessively guarding his personal life; though he insists that he is not responsible for how his clients use the surveillance he creates, he is haunted by guilt from a past job that resulted in three deaths. When he discovers a potentially dangerous phrase in the recording, \"He'd kill us if he got the chance,\" Harry becomes increasingly anxious. His attempt to deliver the recording is thwarted, and he is both followed and threatened. After a party at his workshop, Harry spends the night with a woman he has just met and the tapes are stolen. He receives a call from Martin Stett, the Director's assistant, informing him that the Director could not wait any longer and they have the tapes. Harry is tasked with delivering the pictures taken and collecting his money in a meeting with the Director that afternoon. There he learns that the woman in the recording is the Director's wife, involved in an affair. Harry, suspecting murder, books a hotel room next to the one the couple had mentioned for a planned rendezvous in the recording, and overhears a heated argument. Convinced there was a murder, Harry breaks into the room; he initially finds no evidence, until he flushes the toilet and finds it clogged and overflowing with blood. Attempting to confront the Director, Harry discovers the wife is alive and unharmed, as is her lover. A newspaper headline reports that an executive has supposedly died in a car accident. Harry realizes that the couple actually murdered the Director, having missed the emphasis on the word \"us\" in the recording, which not only expressed the couple's fear of being killed by the Director if he discovered the affair, but was also an attempt to justify killing him first as a defensive move . Stett calls Harry at his apartment, and warns him not to investigate. He plays a freshly made recording of Harry playing his saxophone to prove they are listening. Harry frantically searches for bugs in his apartment, destroying nearly everything in it. Having failed to locate the bug, Harry sits alone amid the wreckage, playing his saxophone.",
  "wiki": "https://en.wikipedia.org/wiki/The_Conversation"
}