{
  "year": "1974",
  "name": "Chinatown",
  "plot": "In 1930s Los Angeles , a woman identifying herself as Evelyn Mulwray hires private investigator J. J. \"Jake\" Gittes to trail her husband, Hollis, the chief engineer at the Department of Water and Power . Gittes photographs Hollis in the company of a young woman and the pictures make their way into the Post-Record , exposing their apparent affair. Gittes is then confronted by the real Evelyn Mulwray, who threatens to sue him. He concludes that the imposter was using him to discredit Hollis. Gittes crosses paths with his former colleague, LAPD Lieutenant Lou Escobar, when Hollis's corpse is found in a reservoir. Investigating further, he discovers that huge quantities of water are being released from the reservoir each night, despite the fact that the city is in the midst of a drought. Water Department Security Chief Claude Mulvihill warns him off, and he has his nose slashed by one of Mulvihill's henchmen. Now working for Evelyn, Gittes investigates Hollis's death. He learns that Hollis was once the business partner of Evelyn's wealthy father, Noah Cross. Cross offers to double Gittes's fee if he finds Hollis's supposed mistress, who has disappeared. Gittes receives a call from Ida Sessions, the woman who posed as Evelyn. She refuses to say who hired her, but urges Gittes to check the Post-Record 's obituary section. Public records reveal that much of the Northwest Valley has recently changed ownership. Gittes recognizes one of the buyers' names from the obituary section; the obituary indicates that he had been dead for a week when the deal was closed. Gittes and Evelyn bluff their way into the retirement home where the buyer had lived and discover that many of the other residents are \" buyers \" too, although they have no knowledge of this fact. A suspicious staff member calls Mulvihill, but Gittes and Evelyn escape him and his thugs and hide at her mansion, where they sleep together. Later that night, Gittes follows Evelyn to a house where he sees her comforting the missing girl. When confronted, Evelyn claims the girl is her sister, Katherine. A call from Escobar summons Gittes to Ida's apartment; she has been murdered. Escobar reveals that Hollis had saltwater in his lungs, indicating that he did not drown in the reservoir. He suspects Evelyn murdered him and tells Gittes to produce her quickly. At the Mulwray residence, Gittes retrieves a pair of glasses \nfrom the saltwater garden pond. Gittes confronts Evelyn about Katherine, whom she now claims is her daughter. Frustrated, he repeatedly slaps Evelyn until she breaks down and reveals that Katherine is both her sister and daughter; the girl's father is Cross, who impregnated Evelyn when she was 15. She tells Gittes that the glasses he found did not belong to Hollis. Gittes arranges for the women to flee to Mexico and instructs Evelyn to meet him at her butler's home in Chinatown . He summons Cross to the Mulwray estate, having deduced that Cross dropped his glasses when he drowned Hollis in the pond. Cross reveals that he is behind both the water shortage and the land grab in the Northwest Valley. Once the land is his, he will obtain a contract from the city to build a reservoir there. He discredited and killed Hollis when the latter came close to uncovering the plan. At gunpoint, Cross and Mulvihill force Gittes to take them to Chinatown, where the police are waiting. Escobar detains Gittes as Cross attempts to claim Katherine. Evelyn shoots Cross in the arm and tries to escape with Katherine, but the police open fire, killing her. Cross takes a distraught Katherine away, and Escobar orders Gittes released. As the traumatised Gittes is led away by his associates, one tells him, \"Forget it, Jake. It's Chinatown.\" [ a ]",
  "wiki": "https://en.wikipedia.org/wiki/Chinatown_(1974_film)"
}