{
  "year": "1975",
  "name": "Dog Day Afternoon",
  "plot": "On August 22, 1972, first-time crook Sonny Wortzik and his friends Salvatore \"Sal\" Naturile and Stevie attempt to rob the First Brooklyn Savings Bank. The plan immediately goes awry when Stevie loses his nerve and flees. Sonny discovers they arrived after the daily cash pickup which left only $1,100 in cash at the bank. Sonny takes the bank's traveler's checks and burns the register in a trash can. When smoke raises suspicion outside, the building is surrounded by police. The two panicked robbers take the bank employees hostage. Police Detective Sergeant Eugene Moretti calls the bank, and Sonny threatens to kill the hostages. Sal assures Sonny he is ready to kill if necessary. Sonny releases an asthmatic security guard as a display of good faith. Moretti convinces Sonny to negotiate outside, and their dialogue culminates in his shouting \" Attica! Attica! \" to cheers from the crowd. Sonny lists his demands: a vehicle to the airport so they can board a jet, pizzas for the hostages, and to see his wife at the bank. Sonny's girlfriend Leon Shermer reveals the robbery was intended to pay for Leon's sex change surgery and that Sonny has children with estranged wife Angie. The bank's lights shut off when FBI agent Sheldon takes command of the scene. He refuses to discuss additional requests. Sheldon convinces Leon to talk to Sonny on the phone. Leon had been hospitalized at Bellevue Hospital after a suicide attempt . Leon turns down Sonny's offer to join in their escape. Sonny tells the police Leon wasn't involved with the robbery. Sonny agrees to let Mulvaney leave due to his diabetic shock, but he refuses to leave his employees. Sonny comes outside to talk to his mother, who fails to persuade him to surrender, then dictates his will to one of the hostages. He arranges for his life insurance to go to Angie and Leon. Agent Murphy drives Sonny, Sal and the remaining hostages to Kennedy Airport in a limousine. As they wait in the car for their plane to taxi, Sal releases another hostage. Sheldon seizes Sonny's weapon, Murphy shoots Sal with a hidden revolver, Sonny is immediately arrested, and the hostages are freed. Sonny watches Sal's body being removed from the car. In the aftermath of the film's events, Sonny is sentenced to twenty years in prison, leaving Angie and her children to subsist on welfare. Leon lives as a woman in New York City.",
  "wiki": "https://en.wikipedia.org/wiki/Dog_Day_Afternoon"
}