{
  "year": "1975",
  "name": "One Flew Over the Cuckoo's Nest",
  "plot": "In 1963 Oregon, Randle McMurphy is incarcerated for the statutory rape of a 15-year-old girl (which he claims he committed under the assumption that she was an 18-year-old), with five previous arrests for assault. He feigns mental illness so that he can be moved to a mental institution and avoid hard labor at a work farm . The medical ward is dominated by the cold, passive-aggressive Nurse Ratched , who intimidates her patients and maintains control through fear. The other patients include young, anxious, stuttering Billy Bibbit; Charlie Cheswick, who is prone to temper tantrums; delusional, child-like Martini; the articulate and repressed Dale Harding; belligerent and profane Max Taber; epileptics Jim Sefelt and Bruce Fredrickson; quiet but violent-minded Scanlon; tall, deaf-mute Native American Chief Bromden; and several others with chronic conditions. Ratched sees McMurphy's lively, rebellious presence as a threat to her authority, to which she responds by confiscating and rationing the patients' cigarettes and suspending their card-playing privileges. McMurphy finds himself in a battle of wills against Ratched. One night, he makes a bet with the other inmates that he can escape by tearing a hydrotherapy fountain off its base and hurling it through a locked window, but is predictably unable to lift it. Shortly after, he hijacks a charter bus, picks up his girlfriend Candy, and escapes with several patients to steal a recreational fishing boat, exposing them to the outside world and encouraging them to discover their abilities and find self-confidence. After an orderly tells him that his sentence term does not apply in the mental institution, and can become indefinite, McMurphy questions why no one had told him this before. He also learns that he, Chief, and Taber are the only non-chronic patients who have been involuntarily committed; the others have committed themselves voluntarily but are too afraid to leave. After Cheswick bursts into a fit and demands his cigarettes from Ratched, McMurphy starts a fight with the orderlies, and Chief intervenes to help him. McMurphy, Chief, and Cheswick are then sent to the disturbed ward, and Chief reveals to McMurphy that he can speak and hear normally, having faked deaf-muteness to avoid engaging with anyone. The two make plans to escape to Canada together. McMurphy is subjected to electroconvulsive therapy , and returns to the ward pretending to be brain-damaged before revealing that the treatment has made him even more determined to defeat Ratched. McMurphy and Chief plan to throw a secret Christmas party for their friends after Ratched and the orderlies leave for the night, before making their escape. McMurphy sneaks Candy and her friend Rose into the ward, each bringing bottles of alcohol for the party, and bribes the night orderly Turkle to allow the party. McMurphy and Chief prepare to escape, inviting Billy to come with them. Billy refuses but asks for a \"date\" with Candy; McMurphy arranges for him to spend a night with her. McMurphy and the others get drunk, and McMurphy falls asleep instead of escaping with Chief. Ratched arrives in the morning to find the ward in disarray; most patients have passed out. She discovers Billy and Candy in bed together and aims to embarrass Billy in front of everyone. Billy manages to overcome his stutter and stands up to Ratched. When she threatens to tell his mother, Billy cracks under the pressure and reverts to stuttering, before Ratched orders he be locked in a separate room as punishment. McMurphy punches an orderly when trying to escape out of a window with Chief, causing the other orderlies to intervene. Locked up alone, Billy kills himself by slitting his throat with a broken glass, causing a huge commotion. Ratched tries to control the situation by calling for the day's routine to continue as usual, but her nonchalant reaction enrages McMurphy, who begins strangling her. The orderlies violently subdue McMurphy, saving Ratched's life. Sometime later, Ratched is wearing a neck brace and speaking weakly although still sternly, and Harding leads the now unsuspended card-playing. McMurphy is nowhere to be found, leading to a rumor that he has escaped. Later that night, Chief sees McMurphy being returned to his bed. He is initially elated that McMurphy had kept his promise not to escape without him, until discovering that McMurphy has been lobotomized . After tearfully embracing McMurphy, Chief smothers him to death with a pillow. He then rips the hydrotherapy fountain off its base and throws it through the window as McMurphy had earlier attempted. Chief escapes, with Taber and the other inmates awakening to cheer him on as he runs into the surrounding countryside.",
  "wiki": "https://en.wikipedia.org/wiki/One_Flew_Over_the_Cuckoo%27s_Nest_(film)"
}