{
  "year": "1976",
  "name": "Taxi Driver",
  "plot": "In New York City , Vietnam War veteran Travis Bickle takes a job as a night-shift taxi driver to cope with his chronic insomnia and loneliness, frequently visiting adult movie theaters and keeping a diary in which he consciously attempts to include aphorisms such as \"you're only as healthy as you feel\". He becomes disgusted with the crime and urban decay that he witnesses in the city and dreams about getting \"the scum off the streets\". Travis becomes infatuated with Betsy, a campaign worker for Senator and presidential candidate Charles Palantine. Travis enters the campaign office where she works and asks her to join him for coffee, to which she agrees. Betsy agrees to go on a second date with him, during which he takes her to an adult movie theater, which she leaves immediately. He attempts to reconcile with her, but fails. Enraged, he storms into the campaign office where she works and berates her before being kicked out of the office. Experiencing an existential crisis and seeing various acts of prostitution throughout the city, Travis confides in a fellow taxi driver, nicknamed Wizard, about his violent thoughts . However, Wizard dismisses them and assures him that he will be fine. To find an outlet for his rage, Travis follows an intense physical training regimen. He gets in contact with black market gun dealer Easy Andy and buys four handguns . At home, Travis practices drawing his weapons, going as far as creating a quick-draw firearm hidden in his sleeve. He begins attending Palantine's rallies to scope out his security. One night, Travis shoots a man attempting to rob a convenience store run by his friend, leaving before the cops arrive as the convenience store owner proceeds to beat the non responsive robber. In his trips around the city, Travis regularly encounters Iris, a 12-year-old child prostitute . Tricking her pimp and abusive lover Sport into thinking that he wants to solicit her, Travis meets with her in private and tries to persuade her to stop prostituting herself. Soon, Travis shaves his hair into a mohawk and attends a public rally where he plans to assassinate Palantine. However, Secret Service agents see Travis putting his hand inside his jacket and approach him, which escalates to a chase. Travis escapes pursuit and makes it home undetected. That evening, Travis drives to the brothel where Iris works to kill Sport. He enters the building and shoots Sport and one of Iris's clients, a mafioso . Travis is shot several times but manages to kill the two men. He fights with the bouncer, whom he manages to stab through the hand with his knife and kill with a gunshot to the head. Travis attempts to die by suicide, but has no bullets. Severely injured, he slumps on a couch next to a sobbing Iris. As police respond to the scene, Travis mimics shooting himself in the head with his bloody finger . Travis goes into a coma due to his injuries, but he is heralded by the press as a heroic vigilante and not prosecuted for the murders. He receives a letter from Iris's parents in Pittsburgh , who thank him and reveal that she is safe and attending school. After recovering, Travis returns to work, where he encounters Betsy as a fare. Betsy tells him that she followed his story in the newspapers. Travis drops her at her home but declines to take her money, driving off with a smile. He becomes agitated after noticing something in his rearview mirror, but continues driving into the night.",
  "wiki": "https://en.wikipedia.org/wiki/Taxi_Driver"
}