{
  "year": "1976",
  "name": "Bound for Glory",
  "plot": "In 1936, amid the Great Depression , Woody Guthrie performs guitar at a gas station. A customer offers $1 to anyone who can address his worries, and Guthrie succeeds by providing a satisfactory answer. Subsequently, Guthrie begins painting a sign but frustrates his wife, Mary, by abandoning the task—their only reliable source of income—to engage in music instead. At a local bar, Guthrie performs for a woman named Sue Ann and spends the night with her. On his porch, he encounters Heavy Chandler, a recently released mental patient, and encourages him to express his thoughts through painting. After performing at a square dance, a dust storm compels everyone indoors. Guthrie suggests to Mary that he should leave to seek work, and eventually, he departs, leaving her a note. During his travels, Guthrie rides a train with Slim Snedeger and other hobos. When a fight breaks out, Guthrie and Slim jump to another train; however, railroad enforcers compel those without money to disembark. Slim is able to afford the fare, but Guthrie, being broke, continues on foot, and they part ways. Guthrie later offends a middle-class couple who provide him a ride, leading them to drop him off. In a bar, he earns a meal by playing the piano and spends the night with a waitress. He subsequently rides with a family bound for California, but at the state border, police demand $50 for entry. Guthrie leaves the family and joins a nearby hobo camp. In Los Angeles , he meets Luther and Liz Johnson, a migrant couple struggling to find employment. Upon discovering that jobs are both scarce and poorly compensated, Guthrie offers to paint a sign at a soup kitchen, but his only recompense is a serving of soup. Later, union organizer Ozark Bule arrives at the camp, performing union songs. When company thugs disrupt the gathering, Guthrie escapes with Ozark, who assists him in obtaining a radio job where Guthrie's songs about the working class achieve popularity. However, station owner Mr. Locke insists that Guthrie refrain from singing about unions and instead focus on entertainment. Although Guthrie initially acquiesces, he eventually resumes performing protest songs, resulting in conflict with Locke. Ultimately refusing to compromise, Guthrie is dismissed from his position. He brings Mary and their children to Los Angeles, but he feels out of place amid the wealth surrounding him. Luther, bruised from a beating, informs Guthrie that his songs provide inspiration to the laborers. Frustrated, Guthrie tears up a list of \"safe\" songs, leaves the studio, and resumes traveling, performing protest songs at migrant camps and factories. While performing at a fruit-packing plant, Guthrie is assaulted by company enforcers, who destroy his guitar. Undeterred, he continues to travel by train and perform his songs. Upon returning to Los Angeles, Locke extends one final opportunity to Guthrie, but he is terminated once again after dedicating a song to farm workers. As Guthrie departs, Ozark informs him that an agent has arranged a coast-to-coast radio show for him and secured an audition at the prestigious Ambassador Hotel . Guthrie purchases toys for his children, only to discover that Mary and the girls have already left. During the hotel audition, the owner offers him a position but insists on dressing him in overalls and presenting him as part of a hillbilly act. Refusing to cater to the wealthy, Guthrie walks out, returns to the railroad yard, hops on a train, and resumes singing protest songs from the top of a boxcar, remaining true to his roots.",
  "wiki": "https://en.wikipedia.org/wiki/Bound_for_Glory_(1976_film)"
}