{
  "year": "1978",
  "name": "The Deer Hunter",
  "plot": "Three friends in the Slavic-American [ 3 ] [ a ] community of Clairton, Pennsylvania —Mike Vronsky, Steven Pushkov and Nick Chevotarevich—work in a steel mill and hunt deer with their co-workers Stanley (\"Stan\") and Peter \"Axel\" Axelrod, and their bartender friend John Welsh. The three have enlisted for the Vietnam War . Steven is marrying Angela Ludhjduravic, who was secretly impregnated by another man. The withdrawn Mike and amiable Nick are close friends who live together and both love Linda, though she appears closer to Nick; he allows her to stay in their house while they are away to escape her abusive alcoholic father. After catching the bouquet at Steven and Angela's wedding, Linda accepts Nick's spontaneous marriage proposal. The three also meet a traumatized Green Beret , who dismisses them. Nick implores Mike to promise that he return from Vietnam. Mike, Nick and their friends go on a final hunting trip where Mike kills a deer with \"one shot\", a feat Nick described as impossible. In Vietnam, Mike, now a Green Beret himself, coincidentally crosses paths with Nick and Steven, who land in a village during an air assault mission. The three are soon imprisoned by the Viet Cong in a cage along a river and forced to participate in games of Russian roulette while the jailers wager. Steven fires his round into the ceiling and is forced into a cage with rats and previous victims of the jailers. To escape, Mike convinces their captors to increase the stakes by loading three bullets into the revolver rather than the standard one. When the next two chambers luckily fall on empty, Mike and Nick turn the gun on their captors, killing two and overpowering the others. Although Nick is wounded in the leg, they rescue Steven and escape. The trio floats down the river on a felled tree trunk, but Nick and Steven are weak from their wounds. They are found by an American helicopter . Nick boards and is rescued, but Steven falls back into the river while trying to hold onto the helicopter skids, and Mike drops down to help him. Steven breaks both of his legs on the river’s rock bottom, so Mike carries him until they join refugees and a South Vietnamese Army convoy. All three of them end up in Saigon . Nick is treated at a U.S. military hospital . When released, now suffering from PTSD , Nick wanders into a gambling den where people are playing Russian roulette. French businessman Julien Grinda forces him to come inside. Upset, Nick interrupts the game, pulling the trigger on a player and himself then assaulting the bouncer. Mike happens to be a spectator, but Nick hurriedly leaves with Julien, who decides to bankroll him in future games. Mike returns home, but remains traumatized and avoids a welcome-home party. He learns that Nick has deserted , and Angela has slipped into near-catatonia following the birth of her child and return of Steven. On a hunting trip with his friends, Mike stops himself from shooting a deer and returns to the cabin, finding Stan cavalierly threatening Axel with a pistol. Mike takes it, inserts a single round, and triggers an empty chamber at Stan's head. Mike repeatedly stays at a hotel instead of his home. Linda follows him each time, and they eventually consummate their relationship. The next day he visits Steven at a veterans' hospital, finding that both of his legs and one arm have been amputated, and he is subsequently refusing to come home. He shows Mike that he has been regularly receiving large sums of cash from Saigon. Mike realizes that Nick is the source of these payments as well as the father of Angela’s son, and convinces Steven to return to Angela. Mike returns to Saigon, which is now in a state of chaos shortly before its fall , to find Nick. He finds Julien and persuades him to take him to another gambling den. There he locates Nick, who has become a professional in Russian roulette and fails to recognize Mike due to drug addiction. Mike attempts to bring Nick back to reason, but Nick maintains unspirited apathy, even spitting in Mike's face. Mike resorts to entering in a game with Nick; as he describes their hunting trips, Nick seems to recall Mike's \"one shot\" mantra about the deer and smiles before pulling the trigger, killing himself. Mike, Steven, and their friends and loved ones attend Nick's funeral. As they convene at the bar for breakfast, John begins to sing \" God Bless America \" to lighten the mood, and all join in.",
  "wiki": "https://en.wikipedia.org/wiki/The_Deer_Hunter"
}