{
  "year": "1980",
  "name": "The Elephant Man",
  "plot": "Frederick Treves, a surgeon at the London Hospital , finds the disfigured and seemingly-mute John Merrick in a Victorian freak show . Mr. Bytes, the brutish ringmaster, tells lurid stories of how elephants sexually assaulted Merrick's mother to create a half-human monster. Hoping to gain notoriety with a medical discovery, Treves pays Bytes to bring Merrick to the hospital for examination, wearing a hood for discretion. Treves presents Merrick to his colleagues and highlights Merrick's physical abnormalities. In particular, Merrick's deformed skull forces him to sleep sitting up, as lying down would asphyxiate him. Bytes savagely beats him after the lecture, and Merrick is sent back to the hospital. The matron, Mrs Mothershead, reluctantly tends to him, as the other nurses are too frightened of him. Treves diagnoses Merrick with an intellectual disability . His boss, Mr. Carr Gomm, points out that if he is right, Merrick cannot stay, as the hospital does not accept \"incurables\". It turns out that Merrick is actually intelligent and can speak, albeit with severe difficulty. To prove that Merrick can make progress, Treves trains him to say basic conversational sentences and part of the 23rd Psalm to Carr Gomm. Merrick is so nervous that he cannot respond to questions coherently, prompting Carr Gomm to excuse himself. As he is leaving, Merrick proves his intelligence and his ability to read by reciting the entire 23rd Psalm from memory. Although Merrick's physical condition is incurable and he has no mental condition to cure, Carr Gomm allows him to stay. Treves slowly broadens Merrick's world. He gives Merrick supplies to build a model of the nearby St Philip's Church . He invites Merrick to tea with his wife Ann, where they exchange photos of their families. Merrick tells Ann that he must have been a disappointment to his mother, but hopes she would be proud to see him with friends, which brings Ann to tears. Overwhelmed by the shock of being treated with kindness, Merrick also cries. Fashionable society takes an interest in Merrick. Actress Madge Kendal gives him a copy of Romeo and Juliet ; Merrick is fascinated by the theatre, but has never seen a play. The two perform a romantic dialogue from the play, which culminates in a kiss. In addition, Queen Victoria and Princess Alexandra arrange for him to be permanently admitted to the hospital. However, other society guests treat Merrick with visible disgust. Mothershead, who has grown to respect Merrick, realizes that Victorian society makes a show of helping Merrick to reassure itself of its own Christian values; the film periodically highlights society's indifference to the poor. She compares Treves to Bytes' freak show, which shakes him greatly. A new freak show begins when Jim, an unscrupulous hospital employee, begins selling tickets to gawk at, and sometimes physically torment, Merrick. Bytes buys a ticket, kidnaps Merrick, and spirits him to a freak show on Belgium. The next morning, Treves accuses Jim for lying and getting involved with Bytes to kidnap Merrick, and Mrs. Mothershead hits Jim with a package and fires him in the process. Merrick's health rapidly deteriorates during the show, and he collapses in front of the audiences; an audience member spat at Bytes in disgust. To punish him, Bytes drunkenly cages him in captivity with monkeys. The boy and other freak show attractions break him out and send him to England. In Liverpool Street station , three boys harass him. Merrick flees and accidentally knocks down a girl, prompting an angry mob to chase him. Defenceless, he cries out, \"I am not an elephant! I am not an animal! I am a human being! I am a man!\" and faints. [ 5 ] The police bring Merrick back to the hospital. Treves and other people in the hospital realize that Merrick is dying, and tries to make his final days comfortable. He apologizes to Merrick for his ordeal, but Merrick says he is happy and fulfilled due to Treves' efforts. Treves responds that Merrick has helped him too. Princess Alexandra invites Merrick to the royal box for a pantomime , his first-ever show. Kendal dedicates the performance to him. Treves prompts Merrick to show his face to the crowd, which gives him a standing ovation. Back at the hospital, Merrick and Treves bid each other goodnight, and Merrick completes his church model. He lies down to sleep, as he has always dreamed of doing. As he dies, he sees a vision of his mother, who quotes Lord Tennyson 's \"Nothing Will Die\".",
  "wiki": "https://en.wikipedia.org/wiki/The_Elephant_Man_(1980_film)"
}