{
  "year": "1982",
  "name": "E.T. the Extra-Terrestrial",
  "plot": "A race of diminutive aliens visit Earth at night to gather plant specimens in a California forest. One of them, fascinated by the distant lights of a neighborhood, separates from the group, before U.S. government agents arrive and chase the startled creature. The aliens are forced to depart before the agents can find them, leaving their lone member behind. While the agents search the forest, the creature takes shelter in a shed belonging to the family of ten-year-old Elliott Taylor. Initially scared by the creature, who runs away, Elliott spends the following day leaving a trail of Reese's Pieces to lure the alien back to the Taylor's home, where he hides the creature in his room. The following morning, Elliott feigns illness to stay off school and play with the creature, whom he dubs E.T. Elliott eventually introduces E.T. to his older brother, Michael, and five-year-old sister Gertie, who agree to keep E.T. hidden from their hardworking single mother, Mary. When the children ask about his origins, E.T. displays telekinetic abilities by levitating several balls to represent his planetary system , and later demonstrates other extraordinary abilities by reviving a dead chrysanthemum and instantly healing a cut on Elliott's finger. As Elliott and the creature begin to bond, they start to share thoughts and emotions, the two being simultaneously startled when E.T. accidentally opens an umbrella in a different room. At school, Elliott becomes intoxicated because, at home, E.T. is drinking beer and watching television. Sensing E.T.'s desire to be rescued, Elliott impulsively frees the frogs about to be vivisected in his biology class, inspiring the other children to follow his lead, and romantically kisses a girl he likes because E.T. is watching John Wayne kiss Maureen O'Hara in The Quiet Man (1952); Elliott is sent to the principal's office for his disruptive behavior. Inspired by a Buck Rogers comic strip, depicting the character calling for help with a communication device, E.T. builds a makeshift device to \"phone home\", using various parts around the Taylor home. E.T. also learns to speak English, and requests the children's help to build the device. They agree to help find the missing components, unaware that agents are covertly searching for the alien. On Halloween , the children disguise E.T. as a ghost and Elliott sneaks E.T. into the forest, where they set up the device to call E.T.'s people. Elliott begs E.T. to stay on Earth with him, before falling asleep and waking alone in the forest the next day. Elliott returns home to his worried family, while Michael searches for E.T., finding him pale and weakened in a culvert . He takes him home, where Elliott is also growing weaker, and reveals the creature to Mary just before government agents invade and quarantine the house. The lead agent, Keys, asks for Elliott's help to save E.T., stating that meeting aliens was his childhood dream and he considers E.T's arrival a genuine miracle. However, E.T. dies while Elliott rapidly recovers. Left alone to say goodbye, Elliott tells E.T. that he loves him, so E.T.'s heart begins to glow and he is revived and restored to health. E.T. tells Elliott that his people are returning for him. Elliott and Michael flee with E.T. on their bikes, flanked by Michael's friends who help them evade the pursuing authorities. Heading towards a roadblock, E.T. levitates the boys to safety and lands them in the forest. E.T.'s ship arrives, and he says goodbye to Michael and Gertie, who gifts him the chrysanthemum he previously revived. Elliott tearfully asks E.T. to stay, but E.T. places his glowing finger on Elliott's head and tells him that he will always be there. The children, Mary, and Keys observe as the ship blasts off into space, leaving a rainbow in the sky.",
  "wiki": "https://en.wikipedia.org/wiki/E.T._the_Extra-Terrestrial"
}