{
  "year": "1983",
  "name": "Terms of Endearment",
  "plot": "Aurora Greenway, a widow since her daughter Emma was a child, keeps several suitors at arm's length in River Oaks, Houston , focusing instead on her close, but controlling, relationship with Emma. Anxious to escape her mother, Emma marries callow young college professor Flap Horton over her mother's objections. Despite their frequent spats and difficulty getting along with each other, Emma and Aurora have very close ties and keep in touch by telephone. Soon after the wedding, Emma gets pregnant with their first child. He is a few years old when she is again expecting another. The small family moves to Iowa in order for Flap to pursue a career as an English professor. When they run into financial difficulties, Emma calls Aurora for help. Admitting she is pregnant with a third, her mother suggests she go to Colorado for an abortion. When Flap gets home, as he was away overnight, Emma demands to be told if he is having an affair. He insists it is paranoia, brought on by the pregnancy hormones. While at the grocery store, Emma does not have enough money to pay for all of her groceries and meets Sam Burns, who helps pay for them. Meanwhile the lonely Aurora, after her priest insults her by suggesting she is two years older than she actually is at her birthday celebration, overcomes her repression and begins a whirlwind romance with her next-door neighbor, retired astronaut Garrett Breedlove, who is promiscuous and coarse. Simultaneously Emma and Sam strike up a friendship and quickly an affair as Sam's wife refuses to have sex with him, and she suspects Flap of infidelity. Over the course of the next few years, the marriage begins to fray. Emma catches Flap flirting with one of his students on campus, so she takes the children and drives back to Houston immediately. There, Garrett develops cold feet about his relationship with Aurora after seeing her with her daughter and grandchildren and breaks it off. While Emma is gone, Flap accepts a promotion in Nebraska ; she and the children return to Iowa, then they move to Nebraska. While on the campus, Emma sees the same young woman who she had seen Flap with in Iowa. Confronting her, she finds out he moved them to Nebraska so he could work with his girlfriend Janice. When Emma is diagnosed with cancer, before she knows how advanced it is, her lifelong friend Patsy convinces her to explore NYC. She is there a short time when Patsy's friends there first find it strange she has never worked; then it gets more uncomfortable when they hear about the cancer. Not enjoying herself, she returns home early. When they discover it is terminal cancer, Aurora and Flap stay by Emma's side through her treatment and hospitalization. Garrett flies to Nebraska to be with Aurora and her family. The dying Emma shows her love for her mother by entrusting her children to Aurora's care.",
  "wiki": "https://en.wikipedia.org/wiki/Terms_of_Endearment"
}