{
  "year": "1984",
  "name": "Places in the Heart",
  "plot": "In 1935, during the Great Depression , the quiet town of Waxahachie, Texas , is shaken when Sheriff Royce Spalding is accidentally shot and killed by a drunk Black teenager, Wylie, who believes his revolver is empty. That same day, a white lynch mob brutally murders Wylie and drags his body through town, leaving it hanging from a tree. Both Royce and Wylie are buried on the same day. Royce's widow, Edna Spalding, is left to raise their two young children, Frank and Possum, on a struggling cotton farm. Her sister Margaret helps with the funeral, but Edna quickly finds herself facing financial ruin. The local banker, Albert Denby, tells her to sell the farm, but she refuses. That night, a Black drifter named Moses \"Moze\" Hadner arrives at Edna's door asking for work. He claims to know how to farm cotton and offers to help her. She feeds him but sends him away. The next morning, she finds him chopping wood in her yard. She feeds him again, but Moze later steals silverware and is caught. When the police bring him back, Edna decides not to press charges and instead hires him officially. Edna's troubles mount when Denby insists she take in his blind brother-in-law, Will, a bitter World War I veteran, as a boarder. Will resents his new situation but gradually forms a bond with Edna's children, especially after rescuing Possum during a tornado that devastates part of the town. Meanwhile, Margaret's marriage begins to fall apart as her husband Wayne carries on an affair with Viola Kelsey, a married schoolteacher. After the tornado, Margaret discovers the truth and Wayne confesses the affair, and she tells him she won't forgive him this time. As cotton prices continue to fall, Edna realizes she can't meet the next mortgage payment. She learns of a $100 prize awarded to the first farmer in Ellis County to bring in a bale of cotton for the season. With Moze's guidance, Edna assembles a small team of pickers and races to harvest and sell the crop. Moze teaches her how to negotiate fairly with the buyer, and their gamble pays off—they win the prize and sell the cotton at a good price, enough to save the farm. Their success is short-lived. That night, Moze is attacked by the Ku Klux Klan . Will, hearing the assault and recognizing the attackers by voice, intervenes with Royce's old revolver. He stops the beating, and the men flee. Moze knows that his life is in danger and staying will only bring trouble to Edna and her children. Before leaving, he gives her a handkerchief that belonged to his mother. The film closes with a dreamlike church scene. As a choir sings and 1 Corinthians 13 is read aloud, characters from earlier in the story—living and dead—appear among the pews, taking part in Holy Communion . Margaret takes Wayne's hand in silent reconciliation. Moze, now gone, is shown present in the church. Edna gently passes the communion tray to her late husband, Royce, who then passes it to Wylie, the boy who killed him. They exchange the words, \"Peace of God,\" as the camera lingers on them in solemn silence.",
  "wiki": "https://en.wikipedia.org/wiki/Places_in_the_Heart"
}