{
  "year": "1985",
  "name": "The Color Purple",
  "plot": "Celie is an African-American teenager in early 20th century rural Georgia who twice has born children by her abusive father, which were taken from her. He gives her away as a wife to Mister, who also abuses her, and his children mistreat her. Celie's loving younger sister, Nettie, runs away from their abusive father and seeks shelter with Celie. The sisters promise to write if they are separated. Mister attempts to sexually assault Nettie, and he kicks her out after she fights him off. Years later, Celie is meek from abuse. Mister's son Harpo marries Sofia, and Celie is shocked to find theirs to be a matriarchal household. Harpo attempts to overpower and strike Sofia, but he fails. Celie advises Harpo to beat Sofia, who retaliates and later confronts Celie, revealing her long history of abuse. She threatens to kill Harpo if he beats her again and tells Celie to do likewise to Mister. Harpo does not change, so Sofia leaves, taking their children with her. Mister and Harpo bring home the ailing Shug Avery, a showgirl and Mister's long-time mistress . Celie, who has slowly developed a fondness for her through a photograph sent to Mister, is in awe of Shug's strong will. Celie nurses Shug back to health, who in turn takes a liking to her, writing and performing a song about her at Harpo's newly opened bar. Shug tells Celie she is moving to Memphis , and Celie confides to Shug that Mister beats her. Shug tells Celie she is beautiful and that she loves her, and they kiss. Celie packs her things to follow Shug to Memphis but gets caught by Mister. Meanwhile, Sofia has been imprisoned for striking the town's mayor after he slaps her for speaking back to his wife Ms. Millie. Years pass, and she, now a shell of her former self, is released from prison – only to be immediately ordered by the judge to become a maid to the Ms. Millie. Having not seen her children in eight years, Sofia is allotted Christmas to be with her family. When Ms. Millie tries to drive her, she panics and turns around after encountering a group of Sofia's family and friends, who were only trying to help her. Shug returns to Celie and Mister's home with her new husband Grady, expecting to receive a recording contract . She gives Celie a letter from Nettie, who tells her that she is working for the couple who adopted Celie's children. Celie and Shug realize that Mister has been hiding Nettie's letters from Celie so, while he and Grady are out drinking, they search the house. They find a hidden compartment under the floorboards filled with dozens and dozens of Nettie's letters. Engrossed in reading, Celie does not hear Mister's calls to shave him, so he beats her. She attempts to kill Mister with his straight razor, but Shug stops her. At a family gathering, Celie finally speaks up against Mister to the delight of Shug and Sofia. This fighting spirit prompts Harpo's new wife Squeak to stand up for herself as well. Shug and Grady drive away, taking Celie and Squeak with them. Years later, Mister is an old drunk and alone, and Harpo has made amends with Sofia; they now run the bar together, and Shug still performs there. Upon Celie's father's death, she finally learns from Nettie's letters he was not their biological father. When their mother died, \"his\" property was legally inherited by Celie and Nettie. So, she receives the home and shop that had belonged to her father. Celie begins to operate a tailor shop . When Mister receives a letter from Nettie addressed to Celie, he takes money from his secret stash, and arranges for Nettie, her husband, and Celie's children to return to the U.S. from Africa, where they had been living. While Mister watches from a distance, Celie, Nettie, and Celie's children reunite, and the two sisters bond over a hand-clapping game from their childhood.",
  "wiki": "https://en.wikipedia.org/wiki/The_Color_Purple_(1985_film)"
}