{
  "year": "1985",
  "name": "Witness",
  "plot": "In a quiet Amish community outside Lancaster, Pennsylvania , friends and family attend the funeral of Jacob Lapp, leaving behind his wife, Rachel, and eight-year-old son, Samuel. Rachel and Samuel travel by train to visit Rachel's sister, which takes them into Philadelphia . While at the 30th Street Station waiting for a connecting train, Samuel goes into the men's room and witnesses the murder of undercover police officer Detective Ian Zenovich. Detective Captain John Book and his partner, Sergeant Elton Carter, are assigned to the case. They question Samuel, who is unable to identify the perpetrator from mugshots or a lineup. Samuel then sees a newspaper clipping in a trophy case of narcotics officer Lieutenant James McFee and points him out to Book as the murderer. Book investigates McFee and discovers that he was previously responsible for a seizure of expensive chemicals used to make black-market amphetamine , after which the chemicals disappeared. Book surmises that McFee sold the chemicals back to drug dealers, and Zenovich was investigating. Book expresses his suspicions to Chief of Police Paul Schaeffer, who advises Book to keep the case secret so that they can determine how to proceed. Book is later ambushed in his apartment parking garage by McFee, who shoots and wounds him before fleeing. Since only Schaeffer knew of Book's suspicions, Book realizes that Schaeffer is corrupt and tipped off McFee. Knowing that Samuel and Rachel are now in danger, Book orders Carter to hide their police files. He then drives them back to their farm. While beginning his drive back to Philadelphia, he passes out from his wounds and crashes into their birdhouse . Rachel insists that he be taken to a hospital, but Book refuses and states that going there would allow him and, by extension, them to be found. Rachel's father-in-law, Eli, reluctantly agrees to shelter Book. Book slowly recovers in their care and begins to blend into the Amish community and lifestyle. He and Rachel develop feelings for each other, which becomes a source of friction for Daniel Hochleitner (a neighbor who had hoped to court Rachel after her husband's death). Book's relationship with the Amish community deepens as they learn that he is skilled at carpentry and seems like a decent, hard-working man. He is invited to participate in a barn raising for a newly-married couple, gaining Hochleitner's respect. However, the attraction between Book and Rachel is evident and causes gossip in the tight-knit community. Meanwhile, Schaeffer searches for Book by contacting authorities in the Amish area. However, since Amish communities have no modern means of communication and little contact with the outside world, he hits repeated dead ends. When Book goes into town with Eli to use a payphone to call his precinct, he learns that Carter was killed in the line of duty. Realizing that Schaeffer was behind it, Book calls him at his home (where the call cannot be traced), chastises him for being corrupt and threatens to kill him. As they leave town, a group of locals harass the Amish. Book retaliates, breaking with the Amish tradition of non-violence . The assault is reported to the local police, and word eventually gets back to Schaeffer. Upset with Book over the assault, Eli orders him to leave. Rachel approaches Book in a field, where they passionately embrace, finally acting on their feelings. Soon after, Schaeffer, McFee and another corrupt cop, Sergeant Leon \"Fergie\" Ferguson, arrive at the Lapp farm and take Rachel and Eli hostage. Eli manages to alert Book, and Book tells Samuel to hide at Hochleitner's farm. Book tricks Fergie into the corn silo and suffocates him under tons of corn , then uses Fergie's shotgun to kill McFee. Schaeffer holds Rachel and Eli at gunpoint, but Samuel secretly comes back to ring the Lapp farm's bell. Book confronts Schaeffer, who threatens to kill Rachel, but the bell has alerted and summoned all of the neighbors. With so many witnesses present, Schaeffer surrenders and is later arrested. With Rachel and Samuel no longer in danger, Book departs for Philadelphia, bidding farewell. Before he drives off, Eli wishes Book well by saying, \"You be careful out there among them English.”",
  "wiki": "https://en.wikipedia.org/wiki/Witness_(1985_film)"
}