{
  "year": "1985",
  "name": "Out of Africa",
  "plot": "In 1913, after being rejected by a Swedish nobleman, Danish aristocrat Karen Dinesen proposes a marriage of convenience to the nobleman's brother, Baron Bror Blixen . They plan to move to Nairobi , British East Africa , where Bror intends to invest Karen's money in a dairy farm. She will join him a few months later, at which time they will marry. En route to Nairobi, Karen's train is hailed by big-game hunter Denys Finch Hatton , who knows Bror and entrusts her with his ivory haul. Farah, the Somali headman Bror hired, greets Karen at the railway station. She is taken to the Muthaiga Club . She enters the men-only salon seeking her future husband, but is soon asked to leave. Karen and Bror immediately marry and become Baroness Blixen. Karen learns that Bror has changed their plan and instead bought a coffee farm, but it is at too high an elevation to be very productive. Karen needs Bror's help managing the farm, but he is more interested in guiding big-game hunting safaris. Karen comes to love Africa and its people. She looks after the Kikuyu people who live on her land, establishes a school there, helps with their medical needs, and arbitrates their disputes. Meanwhile, she attempts to build a formal European homelife equal to other nearby upper-class colonists. She befriends a young woman, Felicity (whose character is based on a young Beryl Markham ). Eventually, Karen and Bror's mutual feelings deepen, and they do consummate their marriage. However, Bror keeps pursuing other women, while Karen fills her evenings, socialising with neighbor visitors. As World War I reaches East Africa, the colonists form a militia led by colonial patriarch Lord Delamere , which includes Denys and Bror. A military expedition searches for forces from the neighbor German colony of German East Africa . Responding to the militia's need for supplies, Karen leads a tiring and long expedition to find them and returns safely. Karen contracts syphilis from Bror, returns to Denmark for treatment and recuperation while Bror manages the farm in her absence. Bror resumes his safari work upon Karen's return. They live separately after she discovers that he is still a philanderer. A relationship between Karen and Denys develops following an ambivalent kiss at a New Year's party, with their ultimately moving in with her in between his travels. Denys acquires a Gipsy Moth biplane and often takes Karen flying. After Bror expresses his desire to divorce and marry another rich woman, Karen asks Denys to solidify their relationship, but he prefers his autonomy and the status quo. When Karen learns Denys is taking Felicity on a private safari, she confronts him about his refusal to have monogamous relations. He assures Karen he only wants her, but feels marriage is immaterial. This eventually drives them apart. The farm eventually yields a good harvest, but a fire destroys it and the factory, forcing Karen to sell out. Before leaving Kenya for Denmark, she appeals to the incoming governor to provide land for her Kikuyu workers and sells most of her remaining possessions at a rummage sale . Denys visits the now-empty house. He says he no longer feels comfortable being alone and that his feelings for her have changed. He asks to join her on her journey back. Denys leaves for a safari scouting trip, promising to fly Karen to Mombasa when he returns. Shortly after, Bror arrives to inform Karen that Denys' plane has crashed in Tsavo . Karen organizes his funeral, during which she recites an excerpt from an A. E. Housman poem about a celebrated athlete who, like Denys, died young and was not destined to decline into old age. Before departing, Karen visits the Muthaiga Club to arrange for the forwarding of her mail. The members, having come to admire her, invite her into the men-only salon for a toast. Karen gives Farah a compass that Denys had given her and asks him to say her name so that she can hear his voice one last time. Sometime later, Farah writes to Karen, informing her that a pair of lions frequently visits Denys's grave. An epilogue reveals that Karen became an author, publishing her works under the name Isak Dinesen, and never returned to Africa.",
  "wiki": "https://en.wikipedia.org/wiki/Out_of_Africa_(film)"
}