{
  "year": "1986",
  "name": "Platoon",
  "plot": "In 1967, U.S. Army volunteer Chris Taylor arrives in South Vietnam and is assigned to an infantry platoon of the 25th Infantry Division near the Cambodian border. The platoon is commanded by the young and inexperienced Lieutenant Wolfe, who relies on two experienced non-commissioned officers: the cynical Staff Sergeant Barnes, and the more compassionate Sergeant Elias. Taylor participates in a night ambush of a North Vietnamese Army force. Taylor is wounded during the firefight while Gardner, another new replacement is killed due to his inexperience. Taylor returns to base from the aid station and bonds with Elias and his circle of marijuana users (\"heads\"), a clique distinct from Barnes and his hard-edged followers. During another patrol two soldiers are killed by a booby trap and Manny is abducted by unseen assailants who stage the corpse. The platoon finds the body and search a nearby village, finding a supply cache. Barnes aggressively interrogates the village chief and murders his wife in view of the villagers. When he also threatens to murder the chief's daughter, Elias intervenes and assaults Barnes. Wolfe breaks up the ensuing fight, orders the supplies destroyed and the village razed. Wolfe feigns ignorance when Elias accuses him of not stopping Barnes. Taylor prevents two girls from being gang-raped by some of Barnes' men but is remorsefully unable to prevent Bunny from murdering a villager. Company commander Captain Harris threatens to court-martial anyone found to have illegally killed civilians, and orders Barnes and Elias to put aside their differences. On their next patrol, the platoon is ambushed and pinned down. Wolfe directs artillery fire onto his own unit before Barnes calls it off. Barnes orders Elias, Taylor, Rhah and Crawford to intercept flanking enemy troops, pulls the rest of the platoon back, and goes out to retrieve Elias. When Elias is separated from the others, Barnes takes the opportunity to shoot him. During the helicopter extraction, he tells Taylor that Elias is dead, but as they fly out they see the mortally wounded Elias chased from the jungle by NVA soldiers and killed. Taylor attempts to talk the heads into fragging Barnes in retaliation, not realizing Barnes has overheard them. He enters the abandoned bunker they use for gathering, taunts them, and fights off an attack by Barnes, cutting Taylor's face with a push dagger . The platoon is sent back out to a defensive position. Taylor shares a foxhole with Francis. When a major NVA night assault occurs, much of the platoon is killed, including Wolfe and most of Barnes' followers. An NVA sapper destroys the battalion headquarters in a suicide attack forcing Captain Harris to call an air strike on their shrinking perimeter. In the chaos, Taylor encounters a seriously wounded Barnes, and as they grapple both are knocked unconscious by the air strike. When Taylor regains consciousness after sunrise, Barnes dares Taylor to kill him, and Taylor shoots him dead. Francis stabs himself in the leg, reminding Taylor that twice wounded men are returned home. As a helicopter carries the two men away, Taylor waves goodbye to Rhah. Command of the platoon is given to the cowardly Sgt. O'Neill. An overwhelmed Taylor sobs as he flies away from the battlefield, narrating how the war has changed him forever.",
  "wiki": "https://en.wikipedia.org/wiki/Platoon_(film)"
}