{
  "year": "1987",
  "name": "Fatal Attraction",
  "plot": "Dan Gallagher is a literary attorney from Manhattan . While his wife, Beth, and daughter, Ellen, are out of town visiting Beth's family, he has an affair with Alex Forrest, an editor for a publishing company who begins to cling to him. Dan reluctantly spends the following day with Alex, but when he ends their affair, she cuts her wrists. Dan helps her and leaves in the morning. Alex comes to Dan's office to apologize, but he declines her invitation to a performance of Madame Butterfly , her favorite opera. She continues to call him at his office until he informs his secretary that he will no longer take her calls. Alex insists that Dan meet her and tells him she is pregnant, arguing that he must take responsibility. After Dan changes their phone number, Alex meets Beth, who has advertised selling their apartment, pretending to be interested in buying it. That night, Dan goes to Alex's apartment to confront her and they get into a scuffle. After the Gallaghers move to Bedford , Alex sends a tape recording of herself delivered to him, which is full of verbal abuse. She stalks him, pours acid onto his car and follows him home later that evening. The sight of his happy family through their window makes her vomit. Dan approaches the police to file a restraining order , claiming it is for a client. The lieutenant informs him that he cannot violate Alex's rights without probable cause , and that the client must own up to his adultery. When the Gallaghers return home, they discover Alex has boiled Ellen's pet rabbit on their stove. Dan confesses the affair and Alex's pregnancy to Beth. Enraged, Beth orders him to leave. Dan calls Alex to say Beth knows about the affair. Beth takes the phone and tells Alex that she will kill her if Alex comes near their family again. Alex picks Ellen up from her school and kidnaps her, taking her to an amusement park. Beth drives around frantically looking for her and gets into an accident, requiring hospitalization. Alex returns Ellen home unharmed. After visiting Beth in the hospital, Dan forcibly enters Alex's apartment and attempts to strangle her, but stops short of killing her. She grabs a kitchen knife and lunges at him, but he disarms her and leaves. The police search for Alex after Dan reports the kidnapping. Beth forgives Dan, and they return home after Beth is discharged from the hospital. While Beth prepares to take a bath, Alex emerges and attacks her with a knife. Dan rushes upstairs, subdues Alex and appears to drown her in the bathtub, but she emerges swinging the knife. Beth shoots her dead. Dan completes his statement to the police and joins Beth in the living room.",
  "wiki": "https://en.wikipedia.org/wiki/Fatal_Attraction"
}