{
  "year": "1988",
  "name": "Working Girl",
  "plot": "Tess McGill is a working-class woman from Staten Island who dreams of climbing the corporate ladder to an executive position. Despite her holding a business degree earned through evening classes, her boss and male co-workers at the stockbroker firm in lower Manhattan where she works as a secretary treat her like a bimbo , even though they benefit from her intelligence and business instincts. After reaching her limit with her boss's humiliations, Tess dramatically quits. Tess then lands a job as an administrative assistant to Katharine Parker, an associate partner at mergers and acquisitions firm Petty Marsh. At first, Katharine seems supportive of Tess, encouraging her to share ideas, but eventually tells Tess her proposed purchase of a radio network by Trask Industries would not work out. When Katharine breaks her leg skiing, she asks Tess to house-sit. While there, Tess discovers meeting notes that reveal Katharine plans to pass off the Trask Industries idea as her own. She later returns home to find her live-in boyfriend having sex with another woman. He later attempts to reconcile and proposes marriage, but she responds ambivalently, and they end things. With her boss away, Tess decides to use Katharine's connections and clothes to move ahead with her proposal for Trask. With the help of her friend Cyn, Tess cuts her hair and borrows Katherine's stylish clothing to look more professional. Tess schedules a meeting with Jack Trainer, a mergers and acquisitions associate from another company. The night before, she attends on Katharine's behalf a dinner hosted by Trainer's firm, in an attempt to get to know him prior to their meeting. Trainer is attracted to and approaches Tess at the bar but does not reveal his name, even after she inquires whether he knows a Jack Trainer. Tess eventually leaves, and he follows, taking her back to his apartment after she passes out in a cab from a combination of Valium and alcohol. Tess leaves early the next morning, believing that they slept together, to attend her meeting with Trainer and is surprised to see he is the man from the previous night. They both feign non-recognition. Although Tess leaves the meeting with Trainer and his associates thinking it was a failure, Jack soon arrives at her office, telling her they did not sleep together and that he wants to move forward with her idea. Together, they prepare the financials for the merger proposal and present them to Trask. After the successful presentation, they give in to their attraction, ending up in bed. But when Tess is tempted to confess the truth about her position and the idea's origins, she demurs after discovering Jack has been involved with Katharine and planned to break up with her before her injury. Katharine returns home on the day of the merger meeting, and while Tess is helping her get settled, Katharine brings up the Trask merger, saying she was intending to take it to Jack and give Tess credit eventually. But she says Jack's strict ethical code prevents him from looking at another's ideas without verifying the source, after being accused of stealing himself. Jack arrives in response to a call from Katharine, who unsuccessfully tries to seduce him. Tess avoids running into Jack at Katharine's apartment but accidentally leaves her notebook there before departing for the meeting. Katharine finds the book, which includes Jack's phone numbers and the scheduled merger meeting, and discovers Tess's deception. At the meeting, Tess asks Jack whether he has such an ethical code, and he denies this or that he was ever accused of stealing. Katharine arrives and confronts Tess during the meeting, outing her as her secretary and accusing her of stealing the idea. Tess feels she cannot defend herself and leaves, apologizing profusely. A few days later, Tess return to Petty Marsh to clear out her desk and on the way out encounters Jack, Katharine, Trask and members of the team. Jack sticks up for Tess, who points out a news item that presents a possible risk to the merger's success. She explains to Trask how she came up with the idea for the radio acquisition. Trask then confronts Katharine, who is unable to explain where she got the idea, and promises to have her fired for her actions. Trask offers Tess an entry-level job with Trask Industries, and she moves in with Jack. On her first day at Trask, Tess meets a colleague named Alice, who she initially assumes will be her boss but finds is actually her own secretary. Tess insists they work together as colleagues, showing she will be very different from Katharine. Finally, Tess calls her friend Cyn from her own office to tell her that she has made it.",
  "wiki": "https://en.wikipedia.org/wiki/Working_Girl"
}