{
  "year": "1988",
  "name": "The Accidental Tourist",
  "plot": "Macon Leary is a Baltimore writer of travel guides that detail how reluctant business travelers can best avoid unpleasantness and difficulty. His marriage to his wife Sarah is disintegrating in the aftermath of the tragic death of their 12-year-old son, Ethan. Macon is leveraging the philosophy he espouses in his travel guides to keep control of himself, his grief, and his life, and this excessive control is becoming increasingly dysfunctional. Sarah eventually leaves Macon, moving out of their house and into an apartment, leaving him with the house and the family dog, Edward. Macon meets Muriel Pritchett, an eccentric animal hospital employee and dog trainer with a sickly son named Alexander. Macon eventually hires Muriel to put his dog through much-needed obedience training after Edward causes Macon to fall down the stairs and break his leg. Muriel is quite forward in her interest in Macon, which acts as a counterforce to his stiff personality. Although Muriel at first seems brash and unsophisticated, Macon eventually finds himself opening up to her and trusting her. Over time, he moves into her apartment and becomes a father figure to Alexander. Some conflict arises between Muriel and Macon when he offers to help with private school costs. Muriel wants more commitment to the relationship and fears another disappointment. When Sarah's apartment lease is up, she moves back into their old home and suggests to Macon that they start over. Macon leaves Muriel, and he and Sarah set up house once more. When Macon travels to Paris for research, and to his surprise, Muriel appears on the same flight and stays at the same hotel he recommended in one of his travel guides. Muriel suggests they pretend to be on a vacation together, but Macon maintains a professional stance, emphasizing his business purpose. Despite his aloofness, he shows concern for Alexander. On Macon's last night in Paris, Muriel asks to accompany him, giving him time to decide. Later, Macon, experiencing back pain from a phone cord accident, is bedridden. Muriel, assuming he left, departs. Macon contacts his publisher, Sarah, who comes to assist him. Sarah proposes turning their trip into a second honeymoon after his work is done, and Macon agrees half-heartedly. Sarah, however, questions his feelings for Muriel, hinting at unresolved issues related to their son. Macon realizes their marriage is strained without their son and decides to seek Muriel's help to move past his grief. He leaves for Muriel, explaining his need for her support. As he departs, he leaves his bag behind, symbolizing letting go. A boy resembling Ethan helps him with a taxi, representing a new beginning. Macon sees Muriel hailing a taxi and stops his own. She smiles at him, and he smiles back, indicating a potential new connection.",
  "wiki": "https://en.wikipedia.org/wiki/The_Accidental_Tourist_(film)"
}