{
  "year": "1989",
  "name": "Driving Miss Daisy",
  "plot": "In 1948, Miss Daisy Werthan, a 72-year-old wealthy, Jewish , widowed, retired schoolteacher, lives alone in Atlanta, Georgia , except for a black housekeeper, Idella, who comes in daily. When Daisy accidentally drives her 1946 Chrysler Windsor into her neighbor's yard, her 40-year-old son, Boolie, buys her a Hudson Commodore and hires 60-year-old Hoke Colburn, a black chauffeur, as Daisy can no longer drive due to her being a high insurance risk. Boolie tells Hoke that Daisy may not appreciate his efforts, but she cannot fire him, because Boolie is his employer. At first, Daisy refuses to let anyone drive her, but Hoke's patience pays off, and she reluctantly accepts the first two trips; one to the Piggly Wiggly supermarket, the other to her synagogue . Then she tries to get Boolie to fire Hoke after she had discovered a can of salmon missing from her pantry which she believes Hoke had stolen the previous day. However, the following morning when arriving for work, and without knowing that Miss Daisy had even noticed the missing can, Hoke tells her that he has brought a replacement can because he had eaten the salmon himself the previous evening because the leftovers she had provided for his dinner were inedible. As Daisy and Hoke spend time together, she comes to appreciate his many skills.  She teaches him to read using her teaching skills and resources. After Idella dies in the spring of 1963, rather than hire a new housekeeper, Daisy decides to care for her own house and have Hoke do the cooking and the driving. Meanwhile, Hoke buys the cars in which he drives Miss Daisy, after they are traded in for newer models, and he negotiates a higher salary with Boolie. The film explores racism against African Americans and antisemitism in the South. After her synagogue is bombed , Daisy realizes that she is also a victim of prejudice. American society is undergoing radical changes, and Miss Daisy attends a dinner at which Dr. Martin Luther King Jr. gives a speech. Boolie declines when she invites him to the dinner, and suggests that she invite Hoke. She waits until the last moment, and even then only raises it with Hoke in the car on the way to the event, saying that Boolie had said that Hoke wanted to attend. Hoke says he had said no such thing, and tells Miss Daisy that she should have just asked him directly if she had thought he might like to attend. She attends the dinner alone while Hoke listens to the speech on the car radio. She is struck by King's words in his speech, when he says that \"the greatest tragedy was not the vitriolic words and the violent actions of the bad people, but the appalling silence and indifference of the good people.\" One morning in 1971, Hoke arrives at the house to find Daisy agitated and showing signs of dementia : she believes that she is a young teacher again. Hoke calms her down. In that conversation, she calls Hoke her \"best friend\". Boolie arranges for Daisy to enter a retirement home. In 1973, Hoke, now 85 and rapidly losing his eyesight, retires. Boolie, now 65, drives Hoke to the retirement home to visit Daisy, now 97. [ 7 ] The two catch up, and Hoke gently feeds her Thanksgiving pie. The final scene is an image of the black Cadillac driving on a road.",
  "wiki": "https://en.wikipedia.org/wiki/Driving_Miss_Daisy"
}