{
  "year": "1990",
  "name": "Awakenings",
  "plot": "In 1969, Dr. Malcolm Sayer is a dedicated and caring physician at a local hospital in the New York City borough of the Bronx . After working extensively with the catatonic patients who survived the 1919–1930 epidemic of encephalitis lethargica , Sayer discovers stimuli that will \"awaken\" the patients from their respective catatonic states. Actions such as catching a ball, hearing familiar music, being called by their name, and enjoying human touch each have unique effects on particular patients and offer a glimpse into their worlds. Patient Leonard Lowe seems to remain unmoved, but Dr. Sayer learns that Leonard is able to communicate with him by using a Ouija board. After attending a lecture at a conference on the drug L -DOPA and its success for patients with Parkinson's disease , Sayer believes that the drug may offer a breakthrough for his own group of patients. A trial run with Leonard yields astounding results; Leonard completely \"awakens\" from his catatonic state. This success inspires Sayer to ask for funding from donors, so that all the catatonic patients can receive the L -DOPA medication and gain \"awakenings\" to reality and the present. Meanwhile, Leonard is adjusting to his new life and becomes romantically interested in Paula, the daughter of another hospital patient. Leonard begins to chafe at the restrictions placed on him as a patient of the hospital, desiring the freedom to come and go as he pleases. He stirs a revolt by arguing his case to Sayer and the hospital administration. As Leonard becomes more agitated, Sayer notices that a number of facial and body tics begin to manifest , which Leonard has difficulty controlling. Although Dr. Sayer and the hospital staff are initially overjoyed by the success of L-DOPA in reviving a group of catatonic patients, they soon realize that the effects are only temporary. Leonard, the first to \"awaken\", is also the first to show signs of decline. His tics gradually worsen, his walk becomes a shuffle, and he begins to experience full-body spasms that severely limit his movement. Despite the pain, Leonard remains resolute. He asks Dr. Sayer to film him, hoping that his experience may one day contribute to research that helps others. Aware of his deteriorating condition, Leonard shares a final lunch with Paula. He tells her that he can no longer see her, but before parting ways, she invites him to dance. While they dance, Leonard's spasms cease for a brief, calming moment. Although Leonard and Sayer reconcile, Leonard soon returns to a catatonic state. One by one, the other patients follow, despite increasing doses of L-DOPA. Dr. Sayer speaks to a group of hospital donors, explaining that while the physical awakenings were fleeting, a deeper awakening had occurred, with most a renewed sense of appreciation for life. Sayer also grows from the experience, finally overcoming his intense shyness to ask Nurse Eleanor Costello for coffee. The staff now treats the patients with greater empathy and dignity, and Paula continues to visit Leonard. Although Leonard is again unresponsive, he and Sayer maintain their connection through the Ouija board, a quiet testament to the enduring human spirit.",
  "wiki": "https://en.wikipedia.org/wiki/Awakenings"
}