{
  "year": "1990",
  "name": "Dances With Wolves",
  "plot": "In 1863, 1st Lieutenant John J. Dunbar—serving with the Union army —is wounded in a stalemated battle at St. David's Field in Tennessee . The surgeon intends to amputate his leg. Choosing death in battle instead, Dunbar steals a horse and rides in front of Confederate lines unarmed, but miraculously survives his suicide attempt. Union troops take advantage of the distraction to mount a successful attack. Dunbar is given medical care that saves his leg and is awarded \"Cisco\", the horse he rode during his suicide attempt, along with his choice of posting. He requests a transfer to the American frontier to see it before it disappears. Dunbar arrives at Fort Hays where its commander, Major Fambrough, assigns him to the furthest outpost under his jurisdiction: Fort Sedgwick . Fambrough, who is mentally ill, kills himself after Dunbar departs. Dunbar travels with Timmons, a foul-mouthed mule-wagon provisioner, and finds the fort deserted. He decides to rebuild the fort, recording his observations in his diary. Timmons is killed by a band of Pawnee while returning to Fort Hays. The deaths of Timmons and Fambrough leave the army unaware of Dunbar's assignment, so no other soldiers arrive to reinforce the post. Dunbar encounters his Sioux neighbors when they attempt to steal his horse and intimidate him. Wanting to make peace, he seeks out the Sioux camp. En route, he comes across Stands With A Fist, a white ethnic Sioux woman who was adopted as a girl by the tribe's medicine man, Kicking Bird, after Pawnee killed her family. She is mutilating herself in mourning for her late Sioux husband. Dunbar brings her back to the Sioux to recover. Though the Sioux are initially hostile, Dunbar gradually establishes a rapport with them, notably Kicking Bird, the Sioux fighter Wind In His Hair, and the youth Smiles A Lot. Stands With A Fist acts as an interpreter, speaking Lakota and English. Dunbar comes to respect and appreciate the Sioux. He is accepted into their group after he tells them of a migrating herd of buffalo and participates in the hunt. He also befriends a wolf he dubs \"Two Socks\" for his white forepaws. Observing Dunbar and Two Socks chasing each other, he is given a name that translates as Dances With Wolves. Dunbar learns the Lakota language , and he and Stands With A Fist grow close. He gives the Sioux firearms to help them defend against the Pawnee attack. He eventually earns Kicking Bird's approval to marry Stands With A Fist. Because of the threat of encroaching white settlers, Chief Ten Bears decides to move his group to its winter camp. Dunbar decides to accompany them but first attempts to retrieve his diary from Fort Sedgwick, as it would help the U.S. Army locate the group at its new location. When he arrives, he finds the fort reoccupied by the army. Because of his Sioux clothing, the soldiers open fire, killing Cisco, and capture Dunbar. He cannot prove his story as one of the soldiers had stolen his diary. Refusing to help the army hunt down the Sioux, he is charged with desertion, and the soldiers begin to transport him back east as a prisoner. Two Socks attempts to follow Dunbar but is shot dead by the soldiers. Dunbar's Sioux friends track and attack the convoy, killing the soldiers and freeing Dunbar. They meet the others at the winter camp. Dunbar leaves with Stands With A Fist because his presence would endanger the group. As they leave, Dunbar and Kicking Bird exchange parting gifts. Smiles A Lot returns the diary he recovered during Dunbar's rescue, and Wind In His Hair proclaims his everlasting friendship to Dunbar. U.S. troops search the mountains but cannot locate Dunbar or the Sioux. The film's epilogue text states that the last of the free Sioux would surrender at Fort Robinson , Nebraska , 13 years later.",
  "wiki": "https://en.wikipedia.org/wiki/Dances_With_Wolves"
}