{
  "year": "1991",
  "name": "The Silence of the Lambs",
  "plot": "Clarice Starling , a young FBI trainee at the Quantico Academy , is recruited by Behavioral Science Unit chief Jack Crawford to interview Dr. Hannibal Lecter , a brilliant and cannibalistic psychiatrist imprisoned at the Baltimore State Hospital for the Criminally Insane. Under the guise of soliciting his participation in a psychological survey, Crawford secretly aims to leverage Lecter's insights to apprehend \" Buffalo Bill \", a serial killer who murders young women and removes their skin. At the hospital, Dr. Frederick Chilton , the facility's manipulative director, makes unwelcome advances toward Starling before escorting her to Lecter's cell. Initially courteous, Lecter grows dismissive upon deducing Crawford's ulterior motive. As Starling departs, inmate Miggs flings semen at her, provoking Lecter's disgust. He summons her back and offers a clue as an anagram that leads her to a storage unit containing a severed head in a jar—later revealed to belong to Benjamin Raspail, a former patient of Lecter's and whose killer is believed to be Buffalo Bill. Soon afterward, Miggs is found dead in his cell, having swallowed his own tongue—an act implicitly orchestrated by Lecter as retribution for his assault on Starling. Lecter agrees to assist the investigation in exchange for a transfer away from Chilton. Meanwhile, another victim is discovered with a death's-head moth lodged in her throat—the same species later found inside the severed head. When Buffalo Bill abducts Catherine Martin, daughter of U.S. Senator Ruth Martin, Crawford authorizes Starling to offer Lecter a fraudulent deal: a prison transfer in return for actionable intelligence. Lecter instead demands a quid pro quo , extracting personal details from Starling. She reveals that her father, a police officer, was murdered when she was ten, leaving her orphaned. In exchange, Lecter reveals that Buffalo Bill is not a genuine transsexual but mistakenly believes that he is, possibly having been rejected from gender-reassignment clinics due to psychological instability. Unbeknownst to Starling, Chilton records the conversation and later exposes her deceit, offering Lecter a new arrangement: relocation to Tennessee in exchange for information. Lecter complies and is flown to Memphis , where he provides Senator Martin with accurate details about Buffalo Bill's appearance but falsely identifies him as \"Louis Friend\". Starling deciphers \"Louis Friend\" as an anagram for \" iron sulfide \" (fool's gold) and confronts Lecter in his temporary cell at a Memphis courthouse. Lecter demands deeper revelations, offering a final cryptic clue—\"we covet what we see every day\"—before Starling, compelled by his probing, recounts a traumatic childhood incident: after her father's death, she lived on a relative's Montana farm, where she failed to save spring lambs from slaughter. Lecter intuits that saving Catherine might silence this trauma and, satisfied, returns the Buffalo Bill case files. That night, Lecter orchestrates a gruesome escape by using a piece of Chilton's pen to unlock his restraints and murder his two guards. He later peels the face off one of the guards and wears it as a disguise, fooling paramedics into wheeling him out of the building. Analyzing Lecter's annotations, Starling deduces that Buffalo Bill knew his first victim, Frederika Bimmel, a tailor from Ohio , and independently follows the lead. At Bimmel's home, she finds unfinished dresses and patterns matching patches of skin removed from the victims, realizing that Bill seeks to construct a \"suit\" from human flesh and that he starves his captives to loosen their skin. Crawford cross-references Lecter's profile with records from sex-reassignment clinics and offender databases to identify Jame Gumb as the prime suspect. While Crawford's team raids Gumb's vacant Illinois residence, Starling interviews Bimmel's acquaintances, arriving at a house where Gumb poses as \"Jack Gordon\". His façade crumbles when Starling spots a death's-head moth. Pursuing Gumb into his basement, Starling discovers Catherine trapped in a dry well. Gumb stalks her using night-vision goggles but betrays his position by cocking his revolver. Starling fires blindly, killing him. Catherine is rescued, and Starling graduates from the FBI Academy. During her graduation celebration, Lecter calls from an unnamed tropical location, asking Starling if \"the lambs have stopped screaming.\" He assures her he has no intention of pursuing her, requesting that she return the favor—a vow she declines. He announces he's \"having an old friend for dinner\" before trailing Chilton into a crowd.",
  "wiki": "https://en.wikipedia.org/wiki/The_Silence_of_the_Lambs_(film)"
}