{
  "year": "1992",
  "name": "A Few Good Men",
  "plot": "At the Guantanamo Bay Naval Base in Cuba , Private William Santiago, a United States Marine , is tied up and beaten in the middle of the night. After he is found dead, Lance Corporal Harold Dawson and Private First Class Louden Downey are accused of his murder and face a court-martial . Their defense is assigned to United States Navy JAG Corps Lieutenant Daniel Kaffee, a callow lawyer with an impressive and expedient track record  for plea bargains and without any court experience. Another JAG attorney, Lieutenant Commander Joanne Galloway, Kaffee's superior, suspects something is amiss. Santiago died after he broke the chain of command to ask to be transferred away. Lieutenant Colonel Matthew Markinson advocated for Santiago to be transferred, but Base Commander Colonel Nathan Jessep ordered Santiago's platoon commander, Lieutenant Jonathan Kendrick, to \"train\" Santiago on the basis they are all at fault for Santiago's substandard performance. Galloway suspects that Dawson and Downey carried out a \"code red\" order: a violent extrajudicial punishment . Galloway is bothered by Kaffee's blasé approach, and Kaffee resents Galloway's interference. Kaffee and Galloway question Jessep and others at Guantanamo Bay and are met with contempt from the colonel. Kaffee negotiates a plea bargain with the prosecutor, US Marine Judge Advocate Captain Jack Ross for involuntary manslaughter with a sentence of two years but serving only six months—avoiding a possible lifetime sentence if found guilty at trial. Dawson and Downey refuse the plea bargain, insisting that Kendrick gave them the \"code red\" order, they never intended to kill Santiago, and a plea bargain would be dishonorable. Initially intending to get removed as counsel, at the arraignment, Kaffee unexpectedly pleads not guilty for the defendants. Realizing that he was chosen to handle the case to accept a plea to keep the matter quiet, he decides to put up a defense. Markinson meets Kaffee in secret and says that Jessep never ordered a transfer for Santiago. The defense establishes that Dawson had received a negative performance review from Kendrick and had been denied promotion for smuggling food to a Marine who had been restricted to water and vitamins. Dawson had been punished for disobeying an illegal order, and the defense, through Downey, proves that illegal \"code reds\" had been ordered before. However, under cross-examination, Downey admits he was not present when Dawson received the supposed \"code red\" order. Ashamed that he failed to protect a Marine under his command and unwilling to testify against Jessep, his longtime friend, Markinson commits suicide before he can testify. Without Markinson's testimony, Kaffee believes the case lost. He returns home in a drunken stupor, lamenting that he fought the case, risking long sentences for Dawson and Downey, instead of accepting a lenient deal. Galloway encourages Kaffee to call Jessep as a witness, despite risking court-martial for challenging a high-ranking officer without evidence. At the Washington Navy Yard court, Jessep spars with Kaffee's questioning, but is unnerved when Kaffee―springing a trap―points out a contradiction in his testimony that Guantanamo marines would never disobey an order to \"not touch Santiago\" yet he ordered Santiago off the base fearing for Santiago's safety. Kaffee also questions Jessep's claim that Santiago was to be put on the first flight home. Upon further questioning, and frustrated by Kaffee's attitude, Jessep extols the military's, and his own, importance to national security, exclaiming \"You can't handle the truth!\" Challenging Jessep's indignation, Kaffee pointedly asks if Jessep ordered the \"code red\", to which Jessep bellows \"You're goddamn right I did!\" Jessep tries leaving the courtroom, but he's arrested before he can do so, and attempts to assault Kaffee. He's restrained and subsequently leaves. Dawson and Downey are cleared of the murder and conspiracy charges but found guilty of \" conduct unbecoming \" and will be dishonorably discharged . Downey does not understand what they did wrong; Dawson says that they failed to defend those too weak to fight for themselves. Kaffee tells Dawson that it is not necessary to wear a patch on one's arm to have honor. Dawson acknowledges Kaffee as an officer by rendering a salute. Kaffee and Ross exchange pleasantries before Ross departs to arrest Kendrick.",
  "wiki": "https://en.wikipedia.org/wiki/A_Few_Good_Men"
}