{
  "year": "1992",
  "name": "Scent of a Woman",
  "plot": "Charlie Simms is a scholarship student at Baird, an exclusive New England preparatory school . Karen hires him to watch her uncle, retired Army Lieutenant Colonel Frank Slade, during Thanksgiving weekend. Charlie accepts so he can buy a plane ticket home to Gresham , Oregon, for Christmas . He meets Frank, a highly decorated, blind Vietnam War veteran who has become a cantankerous and cynical alcoholic. Charlie and student George Willis Jr. witness three classmates set up a prank to damage the headmaster, Mr. Trask's sports car and humiliate him. Afterward, Trask learns of the witnesses, and unsuccessfully presses them to name the perpetrators. He privately offers Charlie virtually guaranteed acceptance to Harvard University if he informs on the other students. Trask schedules a meeting of the school disciplinary committee to take place on the Monday after the Thanksgiving weekend. Frank Slade unexpectedly takes Charlie on a trip to NYC and arranges their stay at the Waldorf-Astoria hotel . During dinner in the Oak Room at the Plaza Hotel, Frank reveals that the goals of his trip are to stay at a luxurious hotel, enjoy good food and wine, visit his older brother, and have sex with a \"terrific\" woman. Afterward, he intends to die by suicide. On Thanksgiving Day , they visit Frank's brother at his home in White Plains . Frank provokes everyone at dinner, which ends up in a confrontation with his nephew Randy, who reveals that Frank was not blinded heroically in combat, but in an accident that occurred when he drunkenly juggled live grenades to show off for a group of younger officers. Frank assaults Randy for repeatedly calling Charlie \"Chuck\", a name Charlie despises, revealing his growing affection for Charlie. As they return to NYC, Charlie mentions his problem at school. Frank advises he turn informant, warning that George will probably submit to Trask's pressure, so he should act first so he can attend Harvard. While at a restaurant, Frank identifies the scent of a young woman waiting for her date. He introduces himself and offers to teach her the tango . The evening ends with Frank having sex with a high-class escort , completing the stated objectives of his trip. Despondent the next morning, Frank is uninterested in any suggestions for the day until Charlie suggests going for a ride. Frank talks a Ferrari salesman into letting them take a convertible for a test ride. When on the road, Frank becomes depressed again until Charlie allows him to drive. When they are pulled over by a policeman, Frank convinces the officer to let them go without revealing that he is blind. After returning the car, Frank again becomes despondent. He jaywalks into rushing traffic on Park Avenue and narrowly escapes being struck by multiple cars. When they return to the hotel, Frank sends Charlie to buy cigars. Charlie leaves but becomes suspicious and returns to find Frank donning his dress uniform, preparing to end his life with his service pistol. Frank backs down after Charlie convinces him that he has much to live for and should courageously face his circumstances. On Monday morning, Charlie and George appear before the Baird disciplinary committee with the whole student body in attendance. Frank unexpectedly arrives and sits with Charlie. George Jr. provides tentative identifications but claims he was not wearing his contact lenses, so he cannot be positive. Charlie refuses to confirm George Jr.'s identification, so Trask recommends his expulsion. Frank gives a speech defending Charlie, denounces Baird for not living up to its own standards, and urges the committee to value Charlie's integrity. The disciplinary committee places the instigators on probation, denies George credit for naming them, and excuses Charlie from the proceedings. As Charlie escorts Frank to his limousine, political science professor Christine Downes, a member of the disciplinary committee, commends Frank for his speech. He flirts with her, impressing her by recognising her perfume. Charlie accompanies Frank home, where Frank happily greets his niece's children.",
  "wiki": "https://en.wikipedia.org/wiki/Scent_of_a_Woman_(1992_film)"
}