{
  "year": "1992",
  "name": "The Crying Game",
  "plot": "At a rural Northern Irish fairground, a Provisional IRA volunteer named Fergus and a unit of other IRA members, led by Peter Maguire, kidnap a Black British soldier named Jody after a female member of their unit, Jude, lures Jody to a secluded area by promising sex . The unit intends to hold Jody until an imprisoned IRA member is released, and if their demands are not met within three days, he will be executed. As Fergus stands guard over Jody, the two begin to bond, and Jody shares the fable of the Scorpion and the Frog with him. Aware that he may not survive, Jody asks Fergus to promise to find his girlfriend Dil and check on her well-being. When the captors' deadline passes without their demands being met, Fergus is ordered to take Jody into the woods to kill him. However, instead of shooting him, Fergus chases Jody when he attempts to escape. As Jody flees, he runs into the road and is struck and killed by a British armoured personnel carrier . The British army attacks the IRA unit, and Fergus manages to escape, believing his companions have perished in the attack. He flees to London, assuming the alias \"Jimmy\" and finding work as a day labourer. A few months later, Fergus finds Dil at a hair salon, where Jody had told him that Dil works as a stylist. He follows her to a bar, and they flirt using the barman, Col, as an intermediary. They develop a relationship, and in time Fergus falls in love with her. Later, Fergus and Dil are about to become intimate. Dil undresses, and Fergus sees Dil's male genitalia. [ a ] Fergus, initially repulsed, hits Dil in the face and leaves her apartment. After some reflection, he apologizes to Dil in a note, and they reconcile. Around the same time, Jude reappears and coerces Fergus into helping with an assassination plot against a British judge, using the threat of harm to Dil to ensure his cooperation. Fergus continues to woo Dil, disguising her as a boy in Jody's old cricket uniform to protect her. The night before the IRA mission, Dil gets drunk and Fergus stays with her. He confesses his role in Jody's death, but an intoxicated Dil appears not to fully comprehend his words. In the morning, Dil restrains Fergus with stockings, preventing him from completing the assassination. An angry Maguire manages to shoot the judge, but is shot and killed by the judge's bodyguards. Jude, seeking revenge, enters Dil's flat with a gun. Dil manages to overpower Jude and shoots her dead after learning of her involvement in Jody's death. Dil then points the gun at Fergus, but spares him, stating that Jody would not want her to kill him. Fergus prevents Dil from killing herself and allows her to escape. He wipes her fingerprints from the gun and takes the blame for Jude's murder. Months later, Dil visits Fergus in prison and asks why he took the fall for her. He responds, \"As a man once said, it's in my nature,\" and begins to recount the story of the Scorpion and the Frog.",
  "wiki": "https://en.wikipedia.org/wiki/The_Crying_Game"
}