{
  "year": "1993",
  "name": "The Fugitive",
  "plot": "In Chicago , vascular surgeon Dr. Richard Kimble is arrested for the murder of his wife, Helen. Despite his insisting he caught a man with a prosthetic arm in the act, the lack of forced entry into the house, Helen's misinterpreted 911 call, and a substantial life insurance policy all serve as evidence against Kimble, resulting him being convicted of her murder and sentenced to death. En route to prison, Kimble's fellow prisoners stage an escape. In the chaos, the driver is shot dead and their bus crashes into the path of an oncoming train. Kimble risks his life to pull a wounded officer to safety before fleeing the resulting wreck. In response, relentless and uncompromising Deputy US Marshal Samuel Gerard and his staff arrive at the scene and launch a manhunt. Meanwhile, Kimble sneaks into a hospital to treat his injuries and disguises his appearance. The wounded officer is brought to the hospital and recognizes Kimble, who escapes with an ambulance. The marshals block Kimble's path, so he slips into a storm drain, pursued by Gerard. Kimble asserts his innocence, but Gerard responds that he does not care. Cornered at the end of a steep dam spillway , Kimble makes the dangerous jump into the waters below to escape. Driven to find his wife's killer, Kimble returns to Chicago and acquires some cash from his friend, Dr. Charles Nichols. Posing as a janitor, Kimble infiltrates the prosthetics department of Cook County Hospital to identify patients who required recent prosthetic adjustments. Afterwards, Kimble is asked to move a young patient on a gurney. Noticing he has been misdiagnosed, he changes the boy's file, saving his life. A doctor notices his interference and alerts security, forcing him to flee. Gerard investigates the incident and, after deducing Kimble is searching for his \"one-armed man\", also compiles a list of suspects. Gerard and Kimble encounter each other at Chicago City Hall , while approaching the same suspect, but Gerard loses Kimble in the St. Patrick's Day parade crowds. Later, Kimble breaks into the home of another suspect, Fredrick Sykes. Recognizing Sykes as his wife's killer, he discovers evidence linking Sykes to his former colleague, Dr. Alec Lentz, and Devlin-MacGregor, a multibillion-dollar pharmaceutical company developing a drug called Provasic. Kimble had reviewed Provasic and discovered it causes liver damage, which should have prevented the drug being approved for sale. He calls Gerard from Sykes's home to lead him there. Suspicious at what he finds, Gerard puts Sykes under surveillance, but he sneaks away. Kimble realizes that the Provasic-afflicted liver samples he sent to Lentz were tampered with, to hide the side effects. They were then approved in Lentz's name, on the same day that he died under suspicious circumstances. Kimble deduces that Nichols, Lentz's boss, was responsible for both. Aboard a train to the medical conference in the hotel where Nichols will unveil Provasic, Kimble is attacked by Sykes, who ends up shooting an intervening police officer dead. Kimble subdues Sykes, then handcuffs him to the train. The police assume Kimble killed the officer and order him shot on sight. At the conference, Kimble publicly confronts Nichols for killing Lentz and concealing Provasic's side effects for profit and a directorship at Devlin-MacGregor. The men fight through the hotel, across the roof, and into the laundry room, pursued by Gerard. Kimble accuses Nichols of sending Sykes to kill him for opposing Provasic, inadvertently resulting in Helen's murder when she came home alone after Kimble was unexpectedly called in for surgery. Gerard calls out to Kimble, asserting his belief in his innocence after finding evidence of Nichols's guilt. Nichols knocks out Gerard's colleague, takes his gun, and readies to shoot Gerard, but Kimble saves him by knocking Nichols out with a pipe. Kimble surrenders, and Sykes and Nichols are arrested. While reporters query the police over failings in the case, Kimble is escorted to Gerard's car, where he reminds him of his earlier claim that he did not care. Gerard wryly asks him to keep it a secret that he does as they are driven away.",
  "wiki": "https://en.wikipedia.org/wiki/The_Fugitive_(1993_film)"
}