{
  "year": "1993",
  "name": "The Remains of the Day",
  "plot": "In 1958 postwar Britain , Stevens, the butler of Darlington Hall, receives a letter from the former housekeeper, Miss Kenton, now Mrs. Benn. Their past employer, the Earl of Darlington , has died a broken man, his reputation destroyed by his pre–Second World War support of Nazi Germany, and his stately country house has been sold to retired US Congressman Jack Lewis. Allowed to borrow the Daimler , Stevens sets off for the West Country to see Miss Kenton for the first time in decades. In the 1930s, Kenton arrives at Darlington Hall, where the ever-efficient but deeply repressed Stevens derives his entire identity from his profession. He butts heads with the warmer, strong-willed Kenton, particularly when he refuses to acknowledge that his father, now an under-butler, is no longer able to perform his duties. Displaying total professionalism, Stevens carries on as his father lies dying during Darlington's conference of like-minded fascist -sympathising British and European aristocrats. Also in attendance is U.S. Congressman Lewis, who admonishes the \"gentleman politicians\" as meddling amateurs, advising that \"Europe has become the arena of Realpolitik \" and warning of impending disaster. Exposed to Nazi racial laws , Darlington gets Stevens to dismiss two newly hired refugee German-Jewish maids. Kenton threatens to resign but has nowhere to go, and a regretful Darlington is later unable to rehire the maids. At another conference, Stevens is unable to answer an aristocratic guest's questions on global trade and politics, which the aristocrat claims demonstrates the lower classes' ignorance and inability to govern themselves. Relations thaw between Stevens and Kenton, and she clearly shows her feelings for him. But the outwardly detached Stevens remains dedicated solely to his role as butler. She catches him reading a romance novel, which he explains is to improve his vocabulary, asking her not to invade his privacy again. Lord Darlington's godson, journalist Reginald Cardinal, arrives on the day of a secret meeting at Darlington Hall between the British Prime Minister, Neville Chamberlain , and the German ambassador, Joachim von Ribbentrop . Appalled by his godfather's role in seeking appeasement for Nazi Germany , Cardinal tells Stevens that Darlington is being used by the Nazis , but Stevens feels it is not his place to judge his employer. Kenton forms a relationship with former co-worker Tom Benn and accepts his proposal of marriage. She informs Stevens as an ultimatum, but he will not admit his feelings and only offers his congratulations. Finding her crying, his only response is to call her attention to a neglected domestic task, and she leaves Darlington Hall before the start of the Second World War . En route to meeting Kenton in 1958, Stevens is mistaken for a gentleman at a pub. Doctor Carlisle, a local GP, helps him refuel the Daimler, deduces that he is actually a manservant, and asks his thoughts about Lord Darlington's actions. Initially denying having even met him, Stevens later admits to having served and respected him, noting that Darlington later confessed that his Nazi sympathies had been misguided and naive. Stevens tells Carlisle that, although Lord Darlington was unable to correct his error, he is attempting to correct his own. Stevens meets Kenton, who has separated from her husband and is staying at a boarding house on the coast. She and Stevens discuss how Lord Darlington died from a broken heart after suing a newspaper for libel, losing the suit and his reputation. Stevens mentions that Cardinal was killed in the war. Kenton declines to resume her position at Darlington Hall, wishing to remain near her pregnant daughter and, despite years of unhappiness, thinking about going back to her husband. Stevens supposes they may never meet again, and they part fondly but are both quietly upset, with Kenton visibly tearful as her bus pulls away. Stevens returns to Darlington Hall, where Lewis asks if he remembers what he had said at the conference in the 30s. Stevens replies that he was too busy serving to listen to the speeches. A pigeon flies into the fireplace from the chimney, and Lewis catches and sets it free. Stevens watches the bird as it flies away, leaving Darlington Hall far behind.",
  "wiki": "https://en.wikipedia.org/wiki/The_Remains_of_the_Day_(film)"
}