{
  "year": "1994",
  "name": "Four Weddings and a Funeral",
  "plot": "At the wedding of Angus and Laura in Somerset , the perpetually late best man Charles, his flatmate Scarlett, his aristocratic friend Fiona and her brother Tom, Gareth and his partner Matthew, and Charles's deaf brother David, all gather. All are unmarried. At the reception, Charles meets Carrie, an American woman working in England. They spend the night together. In the morning, Carrie, who is returning to the U.S., laments that they may have, \"missed a great opportunity\". Three months later, at the London wedding of Bernard and Lydia, Tom is the best man. At the reception, Charles runs into Carrie, who has returned to the UK. With Carrie is Hamish, her older, wealthy Scottish fiancé. Meanwhile, a pretty young woman, Serena, is attracted to David. During the reception, Charles is humiliated by several ex-girlfriends, including the distraught Henrietta, who claims Charles is a \" serial monogamist \" fearful of commitment. Charles retreats to an empty hotel suite and notices Carrie and Hamish departing by taxi, though Carrie returns to the reception shortly after; she and Charles spend a second night together. A month later, Charles receives an invitation to Carrie and Hamish's wedding. Charles runs into Carrie while searching for a wedding gift. He then helps Carrie choose a wedding dress. After, Charles awkwardly confesses he loves her, which Carrie gently rebuffs. A month later, Charles and his friends attend Carrie and Hamish's wedding. Scarlett meets Chester, a Texan, at the reception. Henrietta introduces her new boyfriend to Charles. Fiona, aware of Charles's unhappiness over Carrie, admits she loves him. Charles, though sympathetic, does not reciprocate her feelings. During Hamish's speech, Gareth suffers a fatal heart attack. At Gareth's funeral, Carrie and Charles share a brief moment, while Charles and Tom then ponder that, despite their clique's pride in being single, Gareth and Matthew were like a \"married\" couple. They wonder whether seeking \"one true love\" is futile. Ten months later, it is Charles and Henrietta's wedding. While seating guests, Tom meets his distant cousin, Deirdre, whom he has not seen since childhood; they are immediately smitten with each other. Scarlett and Chester are overjoyed to meet again. Carrie arrives and tells Charles that she and Hamish have separated following a difficult marriage. Charles has an emotional crisis inside the church's back room. After David and Matthew counsel him, Charles decides to proceed with the ceremony. When the vicar asks whether anyone has a reason why the couple should not marry, David uses sign language to say the groom has doubts and loves someone else. Charles confirms this, and a furious Henrietta punches him at the altar, knocking him out and ending the ceremony. Later at his flat, Charles and the group are discussing the fiasco when Carrie arrives to apologise for causing trouble. Charles again says he loves her and proposes a lifelong commitment without marriage, which Carrie accepts. As they kiss, a thunderbolt flashes across the sky. In an ending photo montage, Henrietta has married an Army officer; David married Serena; Scarlett has married Chester, the Texan; Tom married Deirdre; Matthew has found a new male partner; Fiona is shown with Prince Charles ; and Charles and Carrie have had their first child.",
  "wiki": "https://en.wikipedia.org/wiki/Four_Weddings_and_a_Funeral"
}