{
  "year": "1994",
  "name": "The Shawshank Redemption",
  "plot": "In 1947, Portland, Maine , banker Andy Dufresne arrives at Shawshank State Prison to serve two consecutive life sentences for murdering his wife and her lover. He is befriended by Ellis Boyd \"Red\" Redding, a contraband smuggler serving a life sentence, who procures for him a rock hammer and a large poster of Rita Hayworth . Assigned to work in the prison laundry, Andy is frequently raped by \"the Sisters\" gang, led by Bogs Diamond. In 1949, Andy overhears the captain of the guards, Byron Hadley, complaining about being taxed on an inheritance and offers to help him shelter the money legally. After the Sisters beat Andy to near-death, Hadley cripples Bogs, who is subsequently transferred to a minimum security hospital; Andy is not attacked again. Warden Samuel Norton assigns Andy to the prison's decrepit library, ostensibly to assist elderly inmate Brooks Hatlen, but in reality, to utilize Andy's financial expertise in managing the warden's and other prison staff's finances. Andy also starts writing weekly letters to the state legislature , requesting funding to improve the library. Brooks is paroled in 1954 after serving 50 years, but cannot adjust to the outside world and eventually hangs himself. After years of Andy's ceaseless letters, the legislature sends a library donation that includes a recording of The Marriage of Figaro ; Andy plays an excerpt over the public address system, experiencing a moment of personal freedom before he is punished with solitary confinement . After his release, Andy explains to a dismissive Red that hope is what gets him through his sentence. In 1963, Norton begins exploiting prison labor for public works, profiting by undercutting skilled labor costs and receiving bribes. Andy launders the money using the alias \"Randall Stephens\". In 1965, Andy and Red befriend Tommy Williams, a young inmate convicted of burglary. Andy helps Tommy pass his General Educational Development exam, and Tommy later reveals that his cellmate at another prison confessed to committing the murders for which Andy was convicted. When Andy informs Norton, the warden refuses to act. Although Andy promises to keep the money laundering a secret, Norton has Hadley kill Tommy under the guise of an escape attempt and sends Andy to solitary confinement. Norton then threatens to destroy the library, strip Andy of guard protection, and transfer him to harsher conditions if he refuses to continue with his scheme. A dishevelled Andy is released from solitary confinement after two months. He tells a skeptical Red that he dreams of living in Zihuatanejo , a town on the Mexican Pacific coast, where he can start anew. He asks Red to promise, once he is released, to travel to a specific hayfield near Buxton and recover a package that Andy buried there. Red worries that Andy is suicidal, especially after learning that he asked a fellow inmate for a rope. At the next day's roll call , the guards find Andy's cell empty. An irate Norton throws a rock at a poster of Raquel Welch hanging on the cell wall, revealing a tunnel that Andy had dug with his rock hammer over 19 years. The previous night, Andy escaped through the tunnel and prison sewage pipe, taking with him Norton's suit, shoes, and the ledger containing evidence of the money laundering and corruption at Shawshank. While guards search for him, Andy poses as Randall Stephens and withdraws over $370,000 of the laundered money from various banks, [ a ] before mailing the ledger to a local newspaper. State police arrive at Shawshank and take Hadley into custody, while Norton commits suicide to avoid arrest. The following year, Red is paroled after serving 40 years, but struggles to adapt to life outside prison and fears that he never will. Remembering his promise to Andy, he visits Buxton and finds a cache containing money and a letter inviting him to come to Zihuatanejo. Red violates his parole by traveling to Mexico, admitting that he finally feels hope. He finds Andy on a beach, and the reunited friends happily embrace.",
  "wiki": "https://en.wikipedia.org/wiki/The_Shawshank_Redemption"
}