{
  "year": "1995",
  "name": "Braveheart",
  "plot": "In 1280, Edward I of England , known as \"Longshanks\", conquers Scotland following the death of the Scots' king, who left no heir. Young William Wallace witnesses the aftermath of Longshanks' execution of several Scottish nobles, then loses his father and brother when they resist the English. He leaves home to be raised by his uncle, Argyle. Years later, Longshanks grants his noblemen land and privileges in Scotland, including jus primae noctis , while his son marries French princess Isabelle . Meanwhile, a grown Wallace returns home and secretly marries his childhood friend Murron MacClannough. Soon after, Wallace rescues Murron from a soldier, but Murron is subsequently captured and executed. In retribution, Wallace and the locals overthrow the Magistrate, and sets the English garrison ablaze while having the Lord residing over the land slain, thus beginning a rebellion that soon spreads. Longshanks orders his son to stop Wallace while he campaigns in France. Wallace is saved from an assassin the English sent and defeats an army sent by the prince at Stirling , then invades England by sacking York and beheading the Duke, sending his head to Longshanks. He also meets Robert the Bruce , a contender for the Scottish crown. After returning to England, Longshanks chastises his son for his failure and even kills his personal adviser, Phillip, then sends Isabelle to negotiate with Wallace as a distraction from the movement of Longshanks' forces. Meeting Wallace, Isabelle becomes enamored with him and warns him of Longshanks' plans. Wallace soon faces Longshanks at Falkirk . During the battle, the Irish mercenaries fighting for Longshanks defected to Wallace's side, however, nobles Mornay and Lochlan withdrew their cavalry, having been bribed by Longshanks, resulting in Wallace's army being overwhelmed. Wallace also discovers Robert the Bruce had joined Longshanks. After helping Wallace escape, Robert vows to not be on the wrong side again. Wallace kills Mornay and Lochlan for their betrayal and foils an assassination plot with Isabelle's help. Wallace and Isabelle spend the following night together, while Longshanks' health declines. At a meeting in Edinburgh , Wallace is captured. Realizing his father's role in Wallace's betrayal, Robert disowns his father. In England, Wallace is condemned to execution. After a final meeting with Wallace, Isabelle tells Longshanks, who can no longer speak, that his bloodline will end upon his death as she is pregnant with Wallace's child and will ensure that Longshanks' son spends as short a time as possible as monarch. At his execution, Wallace refuses to submit, even while being tortured and disemboweled . The magistrate encourages Wallace to seek mercy and be granted a quick death. Wallace instead shouts, \"Freedom!\", while Longshanks dies. Before being beheaded, Wallace sees a vision of Murron in the crowd. In 1314, Robert the Bruce, now Scotland's king, faces the English at Bannockburn , and implores his men to fight with him as they did with Wallace. After Wallace's claymore (inscribed with the name \"Braveheart\", hence the film's title) is thrown to land point-down in the ground, Robert leads the Scots to a final victory.",
  "wiki": "https://en.wikipedia.org/wiki/Braveheart"
}