{
  "year": "1996",
  "name": "Jerry Maguire",
  "plot": "Jerry Maguire is a slick 35-year-old sports agent working for Sports Management International (SMI). After criticism from an injured player's son triggers an epiphany, he writes a mission statement about perceived dishonesty in business and his desire to work with fewer clients to produce a better, more caring personal relationship with them. In response, SMI management sends Bob Sugar, Jerry's protégé, to fire him. This spurs both men to race to call every one of Jerry's clients to retain them. Jerry speaks to Arizona Cardinals wide receiver Rod Tidwell, one of his smallest clients who is disgruntled with his pay. Rod tests Jerry's resolve through a long tirade on his lack of contract extension. By the conclusion of the conversation, Jerry has retained Rod but lost his other clients to Sugar. Leaving the office, Jerry loudly announces that he will start his own agency and asks if anyone will join him, to which only 26-year-old single mother Dorothy Boyd agrees. Frank \"Cush\" Cushman, a superstar quarterback prospect who is expected to be the number one pick in the NFL draft , initially says he will also stay with Jerry after he makes a personal visit to the Cushman home. Frank's father insists on a handshake deal based on his word instead of a signed contract, but Jerry eventually realizes that Cush and his father have secretly signed with Sugar the night before the NFL draft after seeing Jerry spend time to introduce Rod to other football executives. After an argument, Jerry breaks up with his disgruntled fiancée Avery who was emotionally unsupportive. He then turns to Dorothy, becoming closer to her young son, Ray, and eventually starts a romantic relationship with her. Jerry concentrates all his efforts on Rod, now his only remaining client, who turns out to be difficult to satisfy. In need of money, Jerry calls in a favor to get a contract extension from Rod's current team, the Arizona Cardinals, but receives a lowball offer and Rod needs that 10 million dollar deal for his family to live on. Rod and his wife decide to pass on the offer despite Jerry's warning that if he gets injured, he will receive nothing. Without any money coming in, Dorothy knows that Jerry is unable to afford payroll, so she decides to move to San Diego for a more secure job offer with health benefits. Afraid of losing her, Jerry proposes marriage to share health benefits, and as she is smitten, she agrees. Over the next several months, Rod and Jerry grow closer through a series of open and difficult conversations as they struggle to secure him a contract; Rod tells Jerry that he wants him to be honest, while Jerry tells Rod, \"help me help you,\" convincing him to stop complaining and start playing with his heart. Rod takes Jerry's advice, playing well and advancing the Cardinals. Jerry's marriage with Dorothy struggles however, so she suggests they amicably separate before losing too much of their lives to each other. During a Christmas Day Monday Night Football game between the Cardinals and the Dallas Cowboys , Rod catches a winning touchdown that secures the playoffs for the Cardinals, but appears to receive a serious injury . After a few scary minutes, he regains consciousness and celebrates with a dance for the wildly cheering crowd . After the scare and the widely televised recovery, Jerry and Rod embrace in front of the media and show how their relationship has progressed from strictly business to a close personal one, which was one of the points Jerry made in his mission statement. Triggering a realization, Jerry immediately flies home, finding Dorothy in a meeting of her sister's divorcee support group. The group watches as Jerry gives an impassioned speech telling Dorothy he needs her and \"you complete me,\" to which she responds, \"shut up… you had me at hello.\" Rod appears on ESPN's Up Close with Roy Firestone . On air, he learns Jerry has secured him a massive $11.2 million contract with the Cardinals, allowing him to finish his pro football career in Arizona . Rod breaks down and thanks everyone, extending warm gratitude to Jerry. Jerry and Dorothy celebrate as Jerry is introduced to other pro athletes who have seen his work with Rod. Jerry and Dorothy are then seen walking with Ray, discussing Ray's future as a baseball player after noticing his strong throw.",
  "wiki": "https://en.wikipedia.org/wiki/Jerry_Maguire"
}