{
  "year": "1997",
  "name": "L.A. Confidential",
  "plot": "In 1953, the Los Angeles Police Department (LAPD) aims to improve its public image following decades of corruption. Career-focused sergeant Edmund Exley lives in the shadow of his legendary detective father, whose murderer was never identified; Exley names the suspect \"Rollo Tomasi,” representing any criminal who escapes justice. Fame-seeking narcotics sergeant Jack Vincennes collaborates with tabloid journalist Sid Hudgens to perform high-profile celebrity arrests, and volatile officer Wendell White uses violence to interrogate and intimidate suspects, particularly women-abusers, because his father murdered his mother. On Christmas Eve, White encounters high-class prostitutes Lynn Bracken and Susan Lefferts, and former officer Leland Meeks. They work for Pierce Patchett, a millionaire businessman operating Fleur-de-Lis , a clandestine prostitution ring hosting women surgically altered to resemble film stars. White begins a relationship with Bracken. Following the \" Bloody Christmas \" scandal—involving drunken officers beating inmates—Exley is promoted to detective lieutenant after persuading his superiors to save the department's reputation by only prosecuting securely pensioned officers. Exley coerces Vincennes to testify, while White refuses to comply and is suspended. White's partner Dick Stensland is fired for his involvement, making other officers hostile towards Exley. Following the imprisonment of powerful gangster Mickey Cohen , police captain Dudley Smith recruits White to frighten off criminals attempting to take Cohen's place. A spate of murders targeting Cohen's underlings leads to the disappearance of 25 lb (11 kg) of his heroin. Exley investigates a massacre at the Nite Owl coffee house, with Stensland and Lefferts among the victims. Three African American felons are arrested for the crime, and interrogation reveals the men have been raping a captive woman. White rushes to free the woman and executes her captor, planting evidence to suggest he acted in self-defense. The African-Americans escape the station and are killed by Exley in the ensuing shootout, closing the case and earning him a medal for bravery. However, unable to ignore inconsistencies in the case, Exley and White continue the investigation independently. White interviews Lefferts's mother and discovers Meeks's body beneath her house. He interrogates Cohen's ex-bodyguard, Johnny Stompanato , who reveals Meeks was trying to sell the stolen heroin. Hudgens and Vincennes orchestrate a homosexual tryst between struggling actor Matt Reynolds and district attorney Ellis Loew to create blackmail photos. However, after Reynolds is found murdered, a guilt-ridden Vincennes joins Exley's investigation. Vincennes learns that Meeks and Stensland formerly worked together under Smith, and dropped an investigation into Patchett and Hudgens blackmailing prominent businessmen with photos of their illicit trysts. He then confronts Smith, who shoots him dead. With his last breath, Vincennes says \"Rollo Tomasi.\" Exley becomes suspicious when Smith asks him about \"Rollo Tomasi\", a name Exley disclosed only to Vincennes. Smith arranges for White to find photos taken by Hudgens of Bracken having sex with Exley. Enraged, White confronts and fights Exley until they realize that their investigations implicate Smith. They deduce that Stensland killed Meeks for the heroin, and Smith orchestrated the Nite Owl massacre to kill Stensland and framed the African-Americans. Exley and White interrogate Loew, discovering Smith and Patchett are taking over Cohen's empire and used the photos of him with Reynolds to coerce his cooperation. Exley and White later find Hudgens and Patchett murdered. Smith lures Exley and White into a remote ambush. Though badly wounded, the pair kill Smith's men. Smith offers to mislead the approaching police and further promote Exley, but Exley executes him to prevent him avoiding punishment. Despite Exley's evidence, LAPD officials decide to protect the department's image by claiming Smith died a hero; Exley agrees to cooperate as a second \"hero\" for further accolades. Outside city hall , Exley says goodbye to Bracken and White before they leave for Arizona .",
  "wiki": "https://en.wikipedia.org/wiki/L.A._Confidential_(film)"
}