{
  "year": "1997",
  "name": "As Good as It Gets",
  "plot": "Misanthropic NYC best-selling romance novelist Melvin Udall has OCD . He uses soap bars only once to wash his hands, paper towels to touch public restroom faucets and door handles, avoids stepping on sidewalk cracks, has rituals with switches and locks, sticks to rigid routines, and always eats breakfast at the same table in the same restaurant while bringing his own plastic flatware. Carol Connelly is the only server at the restaurant who tolerates his rude and compulsive behavior. Melvin's apartment neighbor, gay artist Simon Bishop, starts working with a new model, Vincent Lopiano. Vincent uses the opportunity to case Simon's apartment and give entry to his friends, who assault and nearly kill Simon during the robbery. Simon's agent, Frank Sachs, intimidates Melvin into caring for Simon's pet dog Verdell, a Griffon Bruxellois , while Simon is hospitalized. Although Melvin initially does not enjoy caring for the dog, he becomes emotionally attached to it. When Simon is released from the hospital, Melvin tolerates a neighborly relationship with him so he can continue to see Verdell. Melvin's compulsive need for routine and aversion to change is aggravated when Carol decides to work closer to home in Brooklyn to be more accessible for her acutely asthmatic son, Spencer. Unable to adjust to a different waitress, Melvin arranges to pay for Spencer's considerable medical expenses for at-home care―if Carol returns to the restaurant. While Carol is overwhelmed by Melvin's generosity, thanking him profusely, she is suspicious of his motives, declaring emphatically that she will never have sex with him. A humiliated Melvin admonishes her that she, not he, has made the situation personal. Meanwhile, Simon's injuries, lack of medical insurance, and high medical bills cause him to go bankrupt and fall into depression. Frank persuades him to go to Baltimore to ask his estranged parents for money. Bullied by Frank, Melvin reluctantly agrees to take a recuperating Simon to Baltimore. Frank lends Melvin his Saab 900 convertible for the trip. Irrationally fearing Simon may make a pass at him (his cover story), Melvin invites Carol along on the trip, reminding her that she owes him a favor, so she reluctantly accepts. Relationships develop among the three on the trip as Simon discusses the root of his estrangement with his parents, who cannot accept his homosexuality; Carol commiserates; and Melvin's acerbic remarks gradually become more sympathetic. Once in Baltimore, Carol persuades Melvin to take her out for dinner. His conversation during the dinner initially flatters her—he tells her that her \"no-sex oath\" made him start taking medication to become a better man. When Carol presses Melvin to admit that he invited her on the trip because he has feelings for her, an embarrassed and fumbling Melvin again clumsily deflects. He awkwardly responds that he invited her along to maybe have sex with Simon to cure his homosexuality. Upset at the implication that her sexual favors are for sale, Carol abruptly leaves. Going to Simon's hotel room for consolation, perhaps their emotional intimacy rekindles his creative desire to paint. He sketches Carol, nearly nude, making her feel her femininity appreciated in a non-sexual way. With confidence inspired by Carol, Simon briefly reconnects with his mother, without asking her for money, telling her that he will be fine. After returning to New York, Carol tells Melvin she does not want him in her life anymore as he disparages her. Since Simon is still broke and his apartment has been sublet, Melvin arranges for him to stay in his spare bedroom. On learning of Melvin's enormous gesture and sign of growth, Carol regrets her harshness and apologizes to Melvin by phone. The relationship between Melvin and Carol remains complicated until Simon persuades insomniac Melvin to declare his love for her. At 4 am, Melvin goes to see Carol, who hesitantly agrees to try establishing a relationship with him. She is encouraged by her mother, who declares that no relationship is perfect. As Melvin opens the door for Carol at a pastry shop, he realizes that he has stepped on a pavement crack to no apparent unease. They walk into the shop conversing as a couple.",
  "wiki": "https://en.wikipedia.org/wiki/As_Good_as_It_Gets"
}