{
  "year": "1998",
  "name": "Life Is Beautiful",
  "plot": "In 1939, in Fascist Italy , young Italian Jew Guido Orefice arrives to work in Arezzo , Tuscany , with his uncle Eliseo in a hotel restaurant. He is comical and sharp, and falls in love with the gentile girl Dora. Later, Guido sees her again in the city where she is a teacher and set to be engaged to Rodolfo, a rich but arrogant local government official with whom he regularly clashes. Guido sets up many \"coincidental\" incidents to show his interest in Dora. Eventually, Dora gives in to Guido's affection and promise. Guido steals her from her engagement party on Uncle Eliseo's horse, Robin Hood, humiliating Dora's fiancé and mother. They are later married, have a son, Giosuè, and run a bookstore. Dora's mother visits once, meeting her grandson. In 1944, at the height of World War II , Nazi Germany occupies Northern Italy . Guido, his uncle Eliseo, and Giosuè are arrested on Giosuè's birthday. They and many other Italian Jews are forced onto a train bound for a concentration camp. After confronting a guard about her husband and son and being told there is no mistake, Dora insists on boarding the train to stay with her family. However, as men and women are separated in the camp, Dora never sees her family during their internment. Guido pulls off various stunts, such as hijacking the camp's loudspeaker to send messages, symbolic or literal, to Dora to assure her that he and Giosuè are safe. Eliseo is murdered in a gas chamber shortly after their arrival. Giosuè narrowly avoids being gassed himself as he hates to bathe, and did not follow the other children when they had been ordered to \"take a shower\". Guido consistently hides the true situation from Giosuè. He convinces him that the camp is a complicated game in which he must perform the tasks given to him. Each task earns them points and whoever reaches one thousand points first wins a tank. He is told that if he cries, complains for his mother, or says that he is hungry, he will lose points, while quiet boys who hide from the guards earn extra points. Giosuè is at times reluctant to go along with the game, but Guido continually encourages him. One day, Guido takes advantage of the appearance of visiting German officers and their families to show Giosuè that other children are hiding as part of the game. Then he tricks a German nanny into thinking Giosuè is one of her charges to feed him while Guido serves the German officers. Giosuè must stay quiet at all times for this part of the game and simply follow the other children, as he cannot speak German. Giosuè is almost exposed as a prisoner when he accidentally says \"thank you\" in Italian to another server at dinner. However, when they return with his superior, Guido provides a ruse by teaching all of the German children how to say \"thank you\" in Italian, saving Giosuè. Guido maintains this story through the end when, in the chaos of shutting down the camp as the Allied forces approach, he tells his son to stay hidden until everybody has left, the final task in the competition before the promised tank is his. Guido goes to find Dora, but is caught by a German soldier. An officer orders his execution, so he is led off by the soldier. As he is walking to his death, Guido passes by Giosuè one last time and winks, still in character and playing the game. Guido is then shot dead in an alleyway. The next morning, Giosuè emerges from hiding, just as a U.S. Army unit led by a Sherman tank arrives and the camp is liberated. An overjoyed Giosuè, unaware of his father's death, believes he won the tank, and an American soldier allows him to ride with him on it. Giosuè soon spots Dora in the procession leaving the camp and reunites with her. While the young Giosuè excitedly tells his mother about how he had won a tank, just as his father had promised, the movie's narrator reveals himself as the adult Giosuè, reminiscing on the sacrifices his father made for him.",
  "wiki": "https://en.wikipedia.org/wiki/Life_Is_Beautiful"
}