{
  "year": "1999",
  "name": "American Beauty",
  "plot": "Lester Burnham, a middle-aged media executive in suburbia, despises his job and is unhappily married to neurotic, status-obsessed Carolyn, a real estate salesperson. Their 16-year-old daughter and only child, Jane, resents her parents and has low self-esteem. Retired Marine colonel Frank Fitts, his near- catatonic wife Barbara, and their teenage son Ricky move in next door. Ricky documents the world around him with a camcorder , collecting recordings on videotape in his bedroom, as he finds beauty in unexpected places and things; he pays for supplies by dealing marijuana , using his part-time catering and waitstaff jobs as a front. A strict and abusive disciplinarian, Frank previously had Ricky sent to a psychiatric hospital and military school . Gay couple Jim Olmeyer and Jim Berkley, also neighbors, welcome the Fitts family, angering the homophobic Frank. One evening during a cheerleading routine at a school basketball game, Lester becomes infatuated with Jane's friend Angela Hayes, who brags to her classmates about being sexually experienced. He starts having sexual fantasies about her, in which red rose petals are a recurring motif. Carolyn begins an affair with married real estate \"King\" Buddy Kane. Lester quits his job, blackmails his supervisor into giving him a generous severance package, and starts working as a fry cook at a fast food restaurant . He also buys his dream car, a 1970 Pontiac Firebird , and starts regularly exercising  after overhearing Angela teasing Jane that she would have sex with Lester if he improved his physique. He begins smoking marijuana supplied by Ricky and returning Angela's flirts. The girls' friendship wanes when Angela and Lester start having sexual interests in one another and when Jane starts a relationship with Ricky; while Angela thinks he is strange, Jane appreciates him for focusing on the beauty he sees within her. Buddy and Carolyn have a date at a shooting range . Lester then discovers Carolyn's infidelity when they order a meal at the fast food's drive through. Buddy fears a costly divorce and ends the affair, while Carolyn is humiliated and simultaneously frustrated by her lack of professional success. Frank finds Ricky's recording of a nude Lester working out and becomes suspicious of their friendship, assuming that they are sexually involved after spying on their drug session. He viciously accuses Ricky of being gay and expels him from the house, to which Ricky defiantly agrees. Carolyn, driving home, withdraws a handgun from the glove box as she listens to a self-help tape. At home, Jane argues with Lester and Angela over Angela's sexual interest in Lester, when Ricky interrupts to ask Jane to leave with him for New York City before he   dismisses Angela as uninteresting and unattractive. Frank tentatively approaches Lester in the Burnhams' garage, then breaks down and tearfully embraces him. Lester comforts Frank and gently rebuffs Frank's attempts to kiss him. Lester finds Angela alone and consoles her, then professes his attraction to her during their conversation. As he begins to undress her on the couch, she admits her virginity. Lester realizes that she had feigned being sexually experienced, and he cannot continue. He bonds with her as they share their frustrations. Angela goes to the bathroom as Lester smiles at a family photograph, when an unseen figure shoots him in the back of the head at point-blank range. Ricky and Jane, who had earlier considered killing Lester themselves, find his body. Discovering the body herself, Carolyn hides in the master closet, discards her gun, and hugs Lester's clothing. A blood-soaked Frank returns home, a gun missing from his collection. Lester's closing narration describes meaningful experiences during his life, for which he expresses gratitude. Despite being murdered, he is finally happy, having found beauty in the world.",
  "wiki": "https://en.wikipedia.org/wiki/American_Beauty_(1999_film)"
}