{
  "year": "1999",
  "name": "The Green Mile",
  "plot": "In 1935, corrections officer Paul Edgecomb oversees \"The Green Mile,\" the death row section of Cold Mountain Penitentiary, alongside officers Brutus Howell, Dean Stanton, Harry Terwilliger, and the sadistic and despised Percy Wetmore, whose connections to the state governor shield him from punishment. The guards supervise three prisoners: Eduard Delacroix, who is frequently tormented by Percy; the violent and erratic William Wharton; and John Coffey, a hulking yet gentle and simple-minded African-American man convicted of raping and murdering two white girls after being found distraught while cradling their bodies. John asserts that he tried to \"take it back\", but could not. Paul grows doubtful that John committed the crimes and soon discovers he possesses miraculous healing abilities. John cures Paul's crippling bladder infection by absorbing it into himself before expelling it as flies, explaining that he \"took it back\". After Percy crushes Eduard's pet mouse, Mr. Jingles, John urgently requests the body and resurrects it, further convincing the guards of his powers. Fed up with Percy's behavior, the officers let him officiate an execution on the condition that he take a job at Briar Ridge insane asylum afterward. At Eduard's execution, Percy deliberately neglects to wet the sponge meant to conduct electricity, causing Eduard an agonizing death. John senses and is overwhelmed by Eduard's pain, causing him to inadvertently transfer some of his power into Mr. Jingles, who scurries away. Paul convinces the guards (excluding Percy) to take John to heal warden Hal's terminally ill wife, Melinda. They straitjacket Percy and confine him to a padded cell as punishment for torturing Eduard before sneaking John out of the prison to the warden's home. John absorbs Melinda's illness, restoring her health, but is left in severe pain from containing it within him. The guards return John to his cell, and release Percy, but John grabs hold of and transfers the illness into Percy, who, in a possessed state, shoots Wharton dead. Paul demands answers, leading John to transfer into him Wharton's memories, revealing him to be responsible for the crimes of which John was convicted. Percy is left catatonic and later committed to Briar Ridge. Though convinced of John's innocence, Paul cannot prove it or stop the execution. He offers John a chance to escape, believing it unacceptable to destroy what he considers to be a true miracle. John, however, exhausted by the pain he endures from constantly sensing the suffering and ugliness that people inflict on each other, chooses to die. His last request is to watch a movie, never having seen one before, so he, Paul, and the other officers watch Top Hat (1935). When John is taken to be executed, he tells the guards of his last dream, in which he and the two girls are safe and happy. John is saddened by the hatred he feels from those in attendance, who still believe him to be guilty, but Brutus encourages him to focus on the guards, who do not hate him. John requests not to wear a hood, because he is afraid of the dark. Paul briefly takes John's hand before the tearful officers reluctantly carry out the execution. In 1999, Paul, now 108 years old, watches Top Hat and, reminded of the events, recounts John's story to his friend Elaine, revealing it was the last execution he and Brutus performed before transferring to juvenile corrections. Elaine is stunned when Paul reveals that Mr. Jingles is still alive. While she calls Paul's longevity a miracle, he sees having outlived all his loved ones as a divine punishment for allowing John to die. After Elaine's funeral, Paul wonders how much longer he will live if a mouse's life could be so significantly extended, lamenting, \"Sometimes, the Green Mile seems so long.\"",
  "wiki": "https://en.wikipedia.org/wiki/The_Green_Mile_(film)"
}