{
  "year": "1999",
  "name": "The Sixth Sense",
  "plot": "In Philadelphia, child psychologist Malcolm Crowe is at home with his wife Anna when Vincent Grey, a former patient Malcolm had treated, breaks into their house. Vincent accuses Malcolm of failing him before shooting Malcolm and then himself. Months later, Malcolm has begun working with Cole Sear, a nine-year-old boy who reminds him of Vincent. He feels he must help Cole in order to rectify his own failure to help Vincent and to reconcile with Anna, who has become cold and distant towards Malcolm. Lynn worries about her son Cole, especially after seeing mysterious signs of physical harm. At a birthday party, when bullies see that Cole is scared of a cupboard, they lock him in it, causing him to scream in terror about someone seemingly inside with him. Once released, he faints and appears to have been physically assaulted, which his mother attributes to the bullies. Following this, Cole confides to Malcolm that he sees dead people. Malcolm believes Cole is schizophrenic and considers dropping his case. However, after listening to an audiotape from a session with Vincent, he hears a man begging for help in Spanish when Vincent was supposed to be alone in the room, suggesting that Vincent had the same ability. He realizes that Cole is telling the truth and suggests that he try to communicate with the ghosts and help them in order to overcome his fears. One night, Cole finds Kyra Collins, a female child ghost, vomiting. He works out who she is and goes with Malcolm to the funeral reception at her home. In her room, Kyra gives Cole a videotape that he gives to her father. The tape reveals that her mother poisoned her food, alerting her father to the cause of her death and saving her younger sister. Cole is given a lead part in his school play. He is coached by a ghost director and gives his performance with Malcolm looking on. Before leaving, Cole suggests that Malcolm try speaking to Anna while she is asleep so she can hear his thoughts and feelings. Cole tells Lynn his secret. When she does not believe him, he tells her that his deceased grandmother visits him and describes details from his mother's childhood that he could not have known. Shocked, Lynn believes him. Malcolm returns home to find his wedding video playing and Anna talking in her sleep, asking Malcolm why he left her. She drops his wedding ring, and he notices that it is not on his finger. Recalling what Cole told him about dead people only seeing what they want to see, Malcolm locates his gunshot injury, and he realizes that he did not survive being shot by Vincent. He has been dead the entire time while working with Cole. Malcolm comes to terms with the fact that he is a ghost and lets Anna know that he had to help someone. He tells her that she was never second to anything and that he loves her. Anna's face relaxes indicating she is at peace and can move on, and Malcolm's spirit departs in a flash of light.",
  "wiki": "https://en.wikipedia.org/wiki/The_Sixth_Sense"
}