{
  "year": "1999",
  "name": "The Insider",
  "plot": "CBS producer Lowell Bergman convinces the founder of Hezbollah , Sheikh Fadlallah , to grant an interview to Mike Wallace for 60 Minutes . Wallace and Bergman firmly stand their ground against the Sheikh's armed and hostile bodyguards, who attempt to intimidate and disrupt their interview preparations. Later, Bergman approaches Jeffrey Wigand—a former executive at the Brown & Williamson tobacco company—for help explaining technical documents. Wigand agrees but intrigues Bergman when he insists that he will not discuss anything else, citing a confidentiality agreement . Brown & Williamson coerces Wigand into a more restrictive agreement, leading Wigand to accuse Bergman of betraying him. Bergman subsequently visits Wigand to defend himself and investigate the potential story. Although Wigand apparently possesses very damaging information, he hesitates to reveal anything, fearing that it will jeopardize his severance package from Brown & Williamson. Wigand's family moves into a more modest house, and Wigand begins working as a teacher. One night, Wigand finds evidence of trespass and receives a sinister phone call. Meanwhile, Bergman contacts Richard Scruggs , an attorney representing Mississippi in a lawsuit against the tobacco industry. Bergman suggests that if they depose Wigand, making his information public, it can give CBS cover to broadcast the information; Scruggs expresses interest. Wigand receives an emailed death threat and finds a bullet in his mailbox. He contacts the FBI , but the agents who visit him are hostile and confiscate his computer. Furious, Wigand demands that Bergman arrange an interview, during which Wigand states that he was fired after objecting to Brown & Williamson intentionally making their cigarettes more addictive. Bergman arranges a security detail for Wigand's home, and the Wigands experience marital stress. Wigand testifies in Mississippi, despite attempts of intimidation and legal suppression by Brown & Williamson attorneys. After returning home, he discovers that his wife Liane has left him and taken their daughters. Eric Kluster, the president of CBS News , decides not to broadcast Wigand's interview after CBS legal counsel Helen Caperelli warns that the network is at risk of legal action from Brown & Williamson. Bergman confronts Kluster, accusing him of sacrificing journalistic integrity to protect the impending sale of CBS to Westinghouse , which would enrich both Kluster and Caperelli. Wallace and their executive producer Don Hewitt both side with Kluster. Wigand, learning of this, is appalled and terminates contact with Bergman. Investigators probe Wigand's personal history and publish their findings in a 500-page dossier. Bergman learns that The Wall Street Journal intends to use it in a piece questioning Wigand's credibility. He convinces the Journal 's editor to delay publication and assign journalists to investigate the dossier, claiming that it falsely quotes its sources. After infighting at CBS over the Wigand segment, Bergman is ordered to take a \"vacation\" as the abridged 60 Minutes segment airs. Bergman contacts Wigand, who is both dejected and furious, accusing Bergman of manipulating him. Bergman defends himself and praises Wigand and his testimony. Scruggs urges Bergman to air the full segment to draw public support for their lawsuit, which is under threat from a lawsuit by Mississippi's governor. Bergman, frozen out, is unable to assist and privately questions his own motives pursuing the story. Bergman contacts an editor at The New York Times , disclosing the full story and events at CBS. The Times prints the story on the front page and condemns CBS in a scathing editorial. The Journal dismisses the dossier as character assassination and prints Wigand's deposition. Hewitt accuses Bergman of betraying CBS, but finds that Wallace now agrees that bowing to corporate pressure was a mistake. 60 Minutes finally airs the original segment, including the full interview with Wigand. Bergman tells Wallace that he has resigned, believing that 60 Minutes 's credibility and integrity are now permanently tarnished.",
  "wiki": "https://en.wikipedia.org/wiki/The_Insider_(film)"
}