{
  "year": "2000",
  "name": "Traffic",
  "plot": "In Mexico , police officers Javier Rodriguez Rodriguez and Manolo Sanchez stop a drug transport. General Salazar, a high-ranking Mexican official, interrupts their arrest to offer Javier a special assignment: apprehending Francisco Flores, a hitman for the Tijuana Cartel , headed by the Obregón brothers. In Tijuana, under torture, Flores gives Salazar the names of Obregón cartel members, who are arrested. Javier and Salazar's efforts cripple the Obregóns' cocaine outfit, but Javier discovers that Salazar is a pawn of the rival Juárez Cartel ; Salazar's anti-drug campaign is a charade to wipe out the Juárez Cartel's competitors. Sanchez attempts to sell information about Salazar's true affiliation to the Drug Enforcement Administration , but Salazar has him murdered in the desert with Javier forced to watch. Javier arranges a deal with the DEA to testify against Salazar in exchange for electricity in his neighborhood to keep local children from being tempted by street gangs and crime. Salazar's secrets are revealed, and he is arrested. Javier makes a statement to the media about the widespread corruption in the police force and army. Later, Javier watches as children play baseball at night in their new stadium. Robert Wakefield, a conservative Ohio judge, is appointed to head the President 's Office of National Drug Control Policy as drug czar , though he is warned that the War on Drugs is unwinnable. Meanwhile, Robert's teenage daughter Caroline has been using cocaine , methamphetamine , and heroin , developing a drug addiction after her boyfriend Seth introduces her to freebasing . Caroline, Seth, and their friend Vanessa are arrested when they try to dump an overdosing fellow student at a hospital. Robert and his wife Barbara struggle to deal with Caroline's addiction, which Barbara has secretly known about for months. Robert finds himself caught between his demanding new position and difficult family life. Visiting Mexico, he is encouraged by Salazar's successful efforts in hurting the Obregón brothers. Returning to Ohio, Robert learns that Caroline has run away to Cincinnati after stealing money from her parents to pay for drugs. Dragging Seth along, Robert searches Cincinnati for his daughter. After a drug dealer who is prostituting Caroline refuses to reveal her whereabouts, Robert breaks into a seedy hotel room and finds a semi-conscious Caroline in the company of an older man. In Washington, D.C. to present a \"10-point plan\" to win the War on Drugs, Robert falters halfway through the speech, and tells the press that the War on Drugs implies a war on one's own family, which he cannot endorse. Later, Robert and Barbara attend a Narcotics Anonymous meeting with Caroline, telling the other attendees that they are \"here to listen\". In San Diego , an undercover DEA investigation led by Montel Gordon and Ray Castro leads to the arrest of Eduardo Ruiz, a dealer posing as a fisherman. Ruiz gives up his boss, drug lord Carl Ayala, the Obregóns' biggest distributor in the United States. Ayala is indicted by a tough prosecutor, hand-selected by Robert Wakefield to send a message to the cartels. As Ayala's trial begins, his pregnant wife Helena learns of her husband's true profession from his associate, Arnie Metzger. Facing the prospect of life imprisonment for her husband and death threats against her child, Helena hires Flores to assassinate Ruiz and end the trial nolle prosequi . Flores plants a car bomb , but he is killed by a sniper in retaliation for his cooperation with General Salazar, and the bomb meant to kill Ruiz instead kills Agent Castro. Knowing Ruiz will soon testify, Helena makes a deal with Juan Obregón, who forgives the Ayala family's debt and has Ruiz poisoned. Ayala is released, and he deduces that Metzger accepted $3 million to inform on Ruiz to the FBI and facilitate Ayala's downfall; Metzger is later visited by armed men. Soon after Ayala's release, Gordon bursts into his homecoming celebration and is forced out. Having planted a listening device under Ayala's desk, Gordon smiles as he walks away.",
  "wiki": "https://en.wikipedia.org/wiki/Traffic_(2000_film)"
}