{
  "year": "2001",
  "name": "In the Bedroom",
  "plot": "In coastal Camden, Maine , Matt and Ruth Fowler enjoy a happy marriage and a good relationship with their son Frank, a recent college graduate home for the summer. Frank has fallen in love with a divorced older woman with children, Natalie Strout; Ruth is concerned about the relationship, while Matt thinks it is only a fling. The family struggles to communicate their feelings to one another, especially regarding Frank's relationship and schooling. Frank is about to begin graduate school for architecture but is considering staying in town to continue working as a fisherman and to be near Natalie and her kids. Natalie's ex-husband, Richard Strout, tries to find a way into his ex-wife and children's lives, going to increasingly violent lengths to get his intentions across to Natalie, including assaulting Frank. Frank rushes to Natalie's home one evening after receiving a frightened phone call from one of her children. He arrives to find the living room trashed and Natalie in distress. She tells him Richard just left, but he returns almost immediately. Natalie takes the boys upstairs, and Frank insists through the locked front door that Richard leave. He feigns doing so, only to break in through the back door with a handgun; in the ensuing scuffle, Frank is shot and killed. Though equally devastated, Matt and Ruth grieve in different ways, with Matt putting on a brave face and quickly returning to work, while Ruth becomes reclusive and quiet. The couple retreat with friends Willis and Katie Grinnel to a secluded cottage for a weekend, but Ruth is distant and Matt begins to drink heavily. At Richard's bail hearing, Natalie is pressed by his lawyer over whether she saw the shooting, as she initially testified when police arrived on the scene, and she tearfully shakes her head, as she only heard what happened. The tension between Matt and Ruth increases when their lawyer informs them that because of the change from Natalie's original testimony, Richard was allowed out on bail, and his defense will argue that Frank's death was an accident, meaning Richard will most likely be charged with accidental manslaughter and only serve five to ten years in prison. The couple begin to see Richard around town. Matt approaches Natalie at work to check in on her and the two have a well-intentioned but strained conversation. Matt takes the boat out to catch lobsters to feel a connection with Frank, but he struggles with it and is pinched by a lobster, leaving a bleeding wound on one finger which Matt bandages. Natalie approaches Ruth at work and attempts to apologize, but Ruth slaps her before dismissively returning to her work. Natalie leaves in tears. Later that day, Ruth runs into Richard at the grocery store. When she returns home, an argument erupts between the couple in which they emotionally savage each other; Matt lambastes Ruth for being overbearing in Frank's youth, while Ruth chastises Matt for showing little grief for their deceased son and encouraging his relationship with Natalie because of his own vicarious lust for her. After a young girl selling candy for a fundraiser interrupts them, Matt takes back what he said to Ruth, who apologizes in turn and, breaking down, tells Matt about seeing Natalie and Richard. They embrace and find common ground in their grief. Matt and Willis spend the evening drinking and lamenting the injustice, and Willis asks if the couple have considered moving or doing anything about Richard. Matt abducts Richard at gunpoint, saying he's arranged for Richard to jump bail and leave the state, so as to spare them the pain of seeing him in Camden. He forces Richard to pack clothes for warm weather and plants a train schedule in his apartment. He then makes Richard drive them to the Grinnel cabin, where Willis is waiting with another vehicle. He begins to load Richard's belongings, but Matt hesitates, then shoots Richard, killing him. Willis admonishes Matt for not following their plan to kill Richard in the woods, and Matt responds that he couldn't wait. They bury Richard's body deep in the woods but are stuck unexpectedly at a bridge crossing on their return home. Willis laments that this cost them nearly an hour, meaning they will arrive back in town just after sunrise instead of in darkness. Matt returns home to find Ruth awake. She asks, \"Did you do it?\" Matt appears troubled and unresponsive. He climbs into bed and turns away from her. She asks if he's okay, and Matt haltingly describes a photo he saw in Richard's apartment of him with Natalie in a loving embrace, but cannot explain why it affected him. At length Ruth gets up to make coffee, calling \"Matt, do you want coffee?\" from the kitchen, but he doesn't answer. Matt removes the bandage from his finger and finds the wound scabbed over.",
  "wiki": "https://en.wikipedia.org/wiki/In_the_Bedroom"
}