{
  "year": "2001",
  "name": "Gosford Park",
  "plot": "In 1932, Sir William McCordle, his wife Lady Sylvia, and their daughter Isobel host a shooting party at their country estate, Gosford Park. Among the guests are Sylvia's sisters Louisa and Lavinia, and their husbands Lord Stockbridge and Commander Anthony Meredith; her aunt Constance, Countess of Trentham; the Hon. Freddie and Mabel Nesbitt; actor Ivor Novello and American film producer Morris Weissman. Lord Rupert Standish and Jeremy Blond arrive later. Mrs Wilson, the housekeeper, assigns the visiting servants to their rooms and overhears Robert Parks, Lord Stockbridge's valet, mention being raised in an orphanage. Head housemaid Elsie tutors Lady Trentham's inexperienced maid, Mary MacEachran. Following dinner, a silver carving knife is missing. Henry Denton, Weissman's valet, raises the staff's suspicions with intrusive questions and a seemingly Scottish accent (which Mary, Scottish herself, sees through). Later that evening, Henry has a tryst with Lady Sylvia. Isobel asks Elsie to speak to Sir William about hiring Freddie, who is blackmailing Isobel over their affair and her aborted pregnancy. Freddie mistreats Mabel, whom he married for her money but overestimated her wealth. Lady Trentham confides to Mary that Sylvia and Louisa cut cards to decide which of them would marry Sir William. When the men go shooting, a stray shot grazes Sir William's ear. The ladies join them for lunch, and Sir William withdraws from Anthony's business scheme, leaving him financially ruined. Lady Sylvia informs her aunt Constance that Sir William may halt her allowance. During dinner, Lady Sylvia berates Sir William and Elsie comes to his defence, inadvertently exposing their affair. After dinner, Sir William retires alone to his study for the rest of the evening, where Mrs Wilson brings him coffee. The guests gather in the drawing room as Novello plays the piano and sings, with the servants listening outside; Freddie, Anthony, Robert, and footman George each slip away. A man, seen only by his trousers, puts on muddy galoshes left by one of the shooting party. The man enters the library with the missing carving knife and, finding Sir William seemingly asleep in his chair, stabs him in the chest. After the body is discovered, bumbling Inspector Thompson and competent Constable Dexter arrive to investigate. It is discovered that Sir William was poisoned before being stabbed. Mrs Croft, the head cook, tells her staff about Sir William's history of seducing his female factory workers; those who became pregnant were forced to give their babies up for adoption or lose their jobs. Isobel gives Freddie a cheque, which he angrily tears up when confronted by Mabel. Inspector Thompson releases the guests without interviewing most of the staff. Mary deduces that Lord Stockbridge's valet is the killer. When she confronts Parks, he reveals that he is the illegitimate son of Sir William and that his mother was one of his factory workers who died soon after Sir William turned him over to an orphanage. It also becomes clear that since Parks did not poison Sir William, he must already have been dead when he was stabbed. Parks tells Mary that he is glad that Sir William is dead and does not care who was responsible. As the guests and their servants depart, Freddie, his blackmail scheme with Isobel having failed, pursues a partnership with Anthony, whose business venture has been saved by Sir William's death. Despite his fondness for her, Rupert's courtship of Isobel is abruptly ended when she overhears his conversation with Mr Blond about the limits on her inheritance. Lady Trentham and Lady Sylvia discuss Mrs Croft and Mrs Wilson's long-standing feud, and Lady Sylvia reveals that Mrs Wilson's surname used to be Parks. Mary speaks to Mrs Wilson, who admits that she and Mrs Croft are sisters and both had children by Sir William while working at his factory. Mrs Croft kept her baby and lost her job, though the child died in infancy, while Mrs Wilson gave up Robert (Parks). Realizing Parks was her son and that he intended to kill his father, she poisoned Sir William to ensure his only crime would be stabbing a dead body. Mrs Croft comforts Mrs Wilson as Mary says goodbye to Robert, and the last guests leave.",
  "wiki": "https://en.wikipedia.org/wiki/Gosford_Park"
}