{
  "year": "2002",
  "name": "The Hours",
  "plot": "In 1941, renowned author Virginia Woolf commits suicide by placing rocks in her pockets and drowning in a river. The rest of the film takes place within the span of a single day in three different years and alternates among them. In 1923,  Woolf has begun writing the book Mrs. Dalloway in her hometown of Richmond outside London. Virginia, who has experienced several nervous breakdowns and suffers from recurring bouts of severe depression, feels trapped in her home, intimidated by servants and constantly under the eye of her husband, Leonard , who has begun a publishing business at home to stay close to her. Woolf both welcomes and dreads an afternoon visit from her sister Vanessa and her children. After their departure, Virginia flees to the railway station where she is awaiting a train to central London when Leonard arrives to bring her home. He tells her how he lives in constant fear that she will take her own life. She says she fears it also, but argues that if she is to live, she has the right to decide how and where, as much as any other person. In 1941, Virginia commits suicide by drowning in the River Ouse . In 1951, troubled Los Angeles housewife Laura Brown is pregnant with her second child and spends her days in her tract home with her young son, Richie. She married her husband, Dan, soon after World War II and on the surface they are living the American Dream , but she is deeply unhappy. She and Richie make a cake for Dan's birthday, but it is a disaster. Her neighbor Kitty drops in to ask her if she can feed her dog while she's in the hospital for a procedure. Kitty pretends to be upbeat, but Laura senses her fear and boldly kisses her on the lips. Kitty accepts the kiss without comment, and both women ignore any hidden meaning it might have. Laura and Richie successfully make another cake. She then takes him to stay with her friend Mrs. Latch. He is terrified of being left without her, although she insists she will be back. She checks into a hotel where she intends to commit suicide. She removes several bottles of pills and Woolf's novel from her purse, and begins to read Mrs. Dalloway . She drifts off to sleep and dreams the hotel room is flooding, awakening with a change of heart. She picks up Richie and they return home to celebrate Dan's birthday. In 2001, New Yorker Clarissa Vaughan spends the day preparing for a party she is hosting in honor of her friend Richard, a poet and author living with AIDS who is about to receive an career achievement award. Clarissa, who Richard frequently refers to as Mrs. Dalloway, is concerned about his depression. Although Clarissa herself is a lesbian who has been living with partner Sally Lester for 10 years, she and Richard were lovers during their college days. He has spent the better part of his life in gay relationships, including one with Louis Waters, who left him several years prior, but who returns for the festivities. Clarissa's daughter, Julia, comes home to help her prepare for the evening's event. Eventually Richard tells Clarissa he has stayed alive solely for her sake, and the award is meaningless because he didn't get it until he was on the brink of death. Having taken several pills, he tells Clarissa, shortly before jumping to his death from a window, she is the best thing he ever had. Later that night, Laura, who is revealed to be Richard's mother, arrives at Clarissa's apartment. Although it is clear that Laura's abandonment was a profound trauma for him, she feels it was better to leave her husband and children rather than commit suicide.",
  "wiki": "https://en.wikipedia.org/wiki/The_Hours_(film)"
}