{
  "year": "2002",
  "name": "The Pianist",
  "plot": "In September 1939, Władysław Szpilman , a Polish-Jewish pianist, is playing live on the radio in Warsaw when the station is besieged during Nazi Germany 's bombing of Warsaw . Szpilman and his family prepare to leave the city when they learn that Britain and France have declared war on Germany. Relieved at the news, Szpilman stays in Warsaw with his family but when Poland surrenders, Warsaw falls under Nazi occupation. Jews are persecuted by the new government , stripped of privileges and forced to wear blue Star of David armbands. Szpilman and his family sell their belongings, including his piano, in order to survive. Szpilman and his family are forced from their home in late 1940 into the overcrowded Warsaw Ghetto where disease and starvation are rampant. Szpilman performs in a cafè frequented by upper-class Jews, who smuggle in forbidden goods to live comfortably. Spilzman witnesses a young boy savagely beaten by a guard and left for dead while attempting to escape the ghetto. The boy dies despite Szpilman's attempt to save him. Szpilman and his family also witness the SS murder an entire family in an apartment across the street during a round-up. Szpilman and his family are ordered transported to Treblinka extermination camp in August 1942 as part of Operation Reinhard . Jewish Ghetto Police separates Szpilman from his family at the railhead, allowing him to escape while his family is sent away to concentration camps. Szpilman becomes a slave laborer and learns of an upcoming Jewish revolt . He smuggles weapons into the ghetto and goes into hiding with help from Andrzej Bogucki and his wife Janina Godlewska. Szpilman watches the ghetto uprising unfold and fail in April 1943. When a female neighbor attempts to report Szpilman he obtains another hiding place in the German quarter from the husband of his friend Dorota. The new apartment has a piano which Szpilman refuses to play lest his identity be discovered. Szpilman suffers from malnourishment and jaundice , and after a final visit from Dorota and her husband, they provide a doctor to treat him. Szpilman recovers by August 1944 when the Warsaw Uprising begins. When Home Army forces attack the Schutzpolizei Hospital across the street from Szpilman's apartment building, his home is destroyed. Szpilman hides in the now abandoned hospital as Warsaw is destroyed in the fighting. When German troops attack the hospital with flamethrowers , Szpilman flees through the city's ruins and is discovered by Wehrmacht officer Wilm Hosenfeld , who learns he's a pianist. When Szpilman plays Chopin 's \" Ballade No. 1 in G minor \" on Hosenfeld's grand piano, the officer hides him in his house. When the Germans retreat from the Soviet offensive in January 1945, Hosenfeld promises Szpilman he'll listen to him on Polish Radio after the war, and leaves him a large supply of food and his greatcoat. After Warsaw is liberated, Szpilman is nearly killed by People's Army troops who mistake him for a German because of the coat. Hosenfeld is held after the war in a Soviet POW camp. When surviving concentration camp inmates abuse the prisoners, one laments his former career as a violinist. Hosenfeld asks if he knows Szpilman and the violinist promises to bring Szpilman as a character reference, but when they return to the site, Hosenfeld and the camp are gone. Szpilman resumes his career, performing Chopin's \" Grande polonaise \" with an orchestra to a large, prestigious audience. The end credits note Szpilman died in 2000 at the age of 88, while Hosenfeld died in Soviet captivity in 1952.",
  "wiki": "https://en.wikipedia.org/wiki/The_Pianist_(2002_film)"
}