{
  "year": "2003",
  "name": "Mystic River",
  "plot": "In 1975,  three childhood friends—Jimmy Markum, Sean Devine, and Dave Boyle—are playing on a Boston street in their Irish-American neighborhood when two predators posing as police officers abduct Dave. He is sexually assaulted for four days before managing to escape. One abductor dies before he can be prosecuted, and the other dies by suicide in prison. The trauma leaves Dave deeply scarred. Twenty-five years later, the men have grown apart. Jimmy, an ex-convict, now runs a neighborhood convenience store ; Sean is a Massachusetts State Police detective dealing with the recent departure of his pregnant wife, Lauren; and Dave, a blue-collar worker , still struggles with the psychological aftermath of his childhood abduction. Dave is married to Celeste, whose cousin Annabeth is Jimmy’s second wife, linking the men through family ties. Jimmy's teenage daughter Katie plans to elope to Las Vegas with Brendan Harris, the son of a man Jimmy despises. One night, Dave sees Katie at a bar. Later that evening, she is found murdered. That same night, Dave returns home bloodied and shaken, claiming to Celeste that he may have killed a mugger in self-defense . Sean and his partner, Whitey Powers, begin investigating the murder. Meanwhile, Jimmy conducts his own parallel inquiry using his connections. The detectives discover that the murder weapon is a .38 Special revolver tied to a 1984 liquor store robbery committed by Brendan’s father, “Just Ray” Harris, who has been missing since 1989. Brendan insists he knows nothing about the gun, though he claims Ray still sends the family money monthly. Suspicion grows around Dave as his story changes and his behavior becomes erratic. Celeste, increasingly afraid, eventually confides in Jimmy, believing Dave killed Katie. Jimmy and his associates invite Dave to a bar, get him drunk, and press him for a confession. Dave admits to killing someone that night—but says it was a child molester, not Katie. Jimmy does not believe him. When Dave falsely confesses under pressure, Jimmy stabs him to death and disposes of his body in the Mystic River . Concurrently, Brendan discovers that his mute younger brother, “Silent Ray,” and their friend John O’Shea were involved in Katie’s death as part of a prank that turned violent. He confronts them, but John pulls a gun. Before he can shoot, Sean and Whitey arrive and arrest both boys. The following morning, Sean informs Jimmy that Ray and John have confessed to Katie’s murder. He also reveals that Dave is wanted for the killing of a known child molester. Jimmy says nothing about his role in Dave’s death, merely thanking Sean for solving the case, and remarks, “If only you'd been a little faster.” Sean then pointedly asks whether Jimmy plans to send monthly payments to Celeste as well. Sean reconciles with his wife, Lauren, while Jimmy confesses to Annabeth, who tells him that he did what a \"king\" must do, no matter how difficult. During a neighborhood parade, Dave’s young son waits for his father, unaware of his fate. Sean spots Jimmy and makes a finger gun gesture, suggesting retribution may still come, while Jimmy responds with an indifferent shrug.",
  "wiki": "https://en.wikipedia.org/wiki/Mystic_River_(film)"
}