{
  "year": "2004",
  "name": "Sideways",
  "plot": "Miles Raymond picks up his friend Jack Cole at the home of Cole’s fiancée to begin a week together in advance of Cole’s wedding. Miles, a school teacher and unpublished author, starts the trip at his mother’s house, ostensibly to wish her a happy birthday, but Miles steals money before they leave. Miles wants to spend the week relaxing, playing golf, and enjoying good food and wine. However, Jack is interested in trying to cure Miles’ depression over his professional failures and divorce by finding him a sex partner. Jack is ambivalent over his pending marriage and the prospect of giving up his acting ambitions in favor of a job with his fiancée’s father. In the Santa Ynez valley, Miles, an oenophile , teaches Jack how to taste wine. The pair dine at The Hitching Post II . Jack infers that Maya, a waitress with whom Miles is casually acquainted, is interested in Miles. Jack tells Maya that Miles' manuscript has been accepted for publication, although it is only being considered. The next morning Jack announces his intention to find sex partners during the trip. That night, he arranges a double date for himself and Miles with a wine pourer named Stephanie, who is also acquainted with Maya. During the date, Miles gets drunk and telephones Victoria, his ex-wife, after learning from Jack that she has remarried and will be bringing her new husband to Jack's wedding. The couples go to Stephanie's house, where Stephanie and Jack adjourn to Stephanie's bedroom, leaving Miles and Maya alone. The two connect through their mutual interest in wine, and- after hearing Jack and Stephanie having sex through the wall- Miles kisses Maya awkwardly. As they part, Miles gives Maya a copy of his manuscript, which she had earlier expressed interest in reading. Jack claims to have fallen in love with Stephanie and tells Miles he wants to postpone the wedding and move to the Santa Ynez Valley to be closer to her. After spending time with Jack and Stephanie at wineries and a picnic, Miles and Maya return to Maya's apartment and have sex. The next day, Miles reveals to Maya that Jack is getting married. Disgusted with the men's dishonesty, Maya dumps Miles. Jack and Miles go to a winery that Miles finds subpar. After hearing from his literary agent that his manuscript has been rejected, an upset Miles pesters the pourer for a full glass of wine. When the server refuses, Miles drinks from the spit bucket , creating a scene. Jack intervenes and drives Miles back to the motel. Upon arrival, Stephanie, who heard from Maya about Jack's marital status, furiously beats Jack with her motorcycle helmet, breaking his nose, while berating him for his dishonesty. Miles takes Jack to the ER and leaves Maya an apologetic voice message, admitting that his book will not be published. That night, despite Miles' protests, Jack goes home with a waitress named Cammi. Jack returns to the motel naked after Cammi's husband had caught the two having sex. Jack begs Miles to help him retrieve his wallet, which contains custom wedding rings. Miles sneaks into the house, where he finds Cammi and her husband having sex. He grabs the wallet and runs, barely escaping Cammi's nude and furious husband. On the drive back to San Diego, Jack intentionally drives Miles's car into a tree to support his alibi that he broke his nose in a car accident. The pair return to Christine's home, where Jack is warmly received by her family. Following the wedding ceremony, Miles runs into Victoria and meets her new husband, Ken. Victoria says she is pregnant. Miles absconds before the reception and drives back to his San Diego apartment. Alone, he drinks his prized wine, a 1961 Château Cheval Blanc , from a disposable styrofoam soda cup at a fast-food restaurant. One day, Miles receives a voicemail from Maya, saying she loved his manuscript, encouraging him to keep writing, and inviting him to visit. Miles drives back to wine country and knocks on Maya's door.",
  "wiki": "https://en.wikipedia.org/wiki/Sideways"
}