{
  "year": "2004",
  "name": "Million Dollar Baby",
  "plot": "Maggie Fitzgerald, a waitress from the Ozarks , enters the Hit Pit, a rundown boxing gym in Los Angeles operated by Frankie Dunn. Frankie is a cantankerous Irish-American trainer estranged from his daughter. Maggie asks Frankie to train her, but he refuses because he does not want to train women and believes Maggie is too old. Eddie \"Scrap-Iron\" Dupris, Frankie's friend and the gym's handyman, allows her to train at the Hit Pit regardless. Frankie's prize prospect, \"Big Willie\" Little, signs with rival manager Mickey Mack after becoming impatient with Frankie rejecting offers for a championship bout, so Maggie gets her chance. With Frankie's coaching, Maggie fights her way up in the women's amateur boxing division. Since she has earned a reputation for quick knockouts, Frankie bribes managers to put their trainee fighters against her. Scrap, concerned when Frankie rejects several offers for big fights, arranges a meeting for Maggie with Mack, but out of loyalty to Frankie, she declines. Frankie bestows Maggie a Gaelic nickname embroidered on her boxing robe, Mo Cuishle , but does not tell her its meaning. The two travel to Europe as she continues to win. Maggie eventually saves enough of her winnings to buy her mother a house. Nevertheless, her mother berates Maggie for endangering her welfare checks, claiming everyone back home laughs at her. Frankie is finally willing to arrange a title fight. He secures Maggie a $1 million match in Las Vegas against the WBA women's welterweight champion, Billie \"The Blue Bear\" Osterman, a German ex-prostitute who has a reputation as a dirty fighter. Maggie begins to dominate the fight, but Billie knocks her out with an illegal sucker punch from behind after the bell rings to end the round. Maggie lands hard on her corner stool, breaking her neck and leaving her a ventilator-dependent quadriplegic . Frankie goes through the five stages of grief , seeking multiple doctors' opinions in denial, lashing out in anger at Scrap, and trying to bargain with God through prayer. He later apologizes to Scrap and blames himself for Maggie's injuries. Scrap tells him not to, as Maggie owes it to him for getting her shot at the world championship. While in the hospital, Maggie looks forward to her family's visit. They arrive late, having first toured Disneyland and Universal Studios Hollywood . Accompanied by an attorney, their sole concern is getting Maggie's assets transferred to them. Disgusted, she orders them to leave and threatens to report their welfare fraud if they try to contact her again. Maggie develops bedsores and undergoes an amputation for an infected leg. She asks Frankie to help her die, declaring that she has everything she wants out of life. A horrified Frankie refuses, so Maggie later bites her tongue in an attempt to bleed to death. Knowing the fatherly affection Frankie has developed for Maggie, Frankie's priest warns him that he will never find himself again if he goes through with Maggie's request. Frankie sneaks into the hospital one night, unaware that Scrap is watching from the shadows. Just before administering a fatal injection of adrenaline , he tells Maggie the meaning of \"mo cuishle\": \"my darling, and my blood\", then gives Maggie a final goodbye kiss. He leaves and retires from boxing altogether. Scrap writes to Frankie's daughter, informing her of her father's true character.",
  "wiki": "https://en.wikipedia.org/wiki/Million_Dollar_Baby"
}