{
  "year": "2005",
  "name": "Brokeback Mountain",
  "plot": "In Wyoming in 1963, cowboys Ennis Del Mar and Jack Twist are hired by rancher Joe Aguirre to herd his sheep through the summer on grazing pastures on Brokeback Mountain. After a night of heavy drinking, Jack makes a pass at Ennis. While initially reluctant, Ennis becomes receptive, and he and Jack have sex in their tent. Despite Ennis telling Jack that it was a one-time incident, they develop a sexual and emotional relationship. Near the end of their work contract, Ennis and Jack have a brawl that leaves both of them bloodied. Before parting ways, Ennis offhandedly laments that he left one of his shirts on the mountain. Ennis marries his longtime fiancée Alma Beers and they have two daughters: Alma Jr. and Jenny. Jack returns the next summer seeking work, but Aguirre, who observed Jack and Ennis engaging in homosexual activity on the mountain, tells him he has no work for guys who \"stem the rose\". Jack moves to Texas , where he meets rodeo rider Lureen Newsome, the daughter of a wealthy agricultural machinery manufacturer; they marry and have a son. After four years apart, Jack visits Ennis. Upon meeting, they kiss passionately, which a stunned Alma inadvertently sees. At a motel room, Jack wants them to create a life together, but Ennis refuses to abandon his family and is haunted by a childhood memory of his father showing him the body of a man who was tortured and killed for suspected homosexuality. Ennis and Jack meet infrequently for private fishing trips while their respective marriages deteriorate. Lureen abandons the rodeo and goes into business with her father, with Jack working in sales. Lureen's father has a strong dislike for Jack and openly disrespects and belittles him. Alma and Ennis divorce in 1975. Upon hearing about it, Jack drives to Wyoming and tells Ennis that they should live together, but Ennis refuses to move away from his children. Alma takes custody of Alma Jr. and Jenny, and marries Monroe, manager of the grocery store where she works. Ennis is invited to Thanksgiving dinner. While alone in the kitchen, Alma confronts Ennis about Jack. The two spar, causing Ennis to storm out and cease contact with Alma. Ennis has a brief romantic relationship with Cassie, a waitress. Jack and Lureen befriend Randall and Lashawn Malone, and it is implied that Jack and Randall have a brief affair. At the end of a tryst disguised as a fishing trip, Ennis says he cannot see Jack again for months due to work demands. The pair argue, before Jack embraces a crying Ennis. A postcard Ennis sent Jack is returned stamped with \"Deceased\". Ennis calls Jack's phone number. Lureen answers and says Jack died when a car tire exploded in his face. While hearing what happened, Ennis envisions men fatally beating Jack with a tire iron. Lureen says Jack requested his ashes be scattered on Brokeback Mountain. Ennis visits Jack's parents hoping to carry out his wish. Jack's father declares that Jack's ashes will be interred in a family plot. Jack's mother allows Ennis to visit Jack's old bedroom. Ennis finds the shirt he thought he left on the mountain, which Jack had secretly kept, nested inside one of Jack's shirts. Ennis embraces the shirts and silently weeps. Jack's mother allows him to keep them. Years later, an aging Ennis lives alone and reclusive in a trailer. His grown daughter, Alma Jr., visits him to announce her engagement to Kurt, who works in the oil fields. She asks for her father's blessing and invites him to the wedding. Ennis hesitates to come due to upcoming work commitments, then agrees to attend the wedding. As Alma Jr. leaves, she forgets her jacket, so Ennis puts it into the closet where the two shirts hang, Jack's shirt now inside Ennis's. Next to them, tacked to the closet door, is a postcard of Brokeback Mountain. With tears in his eyes, he stares at the mementos, and says, \"Jack, I swear...\"",
  "wiki": "https://en.wikipedia.org/wiki/Brokeback_Mountain"
}