{
  "year": "2006",
  "name": "Little Miss Sunshine",
  "plot": "Sheryl Hoover is a mother of two living in Albuquerque, New Mexico . Her husband Richard is an aspiring motivational speaker and life coach . Dwayne, Sheryl's Nietzsche -reading teenage son from a previous marriage, has taken a vow of silence until he accomplishes his dream of becoming a fighter pilot . Sheryl's older brother Frank, a gay scholar of Proust , is living with the family after having attempted suicide . Richard's profane father Edwin is also living with the family after being evicted from a retirement home for snorting heroin . Olive, Richard and Sheryl's young daughter, is an aspiring beauty queen coached by Edwin. Olive learns she has qualified for the \"Little Miss Sunshine\" beauty pageant being held in Redondo Beach, California , in two days. Richard, Sheryl, and Edwin want to support her, and Frank and Dwayne cannot be left alone, so the whole family attends. Due to financial constraints, they go on an 800-mile (1,300 km) road trip in their yellow Volkswagen van . Family tensions play out along the way, amidst the aging van's mechanical problems. When the van breaks down early on, the family learns that they must push it until it is moving at about 20 mph (32 km/h) before it is put into gear, at which point they have to run up to the side door and jump in. Later on, the van's horn starts honking unceasingly by itself, which leads to the family being pulled over by a state trooper. Throughout the trip, the family suffers numerous personal setbacks and discovers their need for each other's support. Richard loses an important contract that would have jump-started his motivational business. Frank embarrassingly encounters the ex-boyfriend who, in leaving him for an academic rival, had prompted his suicide attempt. Edwin fatally overdoses on heroin. When the grief counselor refuses to let the family leave his corpse at the hospital while they go to the pageant and return later, they smuggle it into the van, almost getting caught by the police. During the final leg of the trip, Dwayne discovers he is colorblind , meaning he cannot become a pilot. This revelation prompts him to finally break his silence and shout his disdain for his family, though he apologizes after Olive calms him with a hug. After a frantic race against the clock, with the body beginning to stink in the back, the family arrives at the pageant hotel. Sheryl prepares Olive for her performance while Richard is looking into arrangements for Edwin's body. As the pageant begins, Richard and Dwayne realize that the other contestants are slim, sexualized pre-teen girls who perform elaborate dance numbers with great panache. Knowing that the amateur Olive is certain to be humiliated, they try to talk her out of performing. Sheryl insists that they \"let Olive be Olive\", and Olive goes on stage. The hitherto-unseen dance routine Edwin had taught Olive is revealed to be a striptease performed to the Rocasound remix of Rick James ' \" Super Freak \". Olive's performance horrifies and angers most of the audience and organizers, who demand she be removed from the stage. However, before they can do so the members of the Hoover family join Olive on stage and dance alongside her to show their support. The family is later released from the hotel's security office on the condition that Olive never enters a beauty pageant in California again. Piling into the van with the horn still honking, they happily smash through the barrier of the hotel's toll booth and begin their trip back home to Albuquerque.",
  "wiki": "https://en.wikipedia.org/wiki/Little_Miss_Sunshine"
}