{
  "year": "2006",
  "name": "The Departed",
  "plot": "In the 1980s in Boston , Irish Mob boss Frank Costello introduces himself to a young Colin Sullivan. Many years later, Sullivan has been groomed as a spy inside the Massachusetts State Police (MSP) and joins the Special Investigation Unit (SIU). Another police academy recruit, Billy Costigan, is selected by Captain Queenan and Sergeant Dignam to go undercover as a criminal and infiltrate Costello's crew. Costigan serves a term in prison for his cover and further commits several crimes, drawing Costello's attention. Sullivan begins dating police psychiatrist Madolyn Madden. Costigan manages to get Costello to recruit him into his organization. Over the next year, Costigan becomes increasingly involved. His mental state declines, but Queenan and Dignam convince him to continue. Costigan begins seeing Madden for his court-ordered therapy. The MSP and Costello both realize they have moles in their respective organizations and task Costigan and Sullivan to find them. Meanwhile, Costigan learns that Costello is a protected FBI informant , sharing his discovery with Queenan. He and Madden have an affair. One night, Costigan follows Costello into an adult theater and witnesses him giving Sullivan an envelope containing information on his crew. Costigan is instructed to get a visual ID of Sullivan but is unsuccessful. When Sullivan realizes he is being followed, he stabs a man, mistaking him for Costigan, and flees. Costigan, fearing Costello will soon discover and kill him for being the mole, calls Queenan to end the undercover operation, but Sullivan has Queenan followed, lying to the other officers that Queenan may be the spy. Sullivan also calls Costello's gang to inform them of the meeting. When Costello's men arrive, Queenan helps Costigan escape before being thrown from the building to his death. This causes a firefight between the police and Costello's men. In the wake of Queenan's murder, both men (Dignam and Sullivan) fight and Dignam is suspended. Timothy Delahunt, one of Costello's henchmen wounded in the gunfight, tells Costigan that he knows he is the mole before succumbing to his wounds. Looking through Queenan's belongings, Sullivan discovers Costello is an FBI informant. A news report reveals that Delahunt was a Boston Police Department undercover officer, but Costello suspects it is a false claim so he would stop looking for the mole. Deciding to turn on him, Sullivan directs the MSP to tail Costello, and a gunfight erupts, killing most of Costello's crew. Sullivan confronts a wounded Costello, who admits to being an FBI informant. They exchange gunfire, and Sullivan kills him. His assignment finished, Costigan goes to Sullivan to reveal his undercover status, unaware he is another mole. After Sullivan leaves the room, Costigan recognises the envelope from the theater on his desk. Realizing Sullivan was Costello's mole, Costigan escapes. When Sullivan finds Costigan gone, he realizes Costigan has discovered the truth and deletes Costigan's records from police computers. Costigan visits Madden, who has told Sullivan but not Costigan she's pregnant, knowing that Sullivan may not be the father, and hands her an envelope, instructing her to open it if something happens to him. Madden finds an envelope in the mail from Costigan to Sullivan containing a CD of Costello's recorded conversations with Sullivan. Fearing Costigan has revealed their affair, she listens to it and leaves Sullivan. Costigan arranges to meet Sullivan on the same rooftop where Queenan was killed, then arrests him. Costigan calls Trooper Brown, an acquaintance from the police academy, but Brown pulls a gun on him when he arrives, unsure who to believe. Saying he has evidence tying Sullivan to Costello, Brown lets Costigan take the elevator. Upon reaching the lobby, Costigan is shot dead by Trooper Barrigan, a friend of Sullivan's who is another of Costello's spies. Brown reaches the lobby but is also killed by Barrigan. Sullivan shoots Barrigan dead, so that he can frame him as the only mole. At Costigan's funeral, Sullivan notices Madden silently crying. He realizes they were involved, but when he attempts to talk to her about the baby, she ignores him. Later, when Sullivan arrives home, Dignam is waiting for him, and, after Sullivan indifferently accepts his fate, Dignam shoots him in the head, killing him before leaving.",
  "wiki": "https://en.wikipedia.org/wiki/The_Departed"
}