{
  "year": "2007",
  "name": "Michael Clayton",
  "plot": "Michael Clayton is a \" fixer \" for a prestigious New York City law firm. One night, Michael leaves a poker game to attend to a client in Westchester County. Driving home, Michael sees horses standing at the top of a hill near leafless trees. He gets out of his car and approaches them. Behind him, a bomb detonates in his car. Four days earlier, the firm dispatched Clayton to deal with a crisis created when Arthur Edens, one of the firm's litigators, suffered a manic episode in the middle of a deposition . Edens had been conducting the defense of U-North, an agricultural conglomerate , in a six-year-long three-billion-dollar class action lawsuit, which his outburst was designed to jeopardize. Michael bails Arthur out of jail in Milwaukee and learns Arthur is no longer taking his medication. Michael's son Henry speaks with Arthur after Arthur answers Michael's phone. Henry tells Arthur about a chapter in a fantasy book, Realm & Conquest , that concerns the summoning of heroes to their destiny, which Arthur interprets as a sign to continue undermining U-North. Arthur escapes from his hotel room and returns to New York. Michael approaches Marty Bach, the firm's managing partner , requesting a loan to cover a failed investment in a restaurant Michael made with his ne'er-do-well brother, Timmy. Marty suggests Michael will be rewarded if he can get Arthur back on track but warns the firm will be finished if he fails. Karen Crowder, U-North's general counsel , discovers that Arthur has a confidential U-North memo proving the company knew its weed killer did in fact cause the hundreds of deaths that sparked the lawsuit. U-North CEO Don Jeffries, whose signature is on the memo, puts Crowder in contact with two operatives, who follow Arthur and bug his apartment and phone. Michael finds Arthur on a Manhattan street and confronts him about calls he made to Anna Kaiserson, the plaintiff being deposed during his episode, leading Arthur to realize his calls are monitored. Arthur calls his own voicemail at the firm and says he will go public with the memo. Karen directs the operatives to take lethal action. The two break into Arthur's apartment, murder him with an injection, and make it look like suicide by drug overdose. Michael learns of Arthur's death and becomes suspicious when he discovers U-North was planning a settlement just a few days before, and that Arthur had booked a flight to New York for Anna. He finds Anna and learns that she told no one of her conversations with Arthur, yet the firm somehow knew. With help from his brother Gene, a police officer, Michael breaks into Arthur's apartment, which is sealed as a crime scene. Michael finds Arthur's dogeared copy of Realm & Conquest , which contains an illustration of a horse on a hill with barren trees, and highlighting and annotations throughout the chapter Henry mentioned. The book also contains a receipt from a photocopy shop, which Michael pockets. Two police officers soon arrive on a tip from the operatives, who have been trailing Michael. Michael is arrested, but Gene bails him out. Taking the receipt to the copy shop, Michael discovers that Arthur ordered 3,000 copies of the incriminating memo. Marty offers Michael the money he requested, but insists Michael also sign a non-disclosure agreement covering his vast knowledge of the firm and its personnel. Michael accepts the money, gives up on pursuing Arthur's lead, and pays off his restaurant debt. That night, during the events depicted at the film's opening, the operatives rig Michael's car with a bomb and follow him through Westchester. After he approaches the horses on the hill, the operatives detonate his car. Michael hides with Timmy's help. At a U-North board meeting, Karen proposes that the board approve a lawsuit settlement. Michael confronts her alone and goads her into offering him $10 million for his silence. When Karen agrees, Michael reveals he is wearing a wire , with Gene and other NYPD detectives listening. As the police move in, Michael gets into a cab and rides away.",
  "wiki": "https://en.wikipedia.org/wiki/Michael_Clayton_(film)"
}