{
  "year": "2007",
  "name": "No Country for Old Men",
  "plot": "In 1980, hitman Anton Chigurh is arrested in Texas. He escapes by strangling the sheriff's deputy and steals a car by killing the driver with a captive bolt pistol . Later, he spares the life of a gas station owner for correctly calling a coin toss . Meanwhile, Llewelyn Moss is hunting pronghorns in the desert. He comes across the aftermath of a drug deal gone wrong, finding several dead men, a wounded Mexican man begging for water, drugs in a truck, and a briefcase containing $2 million in cash. He takes the briefcase and returns home. Feeling guilty, he returns with water that night but finds the man has been murdered. He looks up to the ridge and sees two men with guns who pursue him in a truck. He escapes by diving into a river. After making his way back home, Moss sends his wife, Carla Jean, to stay with her mother. Chigurh is hired to recover the missing money; meanwhile, Terrell County Sheriff Ed Tom Bell begins investigating the failed drug deal. Chigurh searches Moss' trailer home, using his bolt pistol to blow out the door lock. Moss takes a taxi to a motel in Del Rio , where he hides the briefcase in his room's air duct. After Moss returns to the motel after purchasing new boots, he sees the curtains in his room in a different position from when he left, and rightly assumes he has been found. Following a tracking device hidden in the case, Chigurh goes to Moss' motel and kills three Mexican mobsters who were waiting for Moss in his room. Moss has rented a second room adjacent to his first room with access to the duct where the money is hidden. He retrieves the briefcase before Chigurh opens the duct. Moving to a hotel in the border town of Eagle Pass , Moss discovers the tracking device, but Chigurh has already found him. Their firefight spills onto the streets, badly wounding both and killing a truck driver. Moss flees to Mexico, hiding the case along the Rio Grande . Chigurh cleans and stitches his wounds with stolen supplies. Carson Wells, a bounty hunter , visits a wounded Moss in a Mexican hospital, and offers protection from Chigurh in exchange for the money, but Moss refuses. Chigurh ambushes Wells at his hotel. The phone rings as Wells is bartering for his life. Chigurh shoots him and takes the call from Moss, vowing to kill Carla Jean unless Moss gives up the money. Moss retrieves the case from the Rio Grande and arranges to meet Carla Jean at a motel in El Paso , where he plans to give her the money and hide her from danger. Carla Jean's mother unknowingly reveals Moss' location to a group of Mexicans tailing them. Bell reaches the motel in El Paso, only to find that the Mexicans have killed Moss. Carla Jean arrives later and weeps when Bell somberly removes his hat. Bell visits his cousin Ellis and tells him he plans to retire because he feels overmatched by the recent violence. Ellis tells Bell that he cannot evade fate, and only vanity makes him think otherwise. That night, Bell returns to the crime scene and sees the lock blown out. Chigurh appears to be on the other side of the door holding his shotgun. Bell hesitantly enters and finds the room empty, and notices that the room's air duct has been opened. Carla Jean returns from her mother's funeral to find Chigurh waiting in her bedroom. Chigurh says he must fulfill his vow, but offers a coin toss as a compromise. Carla Jean refuses to call it, saying that he will be responsible for her fate. Chigurh checks the soles of his boots as he leaves the house. As he drives through the neighborhood, another car crashes into him, breaking his arm. He pays a passing boy for the shirt off his back to use as a sling, and limps away. Now retired, Bell shares two dreams with his wife. In the first, he lost some money his father had given him. In the other, as he rode horseback through a snowy mountain pass, his father rode past him carrying fire in a horn, and he knew his father would prepare a campfire ahead for both of them.",
  "wiki": "https://en.wikipedia.org/wiki/No_Country_for_Old_Men"
}