{
  "year": "2007",
  "name": "There Will Be Blood",
  "plot": "In 1898, Daniel Plainview finds silver while prospecting in New Mexico but breaks his leg. Dragging himself from the pit, he takes a sample to an assay office and receives a silver and gold claim . In 1902, he discovers oil in California . Following the death of a worker in an accident, Daniel adopts the man's orphaned son, H.W., who becomes his partner, allowing Daniel to present himself as a family man. In 1911, Daniel is approached by Paul Sunday, a young man who tells him of an oil deposit in Little Boston. Daniel visits the Sundays' property in Little Boston and meets Paul's twin brother Eli, a preacher. Daniel attempts to purchase the farm from the Sundays at a bargain price under the ruse of using it to hunt quail, but his motives are questioned by Eli, who knows the land has oil. In exchange for the property, Eli demands $5,000 for his church. An agreement is made and Daniel acquires all the available land in and around the Sunday property, except for the land owned by one holdout, William Bandy. After Daniel reneges on an agreement to let Eli bless the well before drilling begins, a series of misfortunes occurs: an accident kills one worker and a gas blowout deafens H.W. and destroys the drilling infrastructure. When Eli publicly demands the money still owed to him, Daniel beats and humiliates him. At the dinner table that night, Eli attacks and berates his father for having trusted Daniel. A man arrives at Daniel's doorstep, claiming to be his half-brother, Henry. Later that night, H.W. sets fire to their house, intending to kill Henry. Daniel sends H.W. to a school for the deaf in San Francisco. Standard Oil offers to buy out Daniel's local interests, but Daniel refuses and instead strikes a deal with Union Oil to build a pipeline. However, Bandy's ranch remains an impediment. Daniel becomes suspicious of Henry after he fails to recognize a childhood joke and confronts him one night at gunpoint. \"Henry\" confesses that he was a friend of the real Henry, who died of tuberculosis , and that he had impersonated Henry in the hope that Daniel could give him a job. An enraged Daniel murders him and buries his body. After looking through the real Henry's journal that the imposter Henry had with him while traveling to meet him, Daniel drinks and weeps. The next morning, Daniel is awakened by Bandy, who knows of Daniel's crime and wants him to publicly repent in Eli's church in exchange for an easement to run his pipeline across the ranch. As part of his baptism , Eli humiliates Daniel and coerces him into confessing that he abandoned his child. Later, while the pipeline is being built, H.W. reunites with Daniel and Eli becomes a missionary. In 1927, H.W. marries Paul and Eli's sister Mary. Daniel, now extremely wealthy but an alcoholic, lives alone in a large mansion. H.W. asks his father to dissolve their partnership so that he can move to Mexico with Mary and start his own drilling company. Daniel angrily mocks H.W.'s deafness before revealing his true origins and disowning him as his son. H.W. finally leaves after thanking God he is not related to Daniel. Eli, now a radio preacher, visits a drunken Daniel in the bowling alley in his basement. Eli asks Daniel to partner with the church in drilling Bandy's property. Daniel agrees on the condition that Eli denounce his faith. Once Eli acquiesces, Daniel reveals that he already drained the property of its oil supply by capture and taunts Eli for his misfortune. Daniel torments Eli further by telling him a lie about how he gave his brother $10,000 instead and is now a wealthy man. He chases Eli around the alley and bludgeons him to death with a bowling pin. When his butler appears to investigate the commotion, Daniel announces, \"I'm finished.\"",
  "wiki": "https://en.wikipedia.org/wiki/There_Will_Be_Blood"
}