{
  "year": "2007",
  "name": "Juno",
  "plot": "In Elk River, Minnesota , 16-year-old high-schooler Juno MacGuff discovers she is pregnant after sleeping with her friend and longtime admirer Paulie Bleeker. Originally intending to get an abortion , Juno visits a local women's clinic and encounters a schoolmate outside, who is holding a one-person anti-abortion vigil. Once inside, Juno finds herself unable to go through with the procedure and decides to give the baby up for adoption. With the help of her friend Leah, Juno searches the ads in the Pennysaver and finds a childless married couple she feels will provide a suitable home. She informs her father Mac and stepmother Bren of the pregnancy and her plan and they offer Juno their support. With Mac, Juno meets the couple, Mark and Vanessa Loring, in their expensive Saint Cloud home, and agrees to a closed adoption . Mark works at home composing commercial jingles, having abandoned his rock band youth, which is now confined to memorabilia displayed in a single room of the house that Vanessa has designated for his personal belongings. Juno learns that she and Mark share tastes in punk rock and horror films, and starts visiting him frequently to hang out. One day, Juno and Leah run into Vanessa at the mall, where they watch her interact with children, looking completely content and in her element. Juno encourages Vanessa to talk to the baby in Juno's womb, which kicks for Vanessa. As the pregnancy progresses, Juno struggles with her feelings for Paulie, whom she has maintained an outwardly indifferent attitude towards, but jealously confronts after learning he has asked another girl to the upcoming prom. Paulie reminds Juno that she requested they remain distant, and tells her she broke his heart. Shortly before her due date, Juno visits Mark again. Their interaction becomes emotional, culminating in Mark confiding that he plans on leaving Vanessa to figure his life out. Distraught by this, Juno implores him to change his mind. Mark questions her feelings for him and the intent behind her regular visits, revealing he is starting to develop an attraction to her. When Vanessa arrives home, Mark admits that he does not feel ready to be a father. Juno drives away and breaks down in tears by the side of the road. She then returns to the Lorings' home and leaves a note on the front porch. After a heartfelt discussion with her father, Juno accepts that she is in love with Paulie. She confesses her feelings to him, and they share a kiss. Not long after, Juno goes into labor and is rushed to the hospital, where she gives birth to a baby boy. Despite having deliberately not told Paulie because of his track meet, he deduces that she is giving birth anyways after seeing her missing from the stands and rushes to the hospital, where he comforts her as she cries. Vanessa comes to the hospital and joyfully claims the newborn boy as a single adoptive mother. On the wall in the baby's new nursery, Vanessa has framed Juno's note, which reads: \"Vanessa: If you're still in, I'm still in. —Juno.\" The film ends in the summertime with Juno and Paulie, now in a happy relationship, playing guitar and singing together.",
  "wiki": "https://en.wikipedia.org/wiki/Juno_(film)"
}