{
  "year": "2008",
  "name": "The Reader",
  "plot": "In 1958, 15-year-old Michael Berg becomes sick on a tram ride in an unnamed provincial city. He is helped by 36-year-old tram conductor Hanna Schmitz. Weeks later, Michael has recovered from scarlet fever and at his mother's insistence, he visits Hanna with flowers to thank her for her help. They proceed to have a secret summer love affair, and Hanna often asks Michael to read to her. They have a brief cycling holiday in the country where Michael starts to notice some oddities in Hanna's behaviour. However, as their sexual relationship deepens it grows more tumultuous, when his attempts to form a deeper connection are rebuffed by her secretive nature. As a good reliable worker, Hanna is soon promoted, whereupon she abruptly quits without explanation. Michael visits Hanna to apologize following an argument, but is utterly befuddled and devastated to find her apartment vacant. In 1966, Michael is a student at Heidelberg University Law School and observes a war crime trial of several former female SS guards accused of letting 300 Jewish women and children perish in a burning church during a death march near Kraków in Poland . Michael is horrified to learn Hanna is one of the defendants. Survivor Ilana Mather provides testimony, including that Hanna forced some of the prisoners to read to her. Hanna admits that she and the co-defendants each chose ten women monthly for extermination at Auschwitz in Nazi-occupied Poland. Ilana's mother Rose testifies that when the church caught fire during a bombing, the guards refused to unlock the doors. The official SS report stated the guards did not know about the fire until the following day. Hanna reveals the guards in fact kept the doors locked so that the prisoners could not escape. Hanna's co-defendants all state she was in command and wrote the report. Hanna denies this, insisting they agreed on the contents of the report together. When the lead judge asks for a handwriting sample, Hanna quickly condemns herself by admitting she authored the report alone. Recalling their time together, Michael is initially confounded by her testimony, finally deducing that Hanna is deeply ashamed of being illiterate . Michael informs his law professor, who states that Michael should inform the court. Deeply conflicted, Michael attempts to visit Hanna in prison, but changes his mind. Hanna receives a sentence of life imprisonment , while her co-defendants are sentenced to just over four years each. Michael attempts to move on, though haunted by the memories of a relationship that he cannot put to rest. He marries and has a daughter, however, Michael cannot commit fully to the relationship and grows distant from his family, culminating in divorce and estrangement from his daughter, Julia. Throughout the 1980s, Michael records himself on tape reading various books and regularly mails them to Hanna. Borrowing the same books from the prison library, Hanna slowly teaches herself to read and write. She starts writing to Michael, but he never replies. In 1988, a prison official requests Michael's help with Hanna's parole as he has been the only person outside prison to have had contact with her. Michael finally visits Hanna, revealing in the stilted reunion that he has secured her a residence and a job. When Michael arrives for Hanna's release, he is told she hanged herself in her cell and left a crude will asking Michael to give her money to Ilana Mather. Michael finds Ilana in New York City , revealing his connection to Hanna and its long-lasting impact. He tells Ilana about Hanna's illiteracy, but she rebuffs this and refuses to forgive Hanna. Michael gives her Hanna's tea tin filled with cash, but Ilana refuses the money. He suggests it be donated to a Jewish literacy organization in Hanna's name and Ilana agrees. She keeps the tin, placing it next to a photograph of her deceased family. The film ends in 1995 with Michael driving Julia to Hanna's grave, telling her their story.",
  "wiki": "https://en.wikipedia.org/wiki/The_Reader_(2008_film)"
}