{
  "year": "2008",
  "name": "Frost/Nixon",
  "plot": "After the Watergate scandal of 1972–74, 400 million people worldwide watch on television as former United States President Richard Nixon departs the White House aboard Marine One following his resignation . British talk show host David Frost watches from Australia and is inspired to pursue an interview with Nixon. Irving Lazar , Nixon's agent, believes the interviews would allow Nixon to salvage his reputation and profit financially. Nixon agrees to a deal with Frost. Frost persuades his friend and producer John Birt of the interviews' potential for success and they fly to California to meet Nixon. Frost flirts with Caroline Cushing on the flight, and a relationship develops. Unable to sell the interviews to American networks, Frost finances the project with private money, brokering deals with advertisers and local television stations to syndicate the interviews. Bob Zelnick and Jim Reston are hired to help Frost research and prepare. Reston presses Frost to prioritize getting a confession from Nixon about Watergate. Under scrutiny by Nixon's chief of staff, Jack Brennan , Frost and Nixon embark on the first three recording sessions. Frost is restricted by time limits and allows Nixon to dominates the sessions regarding the Vietnam War and foreign policy. Frost's team questions his abilities, angry that Nixon has been permitted to rehabilitate his tarnished image. Frost is distracted by poor sponsorship and the cancellation of his talk show in London . Four days before the final interview, on Watergate, Frost receives a phone call from an inebriated Nixon who declares they both know the final interview will make or break their careers. He compares himself to Frost, insisting they both came from humble backgrounds and struggled to reach the top of their fields. Nixon assures Frost he considers the final interview a battle, that he will win. The conversation energizes Frost who works relentlessly to prepare. Reston puts aside his criticism of Frost to pursue a lead at the Federal Courthouse library in Washington . Frost ambushes Nixon in the final interview with damning transcripts of a conversation with Charles Colson that Reston procured. To his team's horror, Nixon admits that he did unethical things, adding, \"When the President does it, that means it's not illegal.\" A stunned Frost is on the verge of obtaining a confession when Brennan disrupts the recording. When the interview resumes, Frost returns to his original line of questioning and Nixon admits he participated in a cover-up and \"let the American people down.\" After the interviews have aired, Frost and Cushing pay a farewell visit to Nixon and the two man graciously thank each other. Frost gives Nixon a pair of Italian shoes identical to the ones Frost wore during the interviews that Nixon had admired. In a private moment, Nixon asks about the night he drunkenly called Frost, implying that he has no recollection of the event. For the first time, Nixon addresses Frost by his first name. Nixon watches Frost and Cushing leave before placing the shoes on the villa's stone railing and solemnly looking out at the sunset. A textual epilogue states that the interviews were wildly successful and that Nixon never escaped controversy until his death from a stroke in 1994 .",
  "wiki": "https://en.wikipedia.org/wiki/Frost/Nixon_(film)"
}