{
  "year": "2009",
  "name": "Precious: Based on the Novel \"Push\" by Sapphire",
  "plot": "In 1987, 16-year-old Claireece Precious Jones lives in New York City 's Harlem neighborhood with her unemployed mother, Mary, who has long subjected her to physical , sexual , and verbal abuse . Precious has also been raped by her now-absent father, Carl, resulting in two pregnancies. The family resides in a Section 8 tenement and survives on welfare . Precious's first child, a daughter named \"Mongo\", short for Mongoloid , has Down syndrome and is being cared for by Precious's grandmother, while Mary forces the family to pretend that Mongo lives with her and Precious so she can receive extra money from the government. When Precious's second pregnancy is discovered, her junior high principal, Mrs. Lichtenstein, arranges for her to attend an alternative school program called Each One Teach One , where she hopes Precious can change her life's direction. Precious finds a way out of her traumatic daily life by escaping into daydreams in which she is loved and appreciated. Despite her mother's insistence that Precious apply for welfare, Precious goes to the location of the alternative school and enrolls. She meets her new teacher, Ms. Blu Rain, as well as several other girls who all come from troubled backgrounds and are looking to get their GED to advance their educations. Precious's life begins to turn around when she slowly starts to learn to read and write with the help of Ms. Rain and finds herself inspired by her. While she learns, she starts to meet with social worker Ms. Weiss, who learns about the sexual assault in the household when Precious accidentally reveals who fathered her children. One day, while telling a story in class, Precious's water breaks, and she is rushed to the hospital. She gives birth to a healthy son named Abdul and is acquainted with a kind nursing assistant named John McFadden. While in the hospital, Precious writes letters to Ms. Rain through her notebook that is taken to and from her by Joann, one of the girls in her class. Once discharged from the hospital, Precious returns home to find Mary waiting for her. Mary asks to hold Abdul, but deliberately drops him before attacking Precious, angrily declaring Precious's revelation about the abuse has resulted in the termination of welfare payments. Precious throws Mary against a wall, retrieves Abdul, and after falling down the stairs and narrowly avoiding Mary deliberately dropping her television set on them from the top of the stairwell, she flees the apartment and eventually breaks into her school classroom for shelter. When Ms. Rain discovers Precious and Abdul sleeping the next morning, she frantically calls local shelters in search of a safe place for Precious and Abdul to live, but they end up staying with Ms. Rain and her live-in girlfriend for the holiday. The next morning, Ms. Rain takes Precious and Abdul to find assistance, and Precious is able to continue her schooling while raising Abdul in a halfway house . Mary soon returns to inform Precious of her father's death from AIDS . Precious later learns that she is HIV-positive , though Abdul is not. Feeling dejected, Precious distracts Ms. Weiss and steals her case file from her office. As she shares the details of her file with her fellow students, she begins to hope for the future. Later, Precious meets with her mother, who brings Mongo to Ms. Weiss's office. Ms. Weiss confronts Mary about her and Carl's abuse of Precious, going back to when Precious was a toddler. Mary tearfully confesses that she always hated Precious for \"stealing her man\" by \"letting him\" abuse her and for eventually \"making him leave.\" Precious tells Mary that she finally sees her for who she really is and severs ties with her, leaving with both Mongo and Abdul, telling her mother she will never see her again and will never find her and her children. Mary begs Ms. Weiss to retrieve her daughter and grandchildren, but a shocked and shaken Ms. Weiss silently rejects her and walks away, leaving Mary distraught. Planning to complete a GED test to receive a high-school diploma equivalency, followed by college, Precious walks into the city with her children, ready to start a new life with a brighter future.",
  "wiki": "https://en.wikipedia.org/wiki/Precious_(film)"
}