{
  "year": "2009",
  "name": "Up",
  "plot": "Ten-year-old Carl Fredricksen idolizes famed explorer Charles Muntz, who is discredited when a giant bird skeleton he brought back from Paradise Falls in South America is deemed fake. Muntz travels back to the falls, vowing not to return until he brings back a live specimen. Carl befriends Ellie, another young Muntz fan, who keeps a scrapbook of her adventures and dreams of moving her \"clubhouse\" (an abandoned house) to Paradise Falls and having adventures of her own. Carl and Ellie eventually marry, renovate the clubhouse and move in. They work at the city zoo as a balloon salesman and zookeeper, respectively. Ellie suffers a miscarriage , [ 5 ] and they learn they cannot have children. The couple saves money for a trip to Paradise Falls, but are repeatedly forced to spend their savings on more pressing needs. Many years later, a now elderly Carl decides to surprise Ellie with tickets to South America, but she falls ill and is hospitalized, giving Carl her scrapbook before she dies. Now in his late 70s, [ 6 ] Carl holds out while the neighborhood around him is redeveloped . After unintentionally injuring a construction worker, Carl is ordered by a court to move into an assisted living facility . However, Carl resolves to keep his promise to Ellie to move their house to Paradise Falls and attaches thousands of balloons to it in order to fly there. Russell, a young \"Wilderness Explorer\" scout attempting to earn his final merit badge for assisting the elderly, becomes an accidental stowaway. Before Carl can land and send Russell home, a storm propels the house all the way to South America. The house lands on a tepui opposite Paradise Falls. Carl and Russell harness themselves to the still-buoyant house and tow it across the mesa. Along the way, they encounter a giant flightless bird that Russell names Kevin (despite the fact that it is actually female) and Dug, a Golden Retriever whose collar has a device that translates his thoughts into human speech. After failed attempts to evade the animals, Carl reluctantly allows both to join the party. A pack of dogs, all wearing collar translators, surrounds them. The dogs' master is revealed to be an elderly Charles Muntz, who invites Carl and Russell aboard his airship and discusses his quest to capture a bird. However, Carl's initial excitement over meeting him fades as he realizes that Muntz's obsession has driven him insane. After Muntz shows them the bird skeleton, Russell notes its resemblance to Kevin. Becoming hostile, Muntz reveals that he has murdered other travelers he suspected of also seeking the bird. Carl, Russell and Dug flee, pursued by Muntz's dogs; they are rescued by Kevin, who gets injured in the process. Hearing Kevin call out to her chicks, Carl agrees to take her home. However, Muntz captures her and starts a fire beneath Carl's home. Forced to choose, Carl saves his home, allowing Muntz to take Kevin away and losing Russell's respect. Disheartened, Carl looks through his wife's scrapbook and discovers that she had filled in blank pages with photos of their life together and written \"Thanks for the adventure – now go have a new one!\". Reinvigorated, he goes outside, only to see Russell flying after Kevin using balloons and a leaf blower . Carl lightens his house by emptying it completely, enabling it to fly again. Russell arrives at Muntz's airship but is caught. Carl and Dug, the latter of whom stowed away, board the dirigible and free him and Kevin. Muntz pursues them and traps Russell, Kevin, and Dug inside the house, but Carl saves them just as the tether breaks. Muntz leaps after them, but gets his leg tangled in balloon strings and falls to his death. Carl's house, having lost several balloons, descends out of sight beneath the clouds. Carl and Russell reunite Kevin with her chicks before returning home to the United States in Muntz's airship. Russell receives his badge for assisting the elderly, and Carl presents Russell with a bottle cap Ellie gave Carl when they first met as kids years ago, which he dubs \"The Ellie Badge\". Meanwhile, unbeknownst to Carl, his house has landed on the cliff overlooking Paradise Falls, fulfilling his promise to Ellie.",
  "wiki": "https://en.wikipedia.org/wiki/Up_(2009_film)"
}