{
  "year": "2009",
  "name": "District 9",
  "plot": "In 1982, an enormous extraterrestrial spaceship arrives and hovers over the South African city of Johannesburg . Inside, an investigation team finds over a million malnourished insect-like aliens, and the South African government relocates them to a camp called District 9 . Over the years, District 9 becomes a slum, and locals come to view the aliens—derogatorily called \" Prawns \"—as filthy, violent animals who bleed resources from humans. Following unrest between the aliens and locals, the government hires Multinational United (MNU), a large defense contractor, to relocate the aliens to a new camp outside the city. Piet Smit, an MNU executive, appoints his son-in-law and MNU bureaucrat, Wikus van de Merwe, to lead the relocation. Meanwhile, three aliens named Christopher Johnson, his young son CJ, and his friend Paul search a District 9 garbage dump for Prawn technology; Christopher has spent the last 20 years synthesizing fuel from their contents. They finally fill an entire container in Paul's shack as the relocation begins, but when Wikus comes to serve Paul a notice, he finds the hidden container and accidentally sprays some fuel into his face. Koobus Venter, a cruel MNU mercenary, kills Paul. Wikus begins mutating into a Prawn, starting with his left arm that was injured after the exposure. He is taken to an underground MNU lab, where researchers discover his hybrid DNA grants Wikus the ability to operate Prawn weaponry, which is biologically restricted from humans. Seeing the potential for profitable weapons research, Smit orders Wikus' body to be harvested for genetic material. Wikus, however, overpowers the lab personnel and escapes. While Venter's forces hunt him, a fake news story is broadcast claiming Wikus is a wanted fugitive, who has contracted a contagious disease from copulating with aliens. Wikus takes refuge in District 9 , finding Christopher and the spaceship's command module dropship concealed underneath his shack. Christopher explains that the confiscated fuel is needed to reactivate the dropship, which can then dock with the mothership. This would allow Christopher to rescue his people and return home, and cure Wikus with the equipment onboard. Encouraged by a phone call from his wife, Tania, Wikus steals powerful alien weapons from Obesandjo, a Nigerian crime lord who believes eating Wikus' alien arm will grant him alien abilities. Wikus and Christopher attack MNU and reach the underground lab, where Christopher is horrified by the brutal experiments MNU has performed on his people. After seeing what MNU has done to his own kind, Christopher's priorities change. Christopher decides that he needs to get his people off of Earth immediately, and as a result, it will take more time for him to cure Wikus' condition. Enraged, Wikus knocks Christopher unconscious and attempts to fly the module to the mothership, but Venter has it shot down. Venter captures Wikus and Christopher, but Obesandjo's gang ambushes them and abduct Wikus. CJ, who remained hidden in the dropship, remotely activates the mothership and a large robotic alien battle suit in Obesandjo's base. The suit guns down the Nigerians; Wikus enters the suit and rescues Christopher from the mercenaries. Heading towards the dropship, the two come under heavy fire; Wikus decides to stay behind and fend off the mercenaries, buying time for Christopher to escape, who promises to return in three years and cure Wikus. After all of the other mercenaries are killed, Venter finally cripples the suit, but several Prawns kill and dismember him before he can execute Wikus. Christopher makes it into the dropship with CJ, and the dropship is levitated via a tractor beam back into the mothership, which finally leaves Earth. Wikus disappears, MNU's experiments are exposed to the public, and the aliens are moved to a new camp named District 10 . Tania finds a handcrafted metal flower on her doorstep, giving her hope that Wikus is still alive. Wikus, now fully transformed into a Prawn, is shown in a junkyard crafting more flowers for his wife.",
  "wiki": "https://en.wikipedia.org/wiki/District_9"
}