{
  "year": "2009",
  "name": "An Education",
  "plot": "In 1961 London, Jenny Mellor is a bright and attractive 16-year-old schoolgirl who aspires to attend the University of Oxford . Her studies are controlled by her strict father, Jack. After youth orchestra rehearsals, Jenny waits at a bus stop on the street in heavy rain when David Goldman, an older man, stops his Bristol 405 and tells her that he is a music lover and is worried about her cello getting wet. He persuades Jenny to put her cello in his car while she walks alongside. As the rain becomes heavier, Jenny asks David if she can sit inside the car. The two talk about music and, before being dropped off, Jenny confides that she is looking forward to attending university and being able to live a life of culture, doing things such as going to art galleries and watching French films. The following week, David has flowers delivered to Jenny's house, wishing her luck at her youth orchestra's concert. Later, she sees him in town and approaches him. David asks Jenny if she is free to go and see a concert and have supper with him and his friends. She happily agrees and thanks him. On the night of the concert, Jack disapproves of Jenny going, but when David comes by to pick up Jenny, he easily charms Jack into letting him take Jenny and bring her home later than her normal curfew. Arriving at the concert, Jenny meets David's friends, Danny and Helen. Afterwards, they go to dinner at a fancy restaurant with live music much to Jenny's liking. Finding she is also interested in art, they invite Jenny to an art auction. David picks up Jenny at school and they go to the auction, winning a bid for a painting by Edward Burne-Jones and going to Danny's place afterwards. They talk about Oxford and all agree to go and visit together the following weekend. Jenny hears a commotion late one night and sees David drinking with her parents. He then uses the opportunity to ask them if he can take Jenny to Oxford, saying that he used to study there and would like to visit his old teacher, Clive Lewis , the author of The Chronicles of Narnia . Her parents are reluctant at first, but agree, seeing it as a good opportunity. At Oxford, Jenny discovers that David makes his money through a variety of shady practices, and although initially shocked succumbs to David's persuasive talk. Back outside her home, Jenny and David have their first kiss. Jenny then shows a signed copy of The Lion, the Witch and the Wardrobe to her parents (in fact, she had seen David sign it, and they had never met Lewis). Impressed by David's apparent connections and charisma, Jack and Marjorie approve of their romantic relationship. On the night of Jenny's 17th birthday, David arrives with presents and tells her parents that he intends to take them all to Paris as a special birthday gift. Her father demurs, but following a conversation with David agrees to Jenny going with him alone. In Paris, the two go sight-seeing, take photos, and go dancing, and Jenny loses her virginity to David. Back in London, Jenny gives her favourite teacher, Miss Stubbs, Chanel perfume as a gift from her trip, but Miss Stubbs refuses the gift, telling Jenny that she knows where it came from and is both concerned and disapproving of her relationship with David. They argue and have a falling-out. Later that night, David proposes marriage. After talking with her parents, Jenny accepts the proposal, but the news causes an argument with her headmistress, and she decides to drop out of school and not pursue a place at university. While getting petrol on their way to a celebration dinner with her parents, Jenny looks in the car's glove compartment for a cigarette and discovers, through letters, that David is already married. Shocked, Jenny tells David to take her and her parents back home. Jenny tearfully argues with David, telling him she gave up her education to be with him. David says he will get a divorce and agrees that he will tell her parents the truth with her, but after she goes inside her house, he drives off and is never seen again. Jenny despairs, and goes to see Danny and Helen, blaming them for not telling her the truth early on. She also blames her parents for encouraging her to throw her life away with an older man. Jenny goes to see David's wife, who tells her that David is a serial adulterer, and has a son. Later that night, Jack apologizes to Jenny, admitting that he messed up and that he believed David could give her the life she wanted. Jack points out that although David wasn't who he said he was, Jenny had also deceived her parents about David's nature by playing along with some of David's lies to her parents. When Jenny is then refused re-admission to her old school to repeat her last year and take her exams, she goes to Miss Stubbs, apologising and asking for her help. Miss Stubbs eagerly agrees, and Jenny resumes her studies and is accepted at Oxford the following year. In a closing voiceover, Jenny shares a story about dating boys her age and starting over with fresh eyes, despite her experience with David.",
  "wiki": "https://en.wikipedia.org/wiki/An_Education"
}