{
  "year": "2009",
  "name": "Inglourious Basterds",
  "plot": "In 1941, Austrian SS-Standartenführer Hans Landa interrogates French dairy farmer Perrier LaPadite about a fugitive Jewish family, the Dreyfuses. He boasts his nickname, \"The Jew Hunter,\" then offers LaPadite amnesty if he will give up the Dreyfuses. LaPadite tearfully admits that they are hiding under his floor. Landa's men massacre the Dreyfuses, but one of them, young Shosanna, escapes unharmed. Three years later, U.S. Army lieutenant Aldo Raine recruits Jewish-American soldiers to the \"Basterds,\" a black ops commando unit tasked with instilling fear among Nazis in occupied France by killing and scalping them. The group includes Sergeant Donny \"The Bear Jew\" Donowitz, privates first class Smithson Utivich and Omar Ulmer, rogue German sergeant Hugo Stiglitz, and Austrian-born translator Corporal Wilhelm Wicki. Raine leaves a swastika mark on surviving German soldiers so they can't hide their Nazi affiliations after the war. Shosanna now operates a cinema in Paris under the name Emmanuelle Mimieux and meets Fredrick Zoller, a famed German sniper set to star in the German propaganda film Stolz der Nation ( Nation's Pride ). Infatuated with \"Emmanuelle,\" Zoller convinces Joseph Goebbels to hold the film's premiere at her cinema. Landa, the premiere's head of security, interrogates Shosanna but doesn't reveal if he recognizes her. She plots with her Afro-French lover and projectionist, Marcel, to kill the German leaders by burning down the cinema with her collection of highly flammable nitrate films . British Commando Lieutenant Archie Hicox, a former film critic and fluent German speaker, is recruited for Operation Kino, an attack on the premiere with the Basterds. Disguised as German officers, Hicox, Stiglitz, and Wicki meet with German film star Bridget von Hammersmark, an undercover Allied agent, in an occupied town at a tavern unexpectedly full of German soldiers. Hicox's unusual accent arouses suspicion from Wehrmacht sergeant Wilhelm and SS Sturmbannfühurer Dieter Hellström, who joins Hicox's group when his suspicions are aroused. Hicox and Hammersmark convince him they are genuine, but Hicox blows their cover with a non-German hand gesture. Everyone is killed in the ensuing gunfight except Wilhelm and a wounded von Hammersmark. Raine negotiates with Wilhelm for von Hammersmark's release until she shoots Wilhelm dead. Believing she set his men up, Raine tortures von Hammersmark, but she convinces him of her loyalty and reveals Hitler is attending the premiere. Raine decides the mission needs to go ahead with himself, Donowitz, and Ulmer to attend posing as Italian filmmakers. Von Hanmersmark is doubtful but thinks the Germans won't find their Italian accents suspicious. Landa investigates the tavern and finds von Hammersmark's shoe and a napkin with her signature. The Basterds infiltrate the premiere with timed explosives. Landa, fluent in Italian, sees through their cover and confronts von Hammersmark privately, strangling her to death. He has Raine arrested along with Utivich, whom he has also detected, but leaves Ulmer and Donowitz in the theater. Taking advantage of the situation, Landa offers to let the attack proceed if Raine's OSS commanders will guarantee his safety after the war. Raine contacts his commanders, and Landa negotiates a generous deal for himself and his radio operator. During the screening, Zoller confronts Shosanna in the projection booth, and they shoot each other dead. As Nation's Pride reaches its climax, Shosanna's face appears on the screen telling the Nazi audience that they are about to be killed by a Jew. Having locked the auditorium, Marcel ignites a pile of nitrate film behind the screen, setting the theater ablaze. Ulmer and Donowitz break into the opera box, gun down Hitler and Goebbels, and fire into the panicked crowd until the explosives demolish the cinema. Landa and his radio operator drive Raine and Utivich into Allied territory, where they surrender to Raine. Raine shoots the radio operator and triumphantly carves a swastika into Landa's forehead, declaring it to be his masterpiece.",
  "wiki": "https://en.wikipedia.org/wiki/Inglourious_Basterds"
}