{
  "year": "2010",
  "name": "True Grit",
  "plot": "In 1878, 14-year-old Mattie Ross travels to Fort Smith , Arkansas , after her father is murdered by hired hand Tom Chaney. Sent to collect her father's body, Mattie learns that Chaney has likely fled with \"Lucky\" Ned Pepper and his gang into Indian Territory , where the local sheriff has no authority. She then inquires about hiring a deputy U.S. Marshal . The sheriff gives three recommendations, and Mattie chooses the \"meanest\" one, Rooster Cogburn, who initially rebuffs her offer, doubting both her grit and her wealth, but she raises the money by aggressive horse trading. Texas Ranger LaBoeuf arrives in town, pursuing Chaney for the murder of a state senator . LaBoeuf proposes joining Cogburn, but Mattie refuses his offer. She wishes Chaney to be hanged in Arkansas for her father's murder, not Texas . Mattie insists on traveling with Cogburn to bear witness to justice, but he departs without her, accompanying LaBoeuf to apprehend Chaney and split the reward. After catching up with the lawmen, Mattie is spanked for her \"insolence\" by LaBoeuf, until Cogburn draws his weapon on him. This, combined with their differing opinions of William Quantrill , prompts Cogburn to end his arrangement with LaBoeuf, who leaves to pursue Chaney on his own. At a rural dugout, Cogburn and Mattie find outlaws Quincy and Moon, who surrender after Cogburn shoots and injures Moon. Initially, the outlaws deny any knowledge of Ned Pepper or Chaney, but Cogburn, using Moon's worsening injury as leverage, convinces him to cooperate. Quincy, enraged, stabs Moon and is killed by Cogburn. A dying Moon reveals that Pepper's gang will arrive at the dugout that night for supplies. Cogburn and Mattie plan an ambush, but LaBoeuf arrives first and is confronted by the gang. Cogburn shoots two gang members and accidentally hits LaBoeuf, but Pepper escapes. Due to his substantial injuries, LaBoeuf rejoins Cogburn and Mattie. The next morning, the three set off again in pursuit of Chaney and the gang, whom Cogburn believes may be hiding out in the Winding Stair Mountains . Cogburn begins to drink heavily, and the animosity between LaBoeuf and him resumes. After days of searching, the three find no trace of Chaney or the Pepper gang. Drunk, Cogburn declares that the trail has gone cold and quits the pursuit. LaBoeuf leaves the posse, declaring that he will return to Texas. Mattie expresses regret to LaBoeuf that she hired the wrong man, and they reconcile, with both admitting they misjudged each other. While retrieving water from a stream, Mattie happens upon Chaney. She shoots and wounds him, but her revolver misfires, allowing Chaney to take her hostage. Ned Pepper convinces Cogburn to leave the area by threatening to kill Mattie. Pepper then departs with his gang, stating that someone will return with a fresh horse for Chaney and instructing him to not harm Mattie while they wait, threatening not to pay him should he disobey. Chaney, musing that Pepper has abandoned him to be captured by the law, attempts to kill Mattie. LaBoeuf arrives and knocks Chaney unconscious, revealing that Cogburn and he reunited shortly after the initial gunfight. He was to rescue Mattie while Cogburn intercepts the gang in a four-to-one standoff. Cogburn and the outlaws charge at each other headlong, with Cogburn killing two gang members and forcing a third to flee before his own horse is shot and falls, trapping him. Alone and mortally wounded, Pepper prepares to execute Cogburn, but LaBoeuf shoots Pepper from 400 yards with his rifle . Chaney regains consciousness and knocks out LaBoeuf, but Mattie seizes the rifle and shoots Chaney dead. The recoil knocks her into a snake den, where she is bitten in the hand by a rattlesnake . Cogburn ropes in, shoots the snakes and rescues Mattie, thanking LaBoeuf and promising to send help for him before departing with Mattie to reach a doctor. After their horse collapses from exhaustion, Cogburn shoots the horse and carries a delirious Mattie on foot to reach help. Despite staying with Mattie until she is out of danger, Cogburn is gone by the time she regains consciousness, and her arm is ultimately amputated. Twenty-five years later, Mattie receives a letter from Cogburn inviting her to attend a traveling Wild West show in which he is performing. When she finally arrives at the shows location, she is informed by Cole Younger and Frank James that Cogburn had died three days earlier. She thanks Younger, who stood and removed his hat when she approached; she calls Frank James \"trash\" since he stayed seated and didn't bother to show her any courtesy. Mattie, who never married, has Cogburn's body moved to her family cemetery in Yell County, Arkansas . She considers going to visit LaBoeuf, who is still alive, but wonders if he remains the same man or not.",
  "wiki": "https://en.wikipedia.org/wiki/True_Grit_(2010_film)"
}