{
  "year": "2010",
  "name": "The Fighter",
  "plot": "Micky Ward is an American welterweight boxer from Lowell, Massachusetts . Managed by his mother Alice, Micky is trained by his older half-brother Dicky Eklund , a former boxer whose peak of success was going the distance with Sugar Ray Leonard in 1978. Addicted to crack cocaine , Dicky is being filmed for an HBO documentary he believes will be about his \"comeback\". On the night of an undercard fight in Atlantic City , Micky's scheduled opponent is ill, and substitute Mike Mungin is a full twenty pounds heavier, almost three weight classes above Micky. His mother and brother assure him that Mungin is out of shape, but they arrive at the fight to find he is in top condition, soundly defeating Micky. Retreating from the world, Micky strikes up a relationship with bartender Charlene Fleming. After several weeks, Alice arranges another fight for Micky, who is considering an offer to be paid to train in Las Vegas . He is supported by Charlene and his father George, angering Alice and his seven sisters, but Dicky says he will match the offer to keep Micky with the family. Desperate for money, Dicky has his girlfriend act as a prostitute and robs her clients by impersonating a police officer , but is interrupted by the actual police. He is chased down and beaten, and an officer brutally breaks Micky's hand when he tries to intervene. Both brothers are arrested and Dicky is sentenced to prison, while Micky is released and washes his hands of Dicky. HBO airs the documentary, which the incarcerated Dicky and his family are horrified to see is called Crack in America , depicting how Dicky's life and career have been ruined by his addiction. Dicky commits to bettering himself in prison, while Micky resumes training as his hand heals. George finds a new manager, Sal Lanano, and persuades Micky to return to boxing without the involvement of Alice or Dicky. Alice and her daughters confront Charlene and Micky, who agrees with Charlene that his mother and brother have done more damage to his career than good. Micky regains his confidence in a string of minor bouts, and is offered a major fight against an undefeated up-and-comer. He visits his brother in prison, and Dicky advises him how best to work his opponent, but Micky accuses him of selfishly trying to relive his own failed career. Micky is nearly overwhelmed during the match, but follows his brother's advice and triumphs, unexpectedly earning a shot at the title. Released from prison and eight months sober, Dicky returns home to his family and young son, but Micky has promised his team not to involve his brother. A family argument ensues and Micky chastises both sides, before Charlene and his trusted trainer Mickey O'Keefe leave in disgust. Alice urges Micky to spar with Dicky, but Micky angrily knocks him down and chides his mother for having always favored Dicky. Returning to his crack house, Dicky cuts ties with his former friends and seeks out Charlene, telling her that Micky needs both of them. The team reconciles and arrives in London for the title fight against welterweight champion Shea Neary . With Dicky's guidance and his family watching, Micky scores another upset victory and wins the welterweight title. Dicky credits his brother as the creator of his own success, and an epilogue reveals that Micky retired after a remarkable career and married Charlene, while Dicky remains a local legend.",
  "wiki": "https://en.wikipedia.org/wiki/The_Fighter"
}