{
  "year": "2010",
  "name": "The Kids Are All Right",
  "plot": "Nicole \"Nic\" and Jules Allgood are a married lesbian couple living in the Los Angeles area. Nic is an obstetrician and Jules is a housewife who is starting a landscape design business. Each has given birth to a child using the same sperm donor . Nic and Jules' 15-year-old son Laser wants to find his biological father, but as he is too young to request that information from the sperm bank, he enlists his 18-year-old sister Joni to contact them. The sperm bank identifies Paul Hatfield, a restaurant owner, as the donor and shares his contact information. When the three meet, the kids are impressed by Paul's bohemian lifestyle, and Paul becomes enthusiastic about being in their lives. Joni and Laser avoid telling their mothers, fearful of upsetting them. However, Jules and Nic find out and invite Paul over to dinner. When Jules mentions her landscape business, Paul asks her to transform his back garden. Jules agrees, although Nic is apprehensive. As Jules begins the job, she finds that Paul is appreciative of her talent, something she feels she is lacking from Nic. After Jules impulsively kisses Paul one afternoon, they end up in bed together and start an affair. Jules and the kids start spending more time with Paul, much to Nic's chagrin as she feels that Paul undermines her authority over the children. After a heated argument with Jules, Nic suggests they all have dinner at Paul's house to ease the tension. The dinner goes well until Nic discovers traces of Jules's hair in Paul's bathroom and bedroom. When confronted by Nic later that night, Jules assures Nic that she is not in love with Paul and has not turned straight; she just wanted to be appreciated. Joni and Laser overhear the argument, causing the household to become tense. Paul, believing he has fallen in love with Jules, calls her to suggest that she leave Nic and come live with him, bringing the kids. Jules declines, disgusted with Paul's lack of understanding about her sexuality. The night before Joni leaves for college, Paul arrives at the Allgoods' house. He is rejected by Joni and angrily confronted by Nic. Laser ignores him as he tries to get his attention through the window. Later that night, Jules tearfully begs her family's forgiveness. The next morning, the family drives Joni to college. While Nic and Jules hug Joni goodbye, they also affectionately touch each other. During the ride home, Laser tells his mothers that they should not break up because they are too old. Jules and Nic laugh, and the film ends with them smiling at each other and holding hands.",
  "wiki": "https://en.wikipedia.org/wiki/The_Kids_Are_All_Right_(film)"
}