{
  "year": "2010",
  "name": "Black Swan",
  "plot": "Nina Sayers, a young dancer with the New York City Ballet , lives with her overprotective mother, Erica, a former ballerina . The company is opening the season with Tchaikovsky 's Swan Lake . After forcing the current prima ballerina , Beth, into retirement, artistic director Thomas Leroy announces he is looking for a new dancer for the dual roles of the innocent and fragile White Swan, Odette, and the sensual and dark Black Swan, Odile. Nina auditions and gives a flawless performance as Odette, but fails to embody Odile, causing Thomas to dismiss her. The next day, Nina asks Thomas to reconsider. He forcibly kisses her and she bites him and runs out of his office. Later, Nina is surprised to find she has received the lead role. At a gala celebrating the new season, an intoxicated Beth publicly accuses Nina of providing sexual favors to Thomas in return for the role. The next day, Nina hears Beth had been hit by a car; Thomas believes she was attempting suicide . Nina visits Beth in the hospital and is distraught to see her injured legs; it is clear she will never dance again. During rehearsals, Thomas tells Nina to observe a newcomer, Lily, who has a physical resemblance to Nina but also an uninhibited quality Nina lacks. Nina has hallucinations and finds scratch marks on her back. One night, despite Erica's objections, Nina accepts Lily's invitation to go out for drinks. Lily offers Nina an ecstasy capsule, which Nina reluctantly accepts. While intoxicated, Nina flirts with men at the bar and Lily as well. After the two dance at a nightclub , they go back to Nina's apartment and have sex. The next morning, Nina wakes up disoriented and alone and realizes that she is late for rehearsal. At rehearsal, Nina sees Lily dancing as Odile and confronts her about their sexual encounter. Lily denies that it happened and mocks Nina for fantasizing about her. Nina becomes convinced Lily intends to replace her, especially after learning that Thomas has made Lily her alternate. Nina's mysterious injuries and hallucinations grow more severe, leading to an incident where she believes she is transforming into Odile. Erica grows concerned about her well-being and attempts to prevent Nina from performing on opening night. After a physical confrontation with her mother and a confrontation with Beth, Nina arrives at the theater, where she finds Lily preparing to take the stage as Odette because Nina has been absent. Nina convinces Thomas to allow her to take back her role. Towards the end of the ballet's second act, Nina is distracted by a hallucination and loses her balance during a lift , causing Prince Siegfried to drop her, infuriating Thomas. Nina returns to her dressing room and finds Lily preparing to play Odile. She confronts her and Lily appears to transform into a doppelgänger of Nina. The two fight, breaking a mirror. Nina stabs her doppelgänger with a shard of glass, killing her and breaking the illusion. Nina hides Lily's body and takes the stage. She dances flawlessly as Odile and seemingly begins to turn into a black swan, her arms covered in feathers. Amidst a standing ovation from the audience, Nina surprises Thomas with a passionate kiss. In her dressing room, Nina resumes the Odette tutu and white swan makeup, but is interrupted by Lily, who congratulates Nina for her performance. Nina sees the mirror is still broken, but all other evidence of the stabbing is gone, including the body. She looks down and pulls a piece of glass from her abdomen, realizing she stabbed herself and not Lily. Despite her injury, she dances the final act of the ballet with blood gradually seeping through her costume. The show ends with her jumping from the set onto a hidden mattress to simulate Odette throwing herself off a cliff. Everyone erupts in thunderous applause while Thomas, Lily, and the other dancers gather to congratulate Nina backstage. Thomas eventually realizes Nina is bleeding and shouts for help, asking Nina what happened. Nina calmly replies: \"I felt it. Perfect. It was perfect\", as the screen fades to white.",
  "wiki": "https://en.wikipedia.org/wiki/Black_Swan_(film)"
}