{
  "year": "2011",
  "name": "War Horse",
  "plot": "A bay Irish Hunter is born in Devon , England in 1912. Farmer Ted Narracott outbids his landlord Lyons for the colt at auction, to the dismay of his wife Rose who wanted a working horse that can plough, not an Irish Hunter. Their son Albert, with his best friend Andrew, names the colt Joey, and teaches him to come when he imitates an owl's call. The horse and boy, now closely bonded, plough a rocky field, permitting the planting of turnips and saving the family's farm. Rose shows Albert his father's medals, including a Distinguished Conduct Medal , from the Second Boer War , and gives him Ted's regimental pennant , confiding in Albert that his father carries physical and mental scars from the war. When war with Germany is declared in 1914, heavy rain ruins the family's crops, forcing Ted to sell Joey to an army officer, Captain James Nicholls, who sees Albert's heartbreak and promises to look after Joey. Albert is too young to enlist, and ties the pennant to Joey's bridle, promising he will eventually find him. Joey bonds with Topthorn, a black stallion with whom he is trained for his military role. The horses are deployed to Flanders with a flying column under the command of Nicholls and Major Stewart. They lead a cavalry charge through a German encampment defended by hidden machine guns . Nicholls and most of the cavalrymen are killed and the Germans capture the horses. Gunther, a young volunteer, grooms Joey and Topthorn. When his younger brother Michael is sent to the front lines, Gunther deserts with his brother on the horses. The German army captures the boys and executes them, leaving the horses unattended. They are found by Emilie, a French girl, the next morning, and she hides them from German soldiers in her bedroom at her grandfather's farm. Emilie's grandfather allows her to ride Joey for her birthday, but they are discovered and captured by the Germans while Emilie's grandfather keeps the pennant. By 1918, Albert has enlisted and is fighting alongside Andrew in the Second Battle of the Somme where Andrew is killed and Albert temporarily blinded by an exploding gas bomb. The Germans use Joey and Topthorn to haul artillery under the care of Private Friedrich Hengelmann. Topthorn succumbs to exhaustion from overwork and dies. Devastated over this loss, Hengelmann rebels against his commanders and frees Joey from his reins. Joey gallops into no man's land and evades a tank but is entangled in barbed wire. Colin, a British soldier, makes his way to Joey under a white flag and tries to free him. Peter, a German soldier, comes over with wire cutters, and together they rescue Joey. They flip a coin for ownership of the horse, and Colin guides the injured Joey to the British lines. Albert hears about Joey's rescue while recuperating. Just as Joey is about to be put down by a doctor who deems the horse too injured to recover, Joey hears Albert's owl call. Albert, his eyes still bandaged, is able to describe Joey in perfect detail, and the two are reunited. The doctor nurses Joey back to health. After the Great War ends Joey is put up for auction. Albert's comrades raise a collection to bid against a wealthy French butcher. Emilie's grandfather wins the auction, implying she has died and the horse is all he has left of her. After Albert pleads with him, the old man recognises the strength of the soldier's bond, returning the pennant and Joey to Albert. Albert returns with Joey to his family's farm, embracing his mother and returning the pennant to his father, who extends his hand to him with pride as Joey watches.",
  "wiki": "https://en.wikipedia.org/wiki/War_Horse_(film)"
}