{
  "year": "2011",
  "name": "The Tree of Life",
  "plot": "The film follows the members of the O'Brien family in the 1940s-1960s [ 11 ] and 2010. Most of the film takes place in the 1950s, [ 12 ] but the film jumps between different narratives. The O'Briens appear to be a standard American middle-class suburban family. Mr. O'Brien is a successful engineer for an energy company, but has enough free time to indulge his love of music. Mrs. O'Brien is a housewife with many friends in the neighborhood. They have three healthy boys, Jack, R.L., and Stevie. However, the film reveals deep cracks behind the facade, which leave Jack traumatized for decades. In the 1960s, Mr. and Mrs. O'Brien are devastated to learn that their son R.L., aged 19, has died. In 2010, Jack is a successful but world-weary architect in an unnamed city. [ a ] He leads a seemingly empty existence and has a difficult relationship with his elderly father, who still has not gotten over R.L.'s death. In voiceover, Mrs. O'Brien asks God why R.L. had to die. Then a series of dreamlike images depict the birth of the universe , the creation of Earth and the beginning of life . At one point a dinosaur spares another, badly wounded, dinosaur. Finally, an asteroid strikes Earth . In the 1940s, Mr. and Mrs. O'Brien start a family in the Waco suburbs. They have very different personalities. Jack's mother teaches him that mankind is divided into the \"way of nature\" and the \"way of grace \"—a view analogous to, but not precisely, complementarianism . Jack sees his mother as the embodiment of grace: kind, forgiving, and nurturing. She presents the world to her sons as a place of wonder. Jack sees his father as the embodiment of nature: hot-tempered, tough, and stern. He teaches his sons to fight and to not trust people easily. As Jack grows older, he learns that his parents are frustrated with their lives. Mr. O'Brien finds his career unfulfilling, as his true passion is music. He spends his free time inventing gadgets and hopes to start his own business. One of the inventions looks promising, but after Mr. O'Brien loses a patent suit, nothing changes. Mrs. O'Brien lives under the thumb of her domineering husband, who screams at her and blames her for not disciplining the boys enough. He worries that her kindness, which contrasts with his discipline, has caused his sons to hate him. As a teenager, Jack begins to question his parents' philosophy of life. The death of his friend Taylor shakes his faith in the goodness of God. He resents his father, who harshly disciplines him but cuts R.L. slack because of their shared love of music. He criticizes his mother for failing to stand up to his father. When Mr. O'Brien goes on a business trip, a weight is lifted from the family's shoulders. The boys happily play with their mother. However, without his father's discipline, Jack's rebellious streak emerges. Peer-pressured, Jack commits vandalism and animal abuse, and steals a nightgown from his crush's house. Mr. O'Brien's plant shuts down, forcing the family to relocate. Before leaving the house for the last time, Mr. O'Brien has a moment of self-reflection. He asks Jack to forgive him for his harshness, and tries to conciliate Jack by telling him that he takes after his mother. However, Jack insists that he better resembles his father. Returning to 2010, Jack has a vision of a young girl, accompanied by himself as a child, walking across desolate terrain. He walks through a wooden door frame and sees a view of the far distant future in which the Sun expands into a red giant , engulfing Earth and then shrinking into a white dwarf . The dead return to life and gather at the seaside, where Jack is reunited with his family and all those who populate his memory. Jack meets his brothers and brings R.L. to his parents, who embrace him as a long-lost son. Accompanied by two girls in white, Mrs. O'Brien gracefully whispers, \" I give him to you . I give you my son.\" Jack's vision ends and he leaves his office, smiling contentedly. The mysterious light continues flickering in the darkness. Malick released an extended version of the film in September 2018, which incorporates unused footage from the original film shoot. Although Malick maintains that the theatrical edition is the official director's cut, [ 14 ] the extended version expands on the character of Mr. O'Brien and broadly questions Mrs. O'Brien's either-or distinction between nature and grace. Additional plot elements include: [ 14 ] [ 15 ] [ 16 ] [ 17 ] [ 18 ]",
  "wiki": "https://en.wikipedia.org/wiki/The_Tree_of_Life_(film)"
}