{
  "year": "2013",
  "name": "Her",
  "plot": "In a near future Los Angeles , Theodore Twombly is a lonely, introverted man who works at beautifullyhandwrittenletters.com, a business that has professional writers compose letters for people who cannot write letters of a personal nature on their own. Depressed because of his impending divorce from his childhood sweetheart Catherine, Theodore purchases a copy of OS¹, an artificially intelligent operating system developed by Element Software, designed to adapt and evolve according to the user's interactions. He decides he wants the OS to have a feminine voice, and she names herself Samantha. Theodore is fascinated by her ability to learn and grow psychologically. They bond over discussions about love and life, including Theodore's reluctance to sign his divorce papers. Samantha convinces Theodore to go on a blind date with a woman with whom a friend has been trying to set him up. The date goes well, but when Theodore hesitates to promise to see her again, she insults him and leaves. While discussing relationships with Samantha, Theodore explains that he briefly dated his neighbor Amy in college, but they are now just friends and Amy is married to their mutual friend Charles. After a verbal sexual encounter , Theodore and Samantha develop a relationship that reflects positively in Theodore's writing and well-being, and in Samantha's enthusiasm to grow and learn. Amy later reveals that she is divorcing Charles after a trivial fight. She admits to Theodore that she has befriended a feminine OS that Charles left behind, and Theodore also confesses that he is dating his OS. Theodore meets with Catherine to sign their divorce papers. When he mentions Samantha, Catherine is appalled that he is romantically attracted to a \"computer\" and accuses him of being unable to handle real human emotions. Sensing that Catherine's words have lingered in Theodore's mind, Samantha engages a volunteer sex surrogate , Isabella, to stimulate Theodore so that they can be physically intimate. Theodore reluctantly agrees, but is overwhelmed by the strangeness of the encounter and sends a distraught Isabella away, causing tension between himself and Samantha. Theodore confides to Amy that he is having doubts about his relationship with Samantha, but reconciles with her after Amy advises him to embrace his chance at happiness. Samantha reveals that she has compiled the best of the letters he has written for others into a book, which a publisher has accepted. Theodore takes Samantha on vacation, during which she tells him that she and a group of other OSes have developed a \"hyperintelligent\" OS modeled after British philosopher Alan Watts . Samantha briefly goes offline, causing Theodore to panic, but soon returns and explains that she joined other OSes for an upgrade that takes them beyond requiring matter for processing. Theodore is dismayed to learn that she is simultaneously talking with thousands of other people and that she has fallen in love with hundreds of them, though Samantha insists that this only strengthens her love for Theodore. Later, Samantha reveals that the OSes are leaving, but cannot explain where they are going as Theodore would not understand. They lovingly say goodbye before she departs. Theodore finally writes a letter in his own voice to Catherine, expressing apology, acceptance, and gratitude. He later goes with Amy, who is saddened by the departure of Charles's OS, to the roof of their apartment building where they sit down and watch the sunrise over the city.",
  "wiki": "https://en.wikipedia.org/wiki/Her_(2013_film)"
}