{
  "year": "2013",
  "name": "Nebraska",
  "plot": "In Billings, Montana , an elderly man named Woody Grant is arrested for walking on the Interstate . Woody is picked up by his son, David, who learns that he was attempting to walk to Lincoln, Nebraska , to collect a one-million-dollar sweepstakes prize he believes he has won. Despite his family's insistence that it is a mail scam, Woody insists on going to Lincoln so he can collect the money and buy a new truck and air compressor. David plans to drive him there just so he can spend some time with him, and give his mother, Kate, a break. Woody's other son, Ross, does not feel that David owes him anything, because as a parent, Woody was a neglectful alcoholic. David takes the week off work and starts driving to Nebraska with Woody. While in Rapid City, South Dakota , Woody goes on a bender and hits his head while stumbling back to their motel room. This results in Woody having to be admitted to a hospital overnight. David learns that they will be passing through Woody's hometown of Hawthorne in Madison County, Nebraska , and he convinces Woody to stop and see his brother, Ray. At a bar, David meets Woody's former business partner, Ed Pegram, who stole Woody's air compressor decades prior. Woody foolishly mentions winning the money, and the next day, the news of Woody's \"win\" has spread through the town like wildfire. The next day, Kate arrives by bus in Hawthorne, and Ross arrives by car soon after. The Hawthorne newspaper does a story on Woody stopping through town and its owner, Peg Nagy, tells a shocked David that his guarded nature and alcoholism come from being shot down over Korea . That night, Ed corners David in the men's room about some money he supposedly loaned Woody years ago, threatening legal action if he is not paid. The rest of Woody's family come to visit him as well, and many of the family members demand money that they believe Woody owes them from David and Ross. A fight begins, ending abruptly when Kate calls out the relatives for their own unpaid debts, and for using Woody as a free mechanic for decades. David, Kate, Ross and Woody tour Woody's childhood farmhouse, which is now abandoned. Woody recalls his childhood, including witnessing his brother's death from scarlet fever . Afterwards, they drive past a house Kate identifies as Ed's, so David and Ross take back Woody's air compressor. Kate soon realizes that the house actually belongs to another couple, and David and Ross have to hastily return the compressor. Back at the bar, Ed attempts to blackmail Woody by revealing that Woody cheated on Kate before David's birth. As they leave, they are attacked by Ray's sons, Cole and Bart, who steal Woody's sweepstakes letter. They later tell David they threw it away after finding out it was a scam. While looking for it, David and Woody discover Ed reading the letter aloud at the bar, which humiliates Woody. After Woody takes the letter back and goes outside, David punches Ed in the face. Woody, dizzy from his head injury, has to sit down, and David tells him they are not going to continue on to Lincoln. Woody tells David that he wants the money so badly because he wants to leave his sons something after he dies. David takes Woody to the hospital in nearby Norfolk . In the middle of the night, Woody abruptly leaves and starts walking, so David relents and drives Woody the rest of the way to Lincoln. In Lincoln, Woody is told that he did not win, and the two head back to Billings. However, David trades in his Subaru Outback for a truck, and also buys him a new air compressor. While driving back through Hawthorne, David hides below the dash and lets Woody take the wheel of his truck for all to see, including Ed, who has a bruised face. Woody waves goodbye to everyone and drives out of town, then stops in the middle of the road and switches seats with David, who takes them the rest of the way back home.",
  "wiki": "https://en.wikipedia.org/wiki/Nebraska_(film)"
}