{
  "year": "2013",
  "name": "Gravity",
  "plot": "The Space Shuttle Explorer , commanded by veteran astronaut Matt Kowalski, is in Earth orbit to service the Hubble Space Telescope . Dr. Ryan Stone is aboard on her first space mission, to perform hardware upgrades on the telescope. During a spacewalk , Mission Control in Houston warns Explorer ' s crew about a rapidly expanding cloud of space debris caused by the Russians shooting down a defunct spy satellite (see Kessler syndrome ), and orders the crew to return to Earth immediately. Communication with Mission Control is lost shortly after, as more communication satellites are disabled by debris. Debris strikes the Explorer and Hubble, tearing Stone from the shuttle. Kowalski, using a Manned Maneuvering Unit (MMU), rescues her and they return to the Explorer , discovering that it has suffered catastrophic damage and the rest of the crew are dead. Kowalski decides they should use the MMU to reach the International Space Station (ISS), which is in orbit about 1,450 km (900 mi) away. He estimates that they have 90 minutes before the debris field completes an orbit and threatens them again. On their way to the ISS, the two discuss Stone's home life and her daughter, who died young in an accident. As they approach the station, they see that the ISS's crew has evacuated using one of its two Soyuz spacecraft, with the remaining craft exhibiting damage and unable to return to Earth. Kowalski suggests using it to travel to the nearby Chinese Tiangong space station, [ N 1 ] 100 km (60 mi) away, to board its similar Shenzhou spacecraft and return to Earth. They try to grab onto the ISS, but only make tenuous connection to the Soyuz's parachute cords, which are not strong enough for them both. Despite Stone's protests, Kowalski detaches himself to save her from drifting away with him. Stone enters the ISS as Kowalski floats away. Unable to establish communication with him, she concludes that she is the mission's sole survivor. Inside the station, a fire breaks out, forcing Stone to rush to the Soyuz. As she maneuvers it away from the ISS, the tangled parachute tethers snag, preventing the spacecraft from leaving. She performs a spacewalk to cut the cables, succeeding just as the debris field returns, destroying the station. Stone angles the Soyuz towards Tiangong but discovers that the engine has no fuel. After an attempt at radio communication with an Inuk on Earth, Stone resigns herself to her fate and shuts off the cabin's oxygen supply to commit suicide. As she begins to lose consciousness , she experiences a hallucination of Kowalski telling her to rig the Soyuz's soft landing rockets to propel the capsule towards Tiangong. Stone regains the will to go on, restoring the spacecraft's oxygen flow and rigging the landing rockets accordingly. Unable to dock with Tiangong, Stone ejects herself from the Soyuz and uses a fire extinguisher as a makeshift thruster to travel to the rapidly deorbiting station. She enters Tiangong ' s Shenzhou capsule just as the station enters the upper atmosphere, and undocks. The Shenzhou capsule re-enters the atmosphere and lands in a lake. Radio communication from Houston informs Stone that she has been tracked on radar and that rescue crews are on their way. Stone opens the hatch and sheds her space suit , allowing her to reach the surface and crawl onto the beach before standing and walking away.",
  "wiki": "https://en.wikipedia.org/wiki/Gravity_(2013_film)"
}