{
  "year": "2014",
  "name": "The Grand Budapest Hotel",
  "plot": "In a cemetery in the former nation of Zubrowka, [ a ] a woman visits the shrine of a renowned writer, known simply as \"Author\". She holds a copy of his book The Grand Budapest Hotel . The book, written in 1985, recounts a visit the author made in 1968 to the eponymous hotel, which was once a famous resort but had by then fallen on hard times. During his stay, he struck up a friendship with the hotel's proprietor, Zero Moustafa, who told him his rags to riches story over dinner. In 1932, Zero, an orphan who has come to Zubrowka to escape his war-torn homeland, is hired as a lobby boy by Monsieur Gustave H., the concierge at the Grand Budapest Hotel. Gustave is a ladykiller who romances old, wealthy residents at the hotel, including dowager Madame Céline Villeneuve Desgoffe-und-Taxis (known as Madame D.), with whom he has had a nearly two-decade affair. Madame D. mysteriously dies a month after her last visit, so Gustave and Zero visit her estate to pay their respects. There, her attorney, Deputy Vilmos Kovacs, announces that she has bequeathed the famous Renaissance painting Boy with Apple to Gustave (much to the chagrin of her son, Dmitri). Gustave and Zero abscond with the painting, hiding it in a safe in the Grand Budapest. Madame D.'s butler, Serge, makes a deposition implicating Gustave in her death. Gustave is arrested on suspicion of murder, while Serge goes into hiding. During his imprisonment, Gustave earns the trust of a gang of inmates by providing them with pastries from Mendl's, a well-known bakery. The inmates let him in on their escape plan. Gustave has Zero and his fiancée, Agatha (who works at Mendl's), hide hammers, chisels, and sawblades inside the next shipment of pastries. Using these tools, the inmates break free. Meanwhile, Dmitri sends his hitman, J. G. Jopling, to kill Kovacs, whom he suspects of disloyalty, as well as Serge's sister, who refuses to give up her brother's whereabouts. After Zero and Gustave are reunited, they set out to prove Gustave's innocence with the assistance of a fraternity of concierges known as the Society of the Crossed Keys. The society locates Serge and facilitates a meeting between him, Gustave, and Zero. Serge reveals that he was pressured to implicate Gustave by the real killer, Dmitri, and that Madame D. had a missing second will, which would only take effect should she be murdered. Jopling arrives and kills Serge, leaving Gustave and Zero without a witness, then tries to flee. After a chase through the snow, Gustave is left dangling off a cliff at the mercy of Jopling. Zero rescues Gustave by pushing Jopling off the cliff, and the two men continue their escape, pursued by Inspector Henckels of the Zubrowkan police. Gustave, Zero, and Agatha return to the Grand Budapest to find it swarming with fascist troops, who have made it their headquarters. Agatha sneaks in to retrieve the painting but is spotted by Dmitri. Gustave and Zero rush in to save her, but Dmitri shoots at them, triggering an all-out firefight. Henckels eventually puts a stop to the chaos. On the back of the painting, the group finds Madame D.'s second will. The will reveals that Madame D. was the owner of the Grand Budapest and names Gustave as her sole beneficiary. He is exonerated in court, while Dmitri (now the prime suspect) flees the country. As a result of the bequest, Gustave becomes one of the wealthiest men in Zubrowka. Zero takes over as concierge and marries Agatha in a ceremony officiated by Gustave. However, while the three are traveling by train, Gustave gets into a quarrel with a group of thuggish soldiers and is killed. His own will bequeaths the hotel and his fortune to Zero. Zero maintains the hotel in memory of Agatha who, like their infant son, died from Prussian grippe . [ 5 ]",
  "wiki": "https://en.wikipedia.org/wiki/The_Grand_Budapest_Hotel"
}