{
  "year": "2014",
  "name": "The Theory of Everything",
  "plot": "In 1963, Stephen Hawking, a post-graduate astrophysics student at the University of Cambridge , begins a relationship with literature student Jane Wilde . Although Stephen is intelligent, both his friends and academics are concerned about his lack of a thesis topic. After attending a lecture by Roger Penrose on black holes with his supervisor, Prof. Dennis Sciama , Stephen speculates that these may have been part of the creation of the universe and so decides upon his thesis. However, soon Stephen's muscles begin to fail, causing him to have decreased coordination with his body. After a bad fall, he is diagnosed with early-onset progressive degenerative motor neurone disease (MND) that will eventually leave him unable to move, swallow, and even breathe. With no treatment options, he is given approximately two years to live. The doctor assures Stephen that his brain will not be affected, so his thoughts and intelligence will remain intact, but eventually, he will be unable to communicate them. Stephen develops severe depression, becoming reclusive and focusing on his work. Jane confesses she loves him and that she intends to stay even as his condition worsens. They marry and have their first son, Robert. Once his walking ability deteriorates, he begins using a wheelchair. Inspired by Penrose’s work on spacetime singularities at the centre of black holes, Stephen presents his doctoral thesis viva extrapolating that a black hole created the universe in a Big Bang and it will end in a Big Crunch . After the Hawkings have their daughter Lucy , Jane becomes frustrated having to focus on the children, as well as Stephen's slowly degenerating health while his fame increases, all at the expense of her academic work. Stephen tells her he will understand if she needs help. In the 1970s, Jane joins a church choir, where she meets and becomes close friends with Jonathan, a widower . She employs him as a piano teacher for Robert, and Jonathan befriends the entire family, helping Stephen with his illness, supporting Jane, and playing with the children. When Jane gives birth to another son, Timothy, Stephen's mother asks her if the baby is Jonathan's. This causes outrage and Jonathan is appalled, but when he and Jane are alone, they admit the depth of their feelings for one another. He distances himself from the family, but Stephen tells him that Jane needs him. As the Lucasian Professor of Mathematics at Cambridge, Stephen goes on to develop a theory about the visibility of black holes that they emit radiation and becomes a world-renowned physicist. In the 1980s, while attending an opera performance in Bordeaux on holiday, Stephen falls ill and is rushed to a hospital. The doctor informs Jane that he has pneumonia and the tracheotomy he needs to survive will leave him mute. She agrees to the surgery. Stephen learns to use a spelling board and uses it to communicate with his new nurse, Elaine Mason. He receives a computer with a built-in voice synthesizer and uses it to write a book, A Brief History of Time , which becomes an international best-seller. In the late 1980s, Stephen tells Jane he has been invited to the United States to accept an award and will take Elaine with him. Jane faces the fact that the marriage has not been working, saying she \"did her best\", and they agree to divorce . While Stephen has fallen in love with Elaine, Jane and Jonathan reunite. Stephen goes to deliver a public lecture where he sees a student drop a pen. He imagines getting up to return it, almost crying at the reminder of how his disease has affected him. He then gives a speech telling audiences to pursue their ambitions despite the harsh reality of life: \"While there's life, there is hope.\" On being made a member of the Order of the Companions of Honour in 1989, Stephen invites Jane to go with him to meet Queen Elizabeth II , where they share a happy day together with their three children. An extended closing series of select moments from the film, shown in reverse, back to the moment Stephen first saw Jane – the reversal is reminiscent of Stephen's research methodology of reversing time to understand the beginning of the universe. An epilogue reveals that A Brief History of Time has sold over ten million copies worldwide. In the late 1990s, Stephen declined an offer of a knighthood and has no plans to retire. Jane earned her Doctor of Philosophy in Medieval Spanish Poetry and married Jonathan.  Both Stephen and Jane remain friends, sharing three grandchildren.",
  "wiki": "https://en.wikipedia.org/wiki/The_Theory_of_Everything_(2014_film)"
}