{
  "year": "2014",
  "name": "Whiplash",
  "plot": "Jazz drummer Andrew Neiman (Teller) attends the prestigious Shaffer Conservatory in New York City, hoping to leave a legacy like that of his idol Buddy Rich . Terence Fletcher (Simmons), the conductor of the Shaffer Conservatory Studio Band, recruits him to play in the Studio ensemble as an alternate for core drummer Carl Tanner (Lang). Andrew discovers that Fletcher, although encouraging at first, is relentlessly strict and verbally and physically abusive towards his students. When he apparently fails to keep tempo on Hank Levy 's \" Whiplash \" during his first ensemble rehearsal, Fletcher throws a chair at him, repeatedly slaps his face, and berates him. Determined to impress Fletcher, Andrew excessively practices, often until his hands blister and bleed. In the meantime, Andrew goes on a date and becomes romantically involved with a woman named Nicole (Benoist). After their first set at a jazz competition, Andrew misplaces Tanner's sheet music. Tanner cannot play without the sheets, so Fletcher assigns Andrew to perform \"Whiplash\" from memory, resulting in Shaffer winning the competition. Fletcher promotes Andrew to core drummer. However, Andrew is taken aback when Fletcher abruptly reassigns the position to Ryan Connolly (Stowell), a drummer from a lower-level ensemble within Shaffer. Because of his single-mindedness toward music, Andrew clashes with his family and breaks up with Nicole to focus on his ambitions. Fletcher begins rehearsal by announcing that Sean Casey, a former member of the Studio Band, died in a car crash. He then pushes the three drummers to play at a faster tempo on \" Caravan \", keeping them for a grueling five-hour practice. Andrew is the only one able to perform on-tempo, and earns the core position back. On the way to the next competition, Andrew's bus gets a flat tire. He rents a car but arrives late and forgets his drumsticks at the rental office, irritating Fletcher. Andrew races back and retrieves them, but his car is hit by a truck on the way back. Heavily injured, Andrew crawls from the wreckage and runs to the theater, arriving bloodied and weak just as the ensemble enters the stage. He struggles to keep tempo and Fletcher halts the performance to dismiss him from the band. Enraged, Andrew attacks Fletcher onstage and is subsequently expelled from Shaffer. At the request of his father, Jim (Reiser), Andrew meets Rachel Bornholdt (Grace), a lawyer representing the parents of the late Sean Casey, who had actually hanged himself after suffering from depression and anxiety resulting from Fletcher's abuse. Casey's parents want Fletcher held accountable, so Andrew reluctantly agrees to testify anonymously, leading Shaffer to terminate Fletcher. Andrew abandons drumming but encounters Fletcher months later playing piano at a jazz club . Over a drink, Fletcher admits his teaching methods were harsh but insists they were necessary to motivate his students. Citing a story where Jo Jones allegedly threw a cymbal at Charlie Parker as an example, Fletcher says that the next jazz musician to live up to Parker's legacy would never let discouragement stop them. Fletcher invites Andrew to perform with his professional band at a New York JVC Jazz Festival , playing the same pieces from the Shaffer Studio Band; Andrew accepts. Andrew calls Nicole to invite her to the performance but learns she has a new boyfriend. At the festival, Fletcher tells Andrew he knows Andrew testified against him. As revenge, Fletcher leads the band into a new song Andrew does not know. After a disastrous performance, Andrew walks offstage humiliated. Jim embraces Andrew backstage, but Andrew decides to return to the stage, reclaiming the drum kit and cutting off Fletcher's introduction to the next tune by cueing the band into \"Caravan\". Initially angered, Fletcher resumes conducting. As the piece finishes, Andrew continues into an unexpected improvised solo . He plays continuously at an extraordinary speed to the point his hands start bleeding and he seemingly goes into a trance, while Jim watches in horror. Impressed, Fletcher nods in approval before cueing the final chord.",
  "wiki": "https://en.wikipedia.org/wiki/Whiplash_(2014_film)"
}