{
  "year": "2015",
  "name": "The Revenant",
  "plot": "Fur trapper Hugh Glass watches as American soldiers burn down a Native American village on the Great Plains . Years later, in late 1823, during the Arikara War , Glass guides Captain Andrew Henry 's trappers through the unorganized territory of the present-day Dakotas . While he and his half- Pawnee son, Hawk, are hunting, the company's camp is attacked by an Arikara war party which is seeking to recover its chief's abducted daughter, Powaqa. Many of the trappers are killed during the fight, and the rest of them escape onto a boat. Guided by Glass, the survivors begin a trek to Fort Kiowa on foot because Glass believes traveling down the Missouri River will make them vulnerable. After docking, the crew stash their pelts near the shore. While scouting game, Glass is mauled and left near death by a grizzly bear . Fearing another Arikara attack, trapper John Fitzgerald argues that the group must mercy-kill Glass and keep moving. Henry agrees, but he is unable to pull the trigger. Instead, he offers to pay anyone who will stay with Glass and bury him after he dies. When the only volunteers are Hawk and the young Jim Bridger , Fitzgerald, wanting the money to recoup his losses from the abandoned pelts, also agrees to stay. After the others leave, Fitzgerald attempts to smother Glass but is stopped when Hawk intervenes. Fitzgerald stabs Hawk to death as Glass watches helplessly. The next morning, Fitzgerald convinces Bridger, who is unaware of Hawk's murder, that the Arikara are approaching and they must abandon Glass. At first Bridger protests, but he ultimately follows Fitzgerald after the latter leaves Glass half-buried alive in a makeshift grave. Bridger leaves behind a canteen on which he had engraved a spiral symbol. The next morning, Bridger forces Fitzgerald to admit that there are not pursuing Arikara. They reach the fort, and Fitzgerald falsely reports to Henry that Hawk vanished and Glass died. Bridger is complicit in the lie about Glass's death, but remains unaware of Hawk's murder. Glass starts an arduous journey through the wilderness, bringing Bridger's canteen with him. He performs a crude cauterization of his wounds and eludes the pursuing Arikara by jumping into river rapids. He encounters Pawnee refugee Hikuc, who tells Glass that \"revenge is in the Creator 's hands.\" The men share bison meat and travel together. As a storm approaches, Hikuc constructs a sweat lodge for the feverish Glass to shelter in. After a hallucinogenic experience in the lodge, Glass emerges to discover that French Canadian hunters have lynched Hikuc. Glass infiltrates the hunters' camp and sees their leader, Toussaint, raping Powaqa. Glass frees her; with a knife provided by Glass, she threatens Toussaint with castration to silence him from alerting the other Frenchmen and then flees while Glass kills several hunters and recovers Hikuc's horse, leaving Bridger's canteen behind. The following day, Glass is ambushed by the Arikara and drives over a cliff on his horse as he escapes their pursuit. He survives the night by disemboweling the dead horse and sheltering nude inside its carcass. A French survivor staggers into Fort Kiowa, and Bridger recognizes the man's spiral-engraved canteen. Believing that it was stolen, Henry organizes a search party. Fitzgerald, realizing that Glass is alive, empties the outpost's safe and flees, intending to reach Texas . The search party finds the exhausted Glass. Furious, Henry orders the arrest of Bridger upon returning to the fort, but Glass vouches for him, saying Bridger was deceived by Fitzgerald, who murdered Hawk. Glass and Henry set out in pursuit of Fitzgerald. After the two men split up, Fitzgerald ambushes, kills, and scalps Henry. Glass props up Henry's corpse on his horse to act as a decoy, taking its place himself to ambush Fitzgerald and shoot him in the shoulder. He pursues Fitzgerald to a riverbank, where they engage in a brutal fight. Glass is about to kill Fitzgerald, but he spots a band of Arikara downstream. He remembers Hikuc's words and pushes Fitzgerald downstream into the hands of the Arikara. Their chief, Elk Dog, kills Fitzgerald by stabbing him in the head and then scalps his body, and the Arikara (who have found Powaqa) spare Glass. Glass retreats into the mountains, where he is visited by his wife's spirit.",
  "wiki": "https://en.wikipedia.org/wiki/The_Revenant_(2015_film)"
}