{
  "year": "2016",
  "name": "Fences",
  "plot": "In 1957, Pittsburgh , Troy Maxson lives in a modest house with his wife, Rose, and their teenage son, Cory. He works as a garbage collector alongside his best friend, Jim Bono, whom he has known for decades. Troy left home at 14 after standing up to his abusive father, becoming a robber to survive on his own. While serving time for killing a man during a robbery, he met Bono and showed himself to be a talented baseball player. He played well in the Negro leagues , but never made it to the major leagues because the color barrier was not broken until he was past his prime. A gifted storyteller, Troy claims to have survived near-fatal pneumonia as a young man by defeating Death in a wrestling match. Troy's younger brother, Gabriel, sustained a head injury in World War II that left him mentally impaired, and Troy used the $3,000 government payout that Gabe received as the down payment for his house. As Gabriel recently moved out to rent a room elsewhere, Troy no longer gets rent money from Gabriel and is under increased financial strain. Gabriel sometimes gets in trouble with the law for his erratic behavior, so Rose suggests to Troy that Gabriel might be better off residing in a psychiatric hospital . Lyons, Troy's son from a previous relationship, visits Troy on payday to borrow money, which upsets Troy, as he believes a man has a responsibility to work hard to find his own way and provide for his family. Rose tells Troy that Cory is being scouted by a college football team, but Troy refuses to sign the paperwork, saying he does not want Cory to pursue a career in athletics, only to be held back due to discrimination, like he did. The father and son have a distant relationship, seemingly doing little together other than building a fence around the backyard for Rose on Saturdays. When he discovers Cory has switched from a weekday-evening to a weekend shift at the A&P because of football practice, Troy demands that he switch back. He later finds out that Cory did not return to the job, so he tells the football coach that Cory is no longer allowed to play. Cory lashes out, throwing his helmet at Troy, and Troy warns his son that this is \"strike one\". After complaining about his company's racist employment practices, Troy is promoted to a garbage truck driver, becoming the first African-American to do so in Pittsburgh. Bono suspects that Troy is cheating on Rose with Alberta, a woman he met at Taylor's bar, and encourages him to break it off. Troy repeatedly denies the affair, only admitting it to Bono and then Rose after he has gotten Alberta pregnant. He and Rose argue, and, when he aggressively grabs Rose's arm, Cory pushes him away, giving him \"strike two\". Troy and Rose continue to live in the same house, but are estranged. Gabriel is sent to live in a hospital. Alberta dies during childbirth, greatly upsetting Troy, who yells to Death that their fight is just between the two of them. He brings the baby, Raynell, home, and Rose agrees to raise the girl as her own, but refuses to accept Troy back into her life. Cory is considering enlisting in the Marines , having missed his opportunity to attend college. One day, when he returns home, an intoxicated and bitter Troy blocks his path and instigates a fight. When Cory swings a baseball bat at Troy, Troy overpowers Cory and kicks him out of the house. Disoriented, Troy once again challenges Death to come for him. Six years later, Troy dies of a heart attack. Cory, now a corporal in the Marines, returns home, but informs Rose that he has decided not to go to the funeral. Rose is upset and says that, while Troy had many flaws, he tried to do the best he could as a father. Cory reconsiders after sharing memories of Troy with Raynell, who he has not seen since she was a baby. Lyons is serving time in prison for forgery, but gets a furlough to attend the funeral, and Gabriel is released from the hospital as well. Before departing for the cemetery, Gabriel says it is time to tell Saint Peter to open the gates of Heaven for Troy. In the backyard, he attempts to play his trumpet, failing at first, but succeeding on his third try. The Sun comes out from behind the clouds and shines on Troy's family.",
  "wiki": "https://en.wikipedia.org/wiki/Fences_(film)"
}