{
  "year": "2016",
  "name": "Moonlight",
  "plot": "In Liberty City , Miami at the height of the crack epidemic , Afro-Cuban drug dealer Juan finds Chiron, a withdrawn child who goes by the nickname \"Little\", hiding from bullies in a crackhouse . Juan lets Chiron spend the night with him and his girlfriend Teresa before returning Chiron to his mother Paula. Chiron continues to spend time with Juan, who begins to teach him the basics of life, from which he believes Chiron can benefit. One night, Juan encounters Paula smoking crack with one of his customers. Juan berates her for neglecting her son, but she rebukes him for selling crack to her in the first place. They argue over Chiron's upbringing; Paula asks if Juan is prepared to explain to Chiron why he gets tormented by his peers, alluding signs that he is gay. She goes home and takes out her frustration on Chiron. The next day, Chiron admits to Juan and Teresa that he hates his mother and asks what a \" faggot \" is. Juan tells him it is \"a word used to make gay people feel bad.\" He tells Chiron there is nothing wrong with being gay and that he should not allow others to mock him. Chiron then asks Juan whether he sells drugs and whether his mother does drugs. After Juan remorsefully answers yes to both questions, Chiron leaves as Juan hangs his head in shame. Now a teenager, Chiron balances avoiding school bully Terrel and spending time with Teresa, who lives alone after Juan's death. Paula, who has turned to prostitution due to her worsening addiction, forces Chiron to give her the money he receives from Teresa. Chiron's childhood friend Kevin tells him about a detention he received for having sex with a girl in a school stairwell. Chiron later dreams about Kevin and the girl having sex in Teresa's backyard, waking with a start. One night, Kevin visits Chiron at the beach near his house. While smoking a blunt together, the two discuss their ambitions and Kevin's nickname for Chiron: \"Black.\" They kiss, and Kevin gives Chiron a handjob . The next day, Terrel manipulates Kevin into participating in a hazing ritual. Kevin reluctantly punches Chiron until he cannot stand, watching as Terrel and other boys savagely attack him. When the principal urges him to reveal his attackers' identities, Chiron refuses, saying that reporting them will not solve anything. The next day, an enraged Chiron walks into class and smashes a chair over Terrel's head before being restrained. Chiron is arrested and taken from school in a police cruiser while Kevin watches. A decade later, now going by \"Black\", an adult Chiron deals drugs in Atlanta and is an imposing figure in his community. He receives frequent calls from Paula, who asks him to visit her at the drug treatment center where she lives. One morning, Kevin unexpectedly calls and invites Chiron to see him should he ever come to Miami. Chiron visits Paula; though he is withdrawn, she apologizes for not loving him when he needed it most and says she loves him even if he does not love her back. The two tearfully reconcile. Chiron drives to Miami to visit Kevin at the diner where he works as a cook. Kevin makes a meal for Chiron, who does not respond to questions about his life and how he has seemingly changed. Kevin shares that he had a son with an ex-girlfriend and, after getting out of prison, is fulfilled by his role as a father. Chiron reveals his unexpected drug dealing, which disappoints Kevin, and asks Kevin why he called. Kevin plays \" Hello Stranger \" by Barbara Lewis on the jukebox, the song that made him think of Chiron. The two go to Kevin's apartment. Kevin tells Chiron that although his life did not turn out as he had hoped, he is happy, resulting in Chiron admitting that he has not been intimate with anybody since their encounter years ago. As Kevin comforts him, Chiron remembers himself as Little, standing on a beach in the moonlight.",
  "wiki": "https://en.wikipedia.org/wiki/Moonlight_(2016_film)"
}