{
  "year": "2017",
  "name": "Phantom Thread",
  "plot": "In 1954 London, fashion designer Reynolds Woodcock creates dresses for members of high society, including royalty. His clients view him as a genius whose creations enable them to become their best selves, but his creativity and charm are matched by his obsessive and controlling personality. Cyril, his sister, manages his fashion house's day-to-day operations and tries to protect him from anything that might distract him from his work. The superstitious Reynolds is haunted by their mother's death and often stitches hidden messages into the linings of the dresses he makes. After designing a new gown for a revered client, Lady Harding, Reynolds visits a restaurant near his country house and meets a foreign waitress, Alma Elson. She accepts his invitation to dinner. Their relationship blossoms, and she moves in with him, becoming his model, muse, and lover. Cyril initially mistrusts and dominates Alma, but comes to respect her willfulness and determination. At first, Alma enjoys being part of Reynolds's work, but he proves aloof, hard to please, and finicky; as a result, they start to bicker. When Alma tries to show her love for Reynolds by surprising him with a romantic dinner, he lashes out, calling it an \"ambush\" and questioning her motives. Alma retaliates by poisoning his tea with wild mushrooms gathered outside the country house. As he readies a wedding gown for a Belgian princess, Reynolds collapses, damaging the dress and forcing his staff to work all night to repair it. He becomes gravely ill and has hallucinations of his mother. Alma stays by his side, nursing him back to health. After Reynolds recovers, he tells Alma that a house that does not change \"is a dead house\" and asks her to marry him. Taken aback, she hesitates, but then accepts. After a honeymoon in Switzerland , Reynolds and Alma start bickering again as Reynolds's domineering personality reasserts itself. Cyril tells Reynolds that Lady Harding is now a client at a rival fashion house and suggests that his classic, conservative designs may be going out of style. Reynolds blames Alma for upending his routines, saying she doesn't fit in and has turned Cyril and him against each other. Alma overhears him. At the country house, Alma makes Reynolds an omelet poisoned with the same mushrooms as before. As he chews his first bite, she informs him that she wants him weak and vulnerable, then strong again after she has taken care of him. Reynolds realizes the omelet is poisoned, but ostentatiously swallows the bite and tells her to kiss him before he is sick. As he lies ill again, Alma imagines their future with children, a rich social life, and a bigger role for her in the dressmaking business. She acknowledges that while there are challenges ahead, their love and their complementary needs can overcome them.",
  "wiki": "https://en.wikipedia.org/wiki/Phantom_Thread"
}