{
  "year": "2017",
  "name": "Dunkirk",
  "plot": "The film is presented in a nonlinear narrative . The following is a linear summary of the plot. In 1940, during the Battle of France , Allied soldiers retreat to Dunkirk to be evacuated . One, a British soldier named Tommy, loses his squadmates and flees through the perimeter held by French troops to the beach, where thousands await evacuation. He helps another soldier, Gibson, bury a body. After a Luftwaffe dive-bomber attack, they attempt to board a hospital ship at the single, vulnerable mole available for embarking on deep- draft ships, by rushing a wounded man on a stretcher to the ship but are ordered off. They overhear Commander Bolton, Colonel Winnant and a Rear Admiral discuss the best way to get their army evacuated. The ship is sunk by a Luftwaffe attack; Tommy saves a Highlanders regiment soldier, Alex, from being crushed by the wreck. That night, the three board a destroyer , but it is hit by a U-boat torpedo before it can depart; Gibson saves Tommy and Alex as the ship sinks, and an officer makes them return to the beach. The Royal Navy requisitions civilian vessels in England to get to Dunkirk. In Weymouth , civilian sailor Dawson and his son Peter set out in his boat Moonstone , rather than let the Navy commandeer her. Their teenage hand George joins them on impulse. In the English Channel , they save the officer, now shell-shocked after surviving a U-boat sinking. Realising that Dawson is going for Dunkirk, the officer grows fearful and Peter locks him up. He escapes, urging they turn back, and tries to wrest control of the boat; in the scuffle, he elbows George, who falls down a staircase and suffers a severe head injury. Three Royal Air Force Spitfires fly towards Dunkirk to provide cover for the evacuation, limited to one hour of operation by their fuel supply. They engage in a dogfight with a Messerschmitt Bf 109 . After shooting it down, one of the pilots, Farrier, has his fuel gauge smashed by another fighter. He and the second Spitfire pilot, Collins, determine that their leader has gone down and fly on with Collins radioing Farrier about their remaining fuel. The crew of the Moonstone witness the two RAF pilots protect a minesweeper from a bomber escorted by fighters: Collins's Spitfire is hit and he ditches . Although trapped in his canopy as the plane sinks, Collins is saved by Peter. Becoming increasingly desperate, Tommy, Alex and Gibson join Highlanders soldiers in a grounded trawler in the intertidal zone outside the perimeter, hoping the tide will float them home. After its Dutch sailor returns, Germans start shooting at the boat for target practice, and water enters through the bullet holes. Alex, attempting to lighten the boat, accuses Gibson, who has been silent the entire time, of being a German spy despite Tommy's pleas. Gibson reveals he is French, having taken the identity of the buried soldier in hopes of being evacuated earlier. The tide finally lifts the trawler but at sea, the group has to abandon the sinking boat. Gibson is entangled in a chain and drowns. Noticing another bomber, Farrier chooses to continue aiding the evacuation, despite knowing he will never make it home. Despite his attempts, the destroyer is bombed and sinks, as Moonstone manoeuvres to save men in the water. Amidst the chaos, George dies. Farrier shoots the bomber down; its crash ignites oil on the water, but Tommy and Alex are saved by Moonstone . Farrier reaches Dunkirk just as his fuel runs out. Gliding, he shoots down a dive-bomber approaching the mole, and is cheered on by the troops. Farrier lands his Spitfire on the beach beyond the perimeter, burns it and calmly awaits capture as German soldiers approach. Dawson has Moonstone evade aerial attack, using a technique taught by his deceased elder son, a pilot lost at the start of the war. With 300,000 men successfully evacuated, Bolton stays to oversee the French evacuation. The officer and Collins part ways with the Dawsons, as Peter arranges for the local paper to eulogise George, fulfilling George's desire to do something that would make the newspaper. Tommy and Alex board a train with others and are heralded by the public at Woking , as Tommy reads Churchill's address to Alex from a newspaper.",
  "wiki": "https://en.wikipedia.org/wiki/Dunkirk_(2017_film)"
}