{
  "year": "2017",
  "name": "Lady Bird",
  "plot": "In the fall of 2002, Christine McPherson, who calls herself \"Lady Bird\", is a senior at a Catholic high school [ a ] in Sacramento, California . Despite her family's financial struggles, she longs to attend a prestigious college in \"a city with culture\" on the East Coast . During a car ride, Lady Bird's mother Marion tells her that she is ungrateful and her dreams are unrealistic. To prove a point, Lady Bird jumps from the moving car, breaking her arm. Lady Bird and her best friend Julie join their school's theater program. Although Lady Bird resents Julie's comparative talent, she meets her new boyfriend Danny through the program. She spends her last Thanksgiving before graduation with Danny's wealthy family, disappointing Marion. However, Lady Bird catches Danny kissing a boy and breaks up with him. At Marion's behest, Lady Bird begins working at a coffee shop to earn money. She tries to become more popular by bonding with popular students Kyle and Jenna, exaggerating her family's wealth and vandalizing a nun's car with Jenna. She reconciles with Danny after he confronts her to apologize and tearfully expresses his fear of coming out , but leaves the theater program and spends less time with Julie. Lady Bird's new relationships begin to fall apart. After she is suspended from school for heckling a guest speaker at an anti-abortion assembly , Jenna tries to visit her and is dismayed to learn that Lady Bird dishonestly told her that Danny's grandmother's house was her own. Lady Bird kisses Kyle at a party, and they confess to each other that they are both virgins. However, when they have sex for the first time (an experience Lady Bird finds underwhelming), Kyle admits he was lying. Deeply wounded, Lady Bird seeks comfort from her mother, who provides it without asking for an explanation. Marion begs Lady Bird to only apply to California colleges, revealing that Lady Bird's father, Larry, has lost his job and cannot afford out-of-state tuition. Despite Marion's concerns, Larry secretly encourages Lady Bird to apply to her dream schools, resolving to refinance their home mortgage if necessary. When admissions decisions are released, Lady Bird is dismayed to hear that her presumptive destination is UC Davis , just 20 minutes away. She is waitlisted for a university in New York City , but does not tell Marion. On prom night, Kyle, Jenna, and Jenna's boyfriend decide to skip the prom in favor of attending a house party. Lady Bird initially agrees to go with them, but changes her mind and visits Julie instead. They rekindle their friendship and go to prom together. Danny accidentally mentions the waitlist in front of Marion, who gives Lady Bird the silent treatment for the remainder of the summer, even after she is accepted. Before she leaves for New York, her parents drop her off at the airport, but Marion refuses to go inside to say goodbye. Marion eventually relents, but Lady Bird has already gone through security. Marion breaks down crying in Larry's arms. After arriving in New York, Lady Bird finds several heartfelt, unfinished letters from Marion in her luggage, which Marion initially threw away before Larry began secretly collecting them for Lady Bird. Moved, Lady Bird begins going by her given name, Christine, again. Christine is hospitalized after drinking heavily at a college party. After being released, she goes to a local church [ b ] and is moved to tears. Christine calls home and leaves a message for her mother, apologizing and thanking her for all her help.",
  "wiki": "https://en.wikipedia.org/wiki/Lady_Bird_(film)"
}