{
  "year": "2017",
  "name": "Get Out",
  "plot": "On a suburban street at night, a black man walks alone, talking on the phone. A car pulls up to the curb beside him; sensing trouble, the man starts to walk away. A person wearing a helmet tackles and subdues the man, drags him into the car, and drives away. Chris Washington, a black photographer, travels to upstate New York for a weekend getaway to meet the family of his white girlfriend, Rose Armitage. On the way, they hit a deer, and Rose defends Chris when the officer asks for his ID as he was not driving. He has uncomfortable conversations with Rose's parents, Dean, a neurosurgeon , and Missy, a psychiatrist. Later, Rose's brother Jeremy arrives, and Chris observes eerie behavior from the family's black servants, Georgina and Walter. Missy tricks Chris into having a hypnotherapy session with her, using the sound of a spoon stirring in a teacup as a hypnotic trigger, ostensibly to cure his smoking addiction. While in a trance, Chris reveals that his mother was killed in a hit-and-run when he was a child, and he feels guilty because he waited too long to call for help. At Missy's prompting, Chris' consciousness falls into a dark void she calls the \"sunken place,\" where his body becomes temporarily paralyzed. The next morning, Chris no longer has a desire to smoke. Dozens of wealthy white guests arrive for the Armitages' annual get-together, and their remarks about Chris cause him to feel uncomfortable. Chris meets a blind art dealer, Jim Hudson, who takes an interest in his photography, and Logan King, another black man. Like Walter and Georgina, Logan behaves unnaturally, and he is married to a white woman thirty years older than him. When Chris photographs Logan, the camera flash causes Logan to become hysterical, rushing at Chris and frantically lashing out at him, telling him to \"get out.\" Logan is taken away by Dean, who later claims Logan had a seizure . The party guests appear to hold some sort of silent auction with a photo of Chris as the prize. Chris sends a photo of Logan to his friend, TSA officer Rod Williams, who recognizes Logan as Andre Hayworth, a missing man from Brooklyn. Chris discovers photos of Rose dating numerous black people, including Walter and Georgina, contradicting her earlier claim that Chris is the first black person she has dated. He tries to leave, but Rose refuses to give him the car keys. Jeremy and Dean block the doors and Missy hypnotises Chris back to the sunken place. Chris awakens strapped to an armchair in the basement. In a video, an old man, who introduces himself as Roman Armitage, explains that his family transplants the brains of their wealthy friends into black people's bodies to acquire their desirable physical characteristics, leaving the host's consciousness trapped in the sunken place. Jim Hudson appears on the TV, explaining that he wants Chris's eyesight. Meanwhile, Rod, who has been trying to contact Chris and suspects foul play, goes to the police, but they do not believe his theory about the Armitages. Missy hypnotizes Chris again. However, it is revealed that he has blocked the trigger by plugging his ears with cotton stuffing from the armchair. Chris bludgeons Jeremy and then kills Dean (who falls and accidentally sets fire to the room) and Missy when she attacks him, before finishing off Jeremy when he attacks again. Chris tries to escape in Jeremy's Porsche but accidentally hits Georgina, who has the brain of Rose's grandmother, Marianne. Compelled by guilt over his mother's death, he picks her up to save her, but she attacks him, causing the car to crash and kill her. Rose and Walter, who has the brain of Rose's grandfather Roman, arrive to capture Chris. During a scuffle, Chris uses his phone's flash to briefly free Walter from Roman's control. Walter takes Rose's rifle, shoots her, and fatally shoots himself. Chris starts strangling Rose, but cannot bring himself to kill her. A police car arrives and Chris surrenders, with Rose believing that the police will arrest Chris and save her, but it is revealed to be Rod's TSA car. Rod picks up Chris, leaving Rose to bleed out on the side of the road.",
  "wiki": "https://en.wikipedia.org/wiki/Get_Out"
}