{
  "year": "2017",
  "name": "The Shape of Water",
  "plot": "In 1962, during the Cold War , Elisa Esposito works as a janitor in a secret government laboratory in Baltimore, Maryland . Found abandoned by the side of a river as an infant with scars on her neck, Elisa is mute and communicates through sign language , and lives a routine life in an apartment above a movie theater. Her only friends are her closeted middle-aged neighbor Giles, an advertising illustrator, and her coworker Zelda. Colonel Richard Strickland has captured a creature from a South American river and taken it to the facility for study. Elisa discovers it is a humanoid amphibian , and eventually bonds with the creature after routinely visiting him in secret. Seeking an advantage in the Space Race , Strickland persuades General Frank Hoyt to vivisect the Amphibian Man to examine his biology, specifically the respiration system. Robert Hoffstetler, a scientist who is secretly a Soviet spy, pleads with Strickland to keep him alive for further study, while being ordered by his handlers to kill the creature. When Elisa learns what awaits the Amphibian Man, she begs Giles to help her liberate him. He refuses at first, but has a change of heart after failing a work assignment and being rejected by a local restaurant manager, whom he discovers is racist and homophobic . Hoffstetler learns of Elisa's plan and chooses to assist her. Though initially reluctant, Zelda also becomes involved in the plot. They successfully get the Amphibian Man to Elisa's apartment. Elisa keeps him in her bathtub, planning to release him into a nearby canal when heavy rain allows access to the ocean. Strickland interrogates employees, including Elisa and Zelda, but learns nothing. The Amphibian Man later encounters one of Giles's cats and devours it. When Giles tries to stop him, he slashes Giles's arm and flees. Elisa finds him and coaxes him back to her apartment. The creature touches Giles on his balding head and wounded arm. The next morning, Giles discovers his hair is regrowing and the wounds on his arm have healed . Elisa continues to grow closer to the Amphibian Man, culminating in sexual intercourse . General Hoyt unexpectedly arrives at the laboratory and gives Strickland a 36-hour deadline to recover the Amphibian Man or his career will be over. Meanwhile, Hoffstetler is told by his handlers that he will be extracted from the US in two days. As the likely release date approaches, the Amphibian Man's health begins to deteriorate. Hoffstetler goes to meet his handlers, with Strickland following. At the rendezvous, Hoffstetler is shot. Strickland intervenes, shooting the handlers. Realizing that Hoffstetler is a spy, Strickland tortures the dying man into revealing the Amphibian Man's whereabouts. When Hoffstetler alludes to Elisa and Zelda, Strickland confronts the latter in her home. She refuses to divulge anything, but her husband reveals that Elisa has the Amphibian Man. Zelda telephones Elisa and warns her to release the creature. Strickland ransacks Elisa's apartment and finds evidence of the creature in the bathtub and a calendar note revealing where she plans to release him. At the canal, Elisa and Giles are bidding farewell to the creature when Strickland arrives, knocks Giles down, and shoots both the Amphibian Man and Elisa. Giles regains consciousness and fights Strickland while at the same time, the Amphibian Man heals himself and fatally slashes Strickland's throat. As the police arrive on the scene with Zelda, the Amphibian Man takes Elisa and jumps into the canal. As he gives her a kiss and uses his healing power, the scars on her neck open to reveal gills, and she is revived. Elisa and the Amphibian Man embrace.",
  "wiki": "https://en.wikipedia.org/wiki/The_Shape_of_Water"
}