{
  "year": "2018",
  "name": "Roma",
  "plot": "In 1970, Cleodegaria \"Cleo\" Gutiérrez is a Mixtec live-in maid in an upper-middle-class household in Mexico City 's Colonia Roma neighborhood. The household consists of the mother, Sofía; the father, Antonio; their four school-aged children, Pepe, Sofi, Toño and Paco; and Sofía's mother, Teresa. Antonio, a medical doctor, often leaves for business conferences, but Sofía's distressed reactions to his absences suggest he is having an extramarital affair. Meanwhile, Cleo believes she might be pregnant. She tells her boyfriend, Fermín, who pretends to be supportive but immediately abandons her at a movie theatre. She nervously reveals her news to Sofía, who provides emotional comfort and takes her to the hospital, confirming her pregnancy. Sofía then takes Cleo and the children to a family friend's hacienda for New Year celebrations. Recent tensions over land in the area arise, and a large forest fire erupts that the partygoers help extinguish. Back in the city, Cleo sees Antonio and a young woman flirting on the street. She looks for Fermín, traveling to an impoverished district on the edge of the city, where she finds him training at a military-style camp run by Professor Zovek . Fermín denies that her baby is his, threatening to beat Cleo and their child if she talks to him again. Cleo returns to the city, and the increasingly distraught Sofía tries unsuccessfully to conceal her husband's infidelity from their children. With the baby almost due, Teresa takes Cleo shopping for a crib downtown. Suddenly a student protest outside the store turns into the Corpus Christi massacre of 10 June 1971 as a paramilitary group, Los Halcones (\"the Falcons\"), attacks the protesters. The militants chase a student into the store and murder him. Fermín, appearing as one of Los Halcones, points a gun at Cleo and Teresa before wordlessly exiting. Then Cleo's water breaks . The violence in the streets slows traffic and her attempt to get to the hospital. When she arrives, Antonio briefly appears, reassures her, then makes an excuse to leave. She cries in agony as her baby girl is delivered stillborn . Later, Sofía takes Cleo and the children on a family outing to the beaches at Tuxpan . Sofía tells her children that she and their father are separating and that the outing is giving him time to collect his belongings from their home. At the beach, a strong current almost drowns Sofi and Paco, but Cleo wades in and saves them, despite not knowing how to swim. Sofía and the children affirm their love for Cleo, all of them holding each other and crying, while Cleo confesses that she did not want her baby to be born. The group returns home to find the house reorganized, and Cleo prepares a load of clothes for washing.",
  "wiki": "https://en.wikipedia.org/wiki/Roma_(2018_film)"
}