{
  "year": "2019",
  "name": "Joker",
  "plot": "Arthur Fleck is a party clown and aspiring stand-up comedian who lives with his mother, Penny, in a crime- and recession -ridden Gotham City . He suffers from a neurological disorder that causes him to have random, uncontrollable laughing fits, requiring medication he depends on social services to obtain. After Arthur is attacked by street youths while on the job, his co-worker Randall gives him a revolver to defend himself. Arthur pursues a relationship with his neighbor, single mother Sophie Dumond, and invites her to see his routine at a comedy club. Arthur accidentally drops his gun while performing at a children's hospital. Randall does not admit he gave the gun to Arthur, leading to Arthur's firing. While riding home on the subway and still wearing his clown make-up, he is mocked and assaulted by three drunk businessmen from Wayne Investments . He fatally shoots two of them in self-defense and murders the third as he attempts to flee. Their employer, billionaire mayoral candidate Thomas Wayne , condemns the killings, but supporters begin sporting clown masks in Arthur's image. Budget cuts shut down the social services program, leaving Arthur without his medication. Sophie attends Arthur's stand-up routine, which fails due to his disorder and his jokes falling flat. Arthur intercepts a letter from Penny to Thomas indicating that he is Thomas's illegitimate son, and berates his mother for hiding the truth of his parentage. He goes to Wayne Manor , where he meets Thomas's young son Bruce , but flees after a scuffle with family butler Alfred Pennyworth . Penny suffers a stroke after being questioned by two detectives investigating Arthur's involvement in the subway murders, and is hospitalized. Arthur's idol, popular late-night talk show host Murray Franklin, presents clips of Arthur's failed performance on his show and mockingly calls him a \"joker\", much to Arthur's distress. Arthur confronts Thomas at a movie theatre. Thomas denies being his father, claiming that Penny also is not his biological mother. Arthur visits Arkham State Hospital and reads Penny's file, which states she was a delusional narcissist who adopted Arthur while working as a housekeeper for the Waynes. She developed an imaginary intimate relationship with Thomas, which included Arthur being their biological son. At the same time, Penny raised Arthur with a boyfriend who physically and sexually abused them, leading to his neurological disorder. A distraught Arthur enters Sophie's apartment unannounced. Frightened, she kindly asks him to leave, revealing their relationship to be a figment of Arthur's imagination. The following day, Arthur smothers Penny with a pillow at the hospital. Due to the fame caused by the clips of his performance, Arthur is invited onto Murray's show. Arthur decides to bring the gun, intending to kill himself on live TV. While getting ready, Arthur is visited by Randall and another ex-colleague, Gary. Arthur fatally stabs and beats Randall, but spares Gary for being kind to him in the past. The detectives investigating Arthur pursue him onto a train filled with clown protesters. Arthur incites a brawl, during which one detective accidentally shoots and kills a protester. The other protesters, in turn, beat the detectives while Arthur escapes. At the studio, Arthur asks Murray to introduce him as \" Joker \", a reference to his earlier mockery. As the show broadcasts live, Arthur tells morbid jokes, confesses to the subway murders, rants about societal neglect of the downtrodden, and berates Murray for ridiculing him. After a final joke, Arthur fatally shoots Murray in the head. Arthur is arrested, and riots erupt across the city. Looters in an ambulance crash into the police car carrying Arthur and free him. Meanwhile, one rioter corners the Wayne family in an alley and murders Thomas and his wife Martha in front of Bruce. Arthur stands on the police car, dances to the cheers of the crowd, and smears the blood on his face into a smile. Sometime later at Arkham, Arthur laughs to himself about a joke during a session with his new therapist. He declines telling it to her, claiming she would not understand it. He leaves behind a trail of bloodied shoeprints as an orderly chases him down.",
  "wiki": "https://en.wikipedia.org/wiki/Joker_(2019_film)"
}