{
  "year": "2019",
  "name": "Parasite",
  "plot": "Kim Ki-taek and Chung-sook live in a semi-basement flat ( banjiha ) in Seoul with their daughter Ki-jung and son Ki-woo. As the family has financial struggles and low-income jobs, family friend Min-hyuk gives them a scholar's rock meant to promise wealth. Leaving to study abroad, he suggests that Ki-woo lie about his qualifications to take over Min-hyuk's job as an English tutor for Da-hye, the daughter of the wealthy but naïve Park family. Min-hyuk trusts Ki-woo because he likes Da-hye and wants to ask her out when he returns. After Ki-jung helps forge a certificate for him, Ki-woo, posing as a Yonsei University student named \"Kevin\", goes to the Parks' home. The mother explains how fond they are of Min and that Ki-woo needs to be up to his standard. She then asks to sit in on Da-hye's first lesson, and he is hired. The Kims scheme to secure jobs for each family member within the Park household while concealing their true identities. Ki-woo recommends \"Jessica,\" actually Ki-jung, as an art therapist for the Parks' young son, Da-song, who has been traumatised after seeing a \"ghost\" in their kitchen. Ki-jung then frames Yoon, the Parks' chauffeur, by making it appear as though he had a sexual encounter in the car, leading to Ki-taek being hired as his replacement. The Kims exploit the peach allergy of the Parks' longtime housekeeper, Moon-gwang, to convince Mrs Park that Moon-gwang has tuberculosis , and Chung-sook is hired as her replacement. Meanwhile, Ki-woo begins a secret romantic relationship with Da-hye. While the Parks are away on a camping trip, the Kims revel in the luxuries of the house. Moon-gwang appears at the door, claiming to have forgotten something in the basement. She goes through a hidden entrance to an underground bunker created by the house's architect and previous owner, who had kept its existence secret from the Parks. There, Moon-gwang's husband, Geun-sae, has been hiding from loan sharks and is revealed to be the \"ghost\" Da-song saw when he was trying to leave the bunker to steal food. Moon-gwang begs Chung-sook to allow Geun-sae to continue living there in exchange for regular payments, but the three other Kims, who are eavesdropping, accidentally reveal their true identities. Moon-gwang films them and threatens to expose their deception to the Parks. After the Parks call to inform the Kims that they are returning early due to a sudden severe rainstorm, the Kims quickly destroy all evidence of their ruse and subdue Moon-gwang and Geun-sae in the bunker, although Moon-gwang is injured during the struggle. The Kims manage to escape, but the torrential rain floods their flat with sewage water, forcing them to take shelter in a gymnasium alongside other displaced people. The next day, Mrs Park organises an impromptu garden party for Da-song's birthday, with the elder Kims assisting while the younger Kims are invited as guests. Ki-woo enters the bunker with his scholar's rock, intending to kill Geun-sae and Moon-gwang. Moon-gwang is already dead from injuries sustained in the previous day's brawl; Geun-sae bludgeons Ki-woo with the rock, leaving him unconscious. Geun-sae then leaves the bunker and stabs Ki-jung with a kitchen knife in front of horrified party guests. Da-song suffers a seizure upon seeing the \"ghost\" again. Chung-sook impales Geun-sae with a barbecue skewer after a struggle. While Ki-taek tends to Ki-jung, Mr Park orders him to drive Da-song to the hospital. Ki-taek, momentarily enraged by Mr Park's lack of empathy, stabs him with Geun-sae's knife and flees. Weeks later, Ki-woo is recovering from brain surgery, and he and Chung-sook have been convicted of fraud and placed on probation. Ki-jung has died from her injuries, and Ki-taek – now a wanted fugitive – has disappeared. Geun-sae is presumed to have been a random homeless man, and the motives for the murders remain unsolved. Ki-woo spies on the Parks' former home, now owned by a foreign family, and notices a Morse code message in a light visible from outside. Ki-taek, hiding in the bunker, has buried Moon-gwang in the garden and sends daily messages, hoping Ki-woo will see them. Still living in a semi-basement flat with his mother, Ki-woo writes a letter to Ki-taek, vowing to earn enough money one day to buy the house and free him.",
  "wiki": "https://en.wikipedia.org/wiki/Parasite_(2019_film)"
}