{
  "year": "2020",
  "name": "Judas and the Black Messiah",
  "plot": "In 1968, 19-year-old petty criminal William O'Neal is arrested in Chicago after attempting to steal a car by posing as a federal officer. He is approached by FBI Special Agent Roy Mitchell, who offers to have O'Neal's charges dropped if he works undercover for the Bureau. O'Neal is assigned to infiltrate the Illinois chapter of the Black Panther Party (BPP) and obtain information on its leader, Fred Hampton . O'Neal begins to grow close to Hampton, who works to form alliances with rival gangs and militia bands while extending community outreach through the BPP's Free Breakfast for Children Program. Hampton's persuasive oratory eventually help to form the multiracial Rainbow Coalition along with the Young Lords and Young Patriots Organization . Hampton also falls in love with Deborah Johnson , a fellow BPP member. O'Neal begins to relay intelligence to Mitchell, who in return pays him. After Hampton is imprisoned for allegedly stealing $71 worth of ice cream bars, O'Neal begins to rise through the ranks and is promoted to security captain. When a shootout between the Chicago Police and the BPP occurs at the chapter office, O'Neal sneaks out as the police firebomb the office. Outraged that he could have been killed, O'Neal attempts to quit being an informant, but Mitchell refuses, threatening him with the original charges. Three months later, Hampton is released from prison while appealing his charges and reunites with Deborah, now pregnant with his child. BPP member Jimmy Palmer, who was hospitalized with non-life-threatening injuries after being shot by a police officer, dies unexpectedly while being transferred to another hospital. Assuming police have murdered Jimmy, fellow member Jake Winters engages in a shootout with police, killing several officers before being gunned down himself. After Hampton's appeal is rejected, FBI Director J. Edgar Hoover orders that he be \"neutralized\" rather than allowing him to return to prison . Mitchell coerces O'Neal into helping with the plan by warning him that the BPP will turn on him if they find out he's an informant, and O'Neal reluctantly agrees to help. O'Neal is later handed a vial of sedatives and ordered to drug Hampton's drink with it by another undercover FBI collaborator, who hands O'Neal his old fake FBI badge to prove his credentials. The following evening, BPP members gather at Hampton's apartment before he must depart for prison. An allied gang leader offers Hampton money to flee the country, but he turns it down and instead orders that a clinic be established with the money in Jake's memory. During the evening, O'Neal reluctantly drugs Hampton's drink and departs soon after. Hours later, officers and agents raid the apartment and assassinate Hampton after shooting or injuring the other Black Panthers, while Deborah is arrested. Later, O'Neal meets with Mitchell, who gives him money and a pair of keys to a gas station which is being given to him. O'Neal attempts to quit again but reluctantly accepts the money and keys and puts them in his pocket. Archive footage is shown of Hampton's speeches, including his funeral procession, and an interview O'Neal gave in 1989. [ 5 ] The title cards state that O'Neal continued to work as an informant within the BPP before taking his own life in 1990. A lawsuit was filed against the FBI in 1970 and 12 years later was settled for $1.85 million. As of the film's release, Fred Hampton Jr. and his mother serve as chairman and board member of the Black Panther Party Cubs.",
  "wiki": "https://en.wikipedia.org/wiki/Judas_and_the_Black_Messiah"
}