{
  "year": "2020",
  "name": "Minari",
  "plot": "In 1983, the South Korean immigrant Yi family moves from California to a plot of land in Arkansas , where the father, Jacob, believes the soil is fertile and hopes to grow Korean produce to sell to vendors in Dallas . One of his first decisions is to decline the services of a water diviner ; he digs a well in a spot he chooses himself. He enlists the help of Paul, an eccentric Korean War veteran. Jacob is optimistic, but his wife, Monica, is disappointed with the mobile home and the distance from urban amenities, especially a hospital for their son David, who has a heart condition. They monitor David's heart murmurs and frequently tell him not to run. The couple work sexing chicks at a nearby hatchery and argue frequently while David and his sister, Anne, eavesdrop. To watch the children during the day, Monica's mother, Soon-ja, travels from South Korea to live with them. Forced to share a room with her, David avoids her because she does not fit his idea of a grandmother. Still, Soon-ja attempts to bond with the children and adjust to life in the United States. The well Jacob dug runs dry. He is forced to pay for county water, and they eventually lose water in the home. He runs into additional difficulties when the vendor in Dallas cancels an order for their produce at the last minute. He perseveres despite Monica's desire to return to California, straining their marriage. Soon-ja takes David to plant minari seeds by the creek. She tells him how resilient and useful the plant is and predicts plentiful growth. David finally begins to warm to her after she teaches him hwatu , bandages his wounds, and soothes his fears over his heart condition. Soon-ja also encourages him to do more physical activity, saying he is stronger than his parents think. Soon-ja then suffers a stroke overnight. She survives but is left with impaired movement and speech. Monica considers moving back to California with Soon-ja, with David going with them if his health does not improve. The family leaves Soon-ja at home while they head to Oklahoma City for David's heart appointment and to meet a vendor for Jacob's produce. They learn that David's condition has dramatically improved, and he will not need surgery, and Jacob makes a deal to sell vegetables to a Korean grocer. But Jacob also indirectly admits to Monica that his crops' success is more important to him than their family's stability and, after an emotional argument over whether they can support each other only during good times, the two agree to separate. During their absence, Soon-ja accidentally sets fire to the barn containing the produce. On arriving home, Jacob rushes in to save the crops, followed by Monica. The fire grows out of control, and they save each other, leaving the barn to burn. Distraught and confused, Soon-ja wanders off while Anne and David call for her to return. David runs to her and blocks her path, before she takes his hand, and her grandchildren lead her back home. That night, the exhausted family sleeps together on the floor. Some time later, the water diviner guides Jacob and Monica to a spot to dig a new well, signifying their intention to stay. Jacob and David head to the creek to harvest the successfully grown minari, with Jacob noting that Soon-ja picked a good spot to plant it.",
  "wiki": "https://en.wikipedia.org/wiki/Minari"
}