{
  "year": "2020",
  "name": "Promising Young Woman",
  "plot": "Cassie Thomas is a 30-year-old medical school dropout who works in a coffee shop and spends her evenings going to bars and clubs, pretending to be drunk, and then confronting those who attempt to take advantage of her sexually. It is gradually revealed that Cassie quit medical school after the public rape of her lifelong best friend, Nina Fisher, who subsequently dropped out and committed suicide when her rapist, Al Monroe, was cleared of wrongdoing. Cassie becomes reacquainted with Ryan Cooper, a former medical school classmate, who persuades her to go on a date. Ryan reveals that Al will soon get married. Angered that he has found success and happiness, Cassie begins to orchestrate revenge against the people that she thinks contributed to nobody being held accountable for the rape. First, Cassie meets with Madison McPhee, another former classmate and onetime friend of hers and Nina's, who blames Nina for her own assault because she often drank to excess. Cassie plies Madison with wine and hires a man to take her to a hotel room to trick her into thinking she was raped. Afterward, Madison leaves Cassie multiple distressed voicemails. Cassie then targets Elizabeth Walker, the dean who dismissed Nina's case. Pretending to be a makeup artist for a popular band, she lures Walker's daughter into her car. She meets with Walker under the guise of returning to medical school and finds that the dean only vaguely remembers Nina's case. She even had Al return to give a talk at the school recently. Walker justifies her actions until Cassie tells her that she has just dropped her daughter off at the dorm room where Nina was raped. Terrified, Walker demands to know where her daughter is, finally admitting her own complicity and inaction before Cassie admits she is safe nearby. Next, Cassie meets with Al's lawyer, Jordan Green, and finds that he is deeply remorseful for his actions. Jordan, who is on a leave of absence after a psychotic episode, describes how easy it is to build a case against a rape victim. Cassie chooses to forgive him and later visits Nina's mother, who encourages her to move on with her life. Cassie reconnects with Ryan. They begin dating and fall in love. She also introduces Ryan to her parents, who are happy that their daughter seems to finally be moving on. A distraught Madison eventually confronts Cassie at home, who assures her that she was not actually raped. Madison admits she treated Nina's rape callously and provides a phone containing a video of the assault, revealing Ryan's presence at the party. Cassie confronts Ryan, who claims he was too drunk to remember the incident and should be forgiven because he was so young. Threatening to release the video, Cassie forces Ryan to reveal Al's bachelor party location. He begs for her forgiveness, but she refuses. Posing as a stripper at the party, Cassie drugs the attendees, handcuffs Al to a bed, and reveals her identity. Cassie attempts to carve Nina's name upon Al's body, but whilst defending himself, he suffocates her with a pillow. The next morning, Al's friend, Joe, helps him burn Cassie's body in the woods. Cassie's parents report her missing . The police visit Ryan, and he lies that he is unaware of Cassie's whereabouts, suggesting she may have been unstable. At Al's wedding, Ryan is stunned to receive a scheduled text from Cassie, indicating that her plan is unfinished. The police arrive at the reception to arrest Al for her murder. Flashbacks reveal that Jordan received a package with the cell phone and instructions in case Cassie did not return from the bachelor party. The police then discovered a half-heart necklace with Nina's name on it among Cassie's burnt remains. Al is arrested for Cassie's murder as Ryan receives a final text from Cassie, signed with her and Nina's names.",
  "wiki": "https://en.wikipedia.org/wiki/Promising_Young_Woman"
}