{
  "year": "2021",
  "name": "The Power of the Dog",
  "plot": "In 1925 Montana , wealthy ranch-owning brothers Phil and George Burbank meet widow and inn owner Rose Gordon during a cattle drive. The kindhearted George is quickly taken with Rose, but the coarse and volatile Phil dislikes her, believing she only wants George's money. Phil also belittles her teenage son Peter, deriding him as weak and effeminate. George and Rose marry and she moves into the Burbank ranch house while Peter attends medical school. George organizes a dinner party with his parents and the governor and pressures Rose into a piano performance. George reveals that Phil was a brilliant Classics student at Yale, in contrast to his rough nature. Shaken by Phil's earlier belittlement of her piano playing, Rose is unable to perform. Humiliated and upset by Phil's behavior, Rose starts drinking, becoming an alcoholic by the time Peter arrives home for a break from school. Phil and his men taunt Peter, and he isolates himself in his room, where he dissects a rabbit he has caught. In a glade away from the mansion, Phil masturbates with a delicate scarf belonging to his late mentor, Bronco Henry. Peter enters a bivouac in the glade and finds a stash of Bronco Henry's homoerotic magazines. He observes Phil bathing in a pond with Bronco's scarf around his neck before Phil notices and chases him away. Later, in front of his men, Rose, and George, Phil makes amends with Peter, offering to plait him a lasso from rawhide before he returns to school. He teaches Peter to ride a horse. Peter heads out on his own one day, finds a dead cow, and, after carefully putting on rubber surgeon's gloves he had brought in his backpack, cuts off a pieces of its hide. Phil and Peter ride into the hills together. While trying to catch a rabbit hiding in a pile of wood posts, Phil badly gashes his hand but declines Peter's offer to dress the wound. Peter tells Phil about finding the body of his alcoholic father, who had hanged himself, and having to cut him down. Rose's alcoholism worsens as Peter and Phil spend more time together. Upon learning about Phil's policy of burning unwanted hides, Rose defiantly trades them to local Native Americans and collapses on her way back to the house. Upon discovering this, Phil is infuriated. George says she is unwell. Peter pacifies Phil by offering him strips from the hide he cut, not mentioning its origin. Phil is touched by Peter's gesture and holds him close to his face. The pair spend the night in the barn finishing the rope. Blood flows from Phil's open wound as he swirls the hide in the solution used to soften it. Peter asks Phil about his relationship with Bronco Henry. Phil says Bronco Henry had once saved his life when they were caught in a freezing storm in the mountains by keeping him warm with his body. Peter asks if they were naked, but Phil does not answer. It is evident that Phil and Bronco Henry had sex. They later share a cigarette by Peter passing it to Phil while holding it in his fingers. [ 8 ] The next morning, George finds Phil sick in bed, his wound now severely infected. A delirious Phil looks for Peter to give him the finished lasso, but George takes him to the doctor. Phil dies. Later, George picks out a coffin for Phil, while his body is prepared for burial. At the funeral, the doctor tells George that Phil most likely died of anthrax . This puzzles George, as Phil was always careful to avoid diseased cattle. Peter, who skipped Phil's funeral, opens a Book of Common Prayer to a passage on burial rites and reads Psalm 22 before stowing the finished lasso under his bed with carefully gloved hands. As Peter watches George and a now-sober Rose return home and embrace, he turns away and smiles.",
  "wiki": "https://en.wikipedia.org/wiki/The_Power_of_the_Dog_(film)"
}