{
  "year": "2022",
  "name": "Triangle of Sadness",
  "plot": "Carl, a model , attends an uncomfortable casting call with other male models. Carl is dating Yaya, a model and influencer , and resents her for expecting him to pay for meals even though she earns more than he does. They bicker about money and gender roles. Yaya admits that she is in a relationship with Carl for the engagement it earns them on social media, and that she seeks to become a trophy wife , but Carl declares that she will come to love him. Carl and Yaya are invited on a luxury cruise aboard a superyacht in exchange for its social media promotion. Among the wealthy guests are the Russian oligarch Dimitry and his wife Vera; the elderly couple Clementine and Winston, who have made their fortune manufacturing grenades and other weapons; Therese, a wheelchair user only capable of speaking a single phrase in German ( in den Wolken , i.e. \"in the clouds\") following a stroke; and Jarmo, a lonely tech millionaire who flirts with Yaya. The guests luxuriate on the yacht, oblivious to the crew working to meet their every need and whim. The head of staff, Paula, demands they obey the guests' absurd requests, including having every crew member swim in the sea. The kitchen crew is ordered to swim as well, despite the chef warning that the food will go bad. Carl complains to Paula about a crew member whom Yaya finds attractive, inadvertently getting the man fired. Meanwhile, the yacht's captain, Thomas Smith, spends his time drunk in his cabin. Against Paula's advice, Thomas schedules the captain's dinner during a storm. Several guests become violently seasick, vomit or have diarrhoea, possibly due to the food, and panic breaks out. The drunken Thomas and Dimitry debate in favour of communism and capitalism , respectively, over the intercom. Several guests are injured as the storm tosses the ship, the sewage floods, and the power goes out. When morning arrives, pirates attack, killing Clementine and Winston with a grenade and sinking the yacht. A small group of survivors consisting of Carl, Yaya, Dimitry, Therese, Paula, Jarmo, ship's mechanic Nelson (whom Dimitry accuses of being a pirate), and Toilet Manager Abigail manage to escape to an island. At first, Paula continues to order Abigail to serve the cruise guests. When it becomes clear that Abigail is the only one with survival skills, such as catching fish and starting a fire, she mutinies and usurps command by withholding food. She gains her own private bed inside a lifeboat and coerces Carl into a sexual relationship by giving him food in exchange for sexual favours. Jarmo kills a wild donkey for food by smashing it with a rock, which Dimitry, Nelson and the others celebrate. Yaya grows jealous of Abigail because Carl considers leaving Yaya for Abigail. When Yaya hikes to the other side of the island, Abigail volunteers to go with her despite Carl's concerns. They discover a lift built into the rocks and realise they have been stranded near a luxury resort. Back at the camp, Therese encounters a beach vendor but is unable to communicate her situation. Yaya celebrates finding the lift, but Abigail hesitates to enter, fearing she is losing her power. She then prepares to attack Yaya with a rock, but hesitates when the oblivious Yaya offers to help her. When Yaya clarifies the extent of the help would be hiring her as an assistant, the camera cuts away. Elsewhere, Carl frantically runs through the jungle.",
  "wiki": "https://en.wikipedia.org/wiki/Triangle_of_Sadness"
}