{
  "year": "2022",
  "name": "The Fabelmans",
  "plot": "In 1952, Haddon Township, New Jersey , Jewish couple Mitzi and Burt Fabelman take their young son Sammy to see his first film: The Greatest Show on Earth . Dazzled by a train scene, Sammy asks for a model set for Hanukkah , which he crashes late one night. Mitzi allows him to shoot another crash scene using Burt's 8 mm camera . Sammy begins filming regularly, sometimes involving his sisters. Burt is offered a new job in Phoenix, Arizona , where he and the family move in 1957. At Mitzi's insistence, Burt's best friend and business partner, Bennie Loewy, goes, too. Years later, teenage Sammy makes films with his friends in the Boy Scouts, begins using post-production effects, and earns a badge in photography. Later, the Fabelmans, including Bennie, take a camping trip with Sammy taking footage of their vacation. Mitzi's mother later dies, leaving her distraught. Burt gives Sammy editing equipment and asks him to make a vacation film to cheer Mitzi up. Sammy objects, but Burt insists, dismissing filmmaking as a mere hobby. The next morning, the Fabelmans receive a visit from Mitzi's uncle Boris, a former lion tamer and film worker. That night, he speaks with Sammy about compromising his family with art, saying that both aspects will always be at odds with one another. Boris leaves, and Sammy begins editing the vacation footage, during which he finds evidence of Mitzi and Bennie having an affair. Sammy and Mitzi get into an argument after weeks of him treating her and Bennie harshly. In a fit of rage, she slaps him across the back after he shouts that he wishes she were not his mother. Distraught, Sammy shows her the compiled footage and promises to keep their secret. The following week, Burt receives another promotion, requiring another move to Saratoga, California . Bennie stays in Phoenix, but not before giving Sammy a new camera . Sammy refuses it until Bennie lets him pay $35 for it, but slips it back in Sammy's pocket when they hug goodbye. Despite receiving the camera, Sammy decides never to use it. After arriving in his new neighborhood and school, Sammy becomes targeted by students Logan and Chad, who subject him to antisemitic abuse . He begins dating the devoutly Christian Monica. While having dinner with the Fabelmans, she suggests that Sammy film their Ditch Day at the beach, something he accepts after Monica mentions that her father owns a 16 mm Arriflex camera that he would let him use. Mitzi and Burt announce their divorce, citing her depression and his discovery of the affair. At prom, Sammy declares his love for Monica and asks her to come with him to Hollywood after high school. Unwilling to throw away her own life's plans to attend Texas A&M University , she breaks up with him. The Ditch Day 1964 film is played in front of Sammy's peers to a rapturous response. It glorifies Logan and humiliates Chad. Sammy is distraught that Monica just broke up with him, and he disappears to a school corridor. Logan finds and confronts Sammy, confused and emotional over his positive portrayal. Chad finds them and tries to attack Sammy, but Logan defends him. Logan threatens Sammy to never tell anyone that he got emotional and offers him a puff on his cigarette. Sammy agrees to keep this secret but jokes that he might make a movie about it. The following year, Sammy is living with his father in Hollywood. He wants to drop out of college but cannot find work in filmmaking. Burt grudgingly accepts his son's passion and tells Sammy to keep on his path if it makes him happy. Sammy receives an offer to work on Hogan's Heroes . Knowing that he is more interested in filmmaking, show co-creator Bernard Fein invites Sammy to meet director John Ford , one of his greatest influences. During their brief meeting, Ford offers Sammy some pointers on framing, insisting that he never place the horizon in the center of the frame. Newly invigorated, Sammy walks through the studio backlot, the shot adjusting itself to match Ford's tip.",
  "wiki": "https://en.wikipedia.org/wiki/The_Fabelmans"
}