{
  "year": "2022",
  "name": "Tár",
  "plot": "Lydia Tár is chief conductor of a Berlin orchestra. She heavily relies on Francesca, her personal assistant and confidant. While being interviewed by Adam Gopnik at The New Yorker Festival , Lydia promotes her upcoming live recording of Mahler's Fifth Symphony and memoir Tár on Tár . She meets with Eliot Kaplan, an investment banker and amateur conductor who co-founded the Accordion Foundation with Lydia to support aspiring female conductors. They discuss technique, replacing Lydia's assistant conductor Sebastian with Francesca, and filling a vacant cello position in Berlin. As a guest lecturer, Lydia holds a masterclass at Juilliard . When a student expresses reluctance to study J. S. Bach 's works due to his regressive social views, she encourages the class to focus on the music and the composer's contributions rather than his personal life. The debate escalates and ends with the student swearing at her before leaving the class. Later that night, Lydia anonymously receives a first edition of Vita Sackville-West 's novel Challenge . The title page has been embellished with a handdrawn kené pattern, a personal reminder of her trip to Perú. She tears up the page and throws it away. Lydia flies back to Berlin where she lives with her wife Sharon, the concertmaster of the orchestra, and their adopted daughter Petra. Before a blind audition for the cello position, Lydia spots a young Russian candidate, Olga Metkina, in the bathroom. Lydia changes her scorecard to ensure Olga a spot in the orchestra and grants her a soloist position in the companion piece, Elgar's Cello Concerto . Lydia's attraction to Olga causes her relationships with Francesca and Sharon to grow strained. Krista Taylor, a promising young musician who Lydia once mentored, has been blacklisted after getting on Lydia's bad side. After sending disturbing emails to Francesca, Krista commits suicide. Lydia instructs Francesca to delete the emails and retain a lawyer after learning Krista's parents plan to file suit against her. Lydia informs Sebastian of his imminent replacement. Incensed, he indicates the orchestra is aware of her favoritism and that it suggests inappropriate behavior. Due to Sebastian's accusations, Lydia decides not to promote Francesca to assistant conductor. Lydia is haunted by an increasing sensitivity to sound , vivid surreal nightmares, daytime hallucinations, chronic pain, and enigmatic patterned scribbles resembling those Krista once made. While trying to complete a composition dedicated to Petra, she is disturbed by the sound of a medical device next door, where her neighbor is caring for her dying mother. One day, Lydia falls and hurts herself while attempting to follow Olga home, but she tells Sharon she was injured in a mugging. A manipulatively edited cellphone video of Lydia's Juilliard class goes viral, and an article accusing her of sexual predation appears in the New York Post . Lydia tries to reach Francesca, who resigned after being passed for assistant conductor. She breaks into Francesca's home to find that it is completely empty aside from a draft of Tár on Tár , which Francesca renamed Rat on Rat . Lydia, accompanied by Olga, returns to New York City to attend the deposition in the lawsuit of Krista's parents and to promote her book; the two are met by protestors, and Lydia is confronted with incriminating emails between her and Krista that Francesca provided for the deposition. In Berlin, Lydia is removed as conductor due to the controversy. Furious over the allegations and Lydia's lack of transparency, Sharon bars her from seeing their daughter. Lydia retreats to her old studio and grows increasingly depressed and deranged. She sneaks into the live recording she was supposed to conduct and tackles Eliot, who replaced her as conductor. Advised to lie low by her management agency, she returns to her modest childhood home on Staten Island , where certificates of achievement adorn the wall bearing her birth name, Linda Tarr. She tears up watching an old VHS of Young People's Concerts in which Leonard Bernstein discusses the meaning of music. Her brother Tony arrives and admonishes her for forgetting her roots. Lydia finds work conducting in the Philippines. Seeking a massage, the hotel concierge sends her to a brothel fronting as a massage parlor; the young women sit in a semicircle with numbers on their robes. When Number 5 looks directly at Lydia, she rushes outside to vomit. Later on, she conducts a live performance of the score for the video game series Monster Hunter in front of an audience of cosplayers .",
  "wiki": "https://en.wikipedia.org/wiki/T%C3%A1r"
}