{
  "year": "2022",
  "name": "All Quiet on the Western Front",
  "plot": "During World War I , 17-year-old Paul Bäumer enthusiastically enlists in the Imperial German Army in 1917 alongside schoolmates Albert Kropp, Franz Müller, and Ludwig Behm. The friends are deployed in northern France near La Malmaison , and are befriended by an older, experienced soldier named Stanislaus \"Kat\" Katczinsky. Their romanticism is shattered by the realities of trench warfare on the Western Front and Ludwig is killed by artillery the first night. On November 7, 1918, German State Secretary Matthias Erzberger tries to persuade the German High Command to begin armistice talks with the Allied powers . Behind the front in Champagne , Paul and Kat steal a goose to share with Albert, Franz, and another veteran, Tjaden Stackfleet. Kat, an illiterate, gets Paul to read a letter from his wife and worries that he'll be unable to reintegrate into society. Franz spends the night with a local French woman and keeps her scarf as a souvenir. On November 9, General Friedrichs, Erzberger and the German delegation arrive at a train bound for ceasefire negotiations at Compiègne . Paul's unit is sent to find 60 missing recruits and find they were killed by gas after taking their masks off too soon. Friedrichs opposes the armistice talks and orders an attack before French reinforcements arrive. That night, Erzberger's delegation reaches the Forest of Compiègne. On November 10, Supreme Allied Commander Ferdinand Foch gives the Germans 72 hours to accept the non-negotiable Allied terms. Paul's regiment is ordered into an assault, takes the French front line after savage hand-to-hand fighting, but is routed by a combined arms counterattack with Saint-Chamond tanks and flamethrowers . Franz is separated from the group and Albert is killed trying to surrender. Trapped in a crater in no man's land with a French soldier, Paul stabs him, then begs forgiveness after he dies slowly and painfully. Erzberger learns of Kaiser Wilhelm II's abdication and is instructed by Field Marshal Paul von Hindenburg to accept the Allied terms. Paul's unit celebrates the war's imminent end and a wounded Tjaden gives him Franz's souvenir scarf. Tjaden, knowing his leg will be amputated, fatally stabs himself. On November 11, Erzberger's delegation signs an armistice set to take effect at 11:00 AM . Aware of the ceasefire, Paul and Kat raid a farm one last time, but Kat is shot by the farmer's son and dies before Paul can carry him to an infirmary. Friedrichs, wanting a successful battle before the war ends in defeat, sends Paul's unit into action at 10:45 AM. Paul kills many French soldiers before being bayoneted seconds before 11:00 AM. He dies as the fighting stops. A German replacement that Paul had earlier saved finds Paul's mud-caked body and picks up Franz's scarf, leaving behind the dog tag that will identify his body.",
  "wiki": "https://en.wikipedia.org/wiki/All_Quiet_on_the_Western_Front_(2022_film)"
}