{
  "year": "2023",
  "name": "Poor Things",
  "plot": "In late-Victorian London , 1882, [ b ] the medical student Max McCandles is recruited by the mad scientist Godwin Baxter to record the behaviour of a strange, nearly mute woman living in Godwin's house. Godwin reveals that her body is that of a woman who was pregnant and died by suicide by leaping off Tower Bridge; Godwin replaced the woman's brain with that of the fetus , giving her an infant's mind, and named her Bella Baxter. As weeks pass, Bella's vocabulary improves and she exhibits childlike wonder at the world. With Godwin's encouragement, Max falls in love with Bella and proposes marriage. Bella accepts, but soon discovers masturbation and sexual pleasure, leading her to run off with Duncan Wedderburn, a debauched lawyer, to Lisbon . There, they have near-constant intercourse because Bella has no understanding of anything beyond physical pleasure. She is mistakenly addressed as \"Victoria Blessington\" by a fellow hotel guest. As Bella becomes difficult for Duncan to control, he smuggles her onto a cruise ship, where she befriends two passengers who open her mind to philosophy. Duncan attempts to further stunt her growth to no avail, and indulges in drinking and gambling. During a stop at Alexandria , Bella witnesses the suffering of the poor and becomes distraught. Wishing to help them, she entrusts Duncan's winnings to unscrupulous members of the crew, who falsely promise to give it to them. Unable to afford the rest of the trip, Bella and Duncan are dropped off at Marseille and make their way to Paris , penniless. Seeking money and accommodation, Bella is coerced into working at a brothel. Enraged, Duncan breaks down, and Bella abandons him. At the brothel, she comes under the tutelage of Madame Swiney and begins a relationship with fellow prostitute Toinette, who introduces her to socialism . Now terminally ill, Godwin asks Max to bring Bella to him. Max finds her after tracking down Duncan, who has been institutionalised. Back in London, Bella reconciles with Godwin and renews her plans to marry Max, but their wedding is interrupted by Duncan and General Alfie Blessington. Alfie, addressing Bella as Victoria, declares that they were married before her disappearance and that he has come to reclaim her. Bella leaves Max to learn of her past life, but is exposed to Alfie's violent and sadistic nature. Bella partially realises that she was Victoria, and that she killed herself to escape Alfie. Alfie confines Bella to his mansion and tells her that he plans to have her clitoris removed and impregnate her, threatening her with a gun and demanding she drink a sedative. She tosses the sedative in his face.  Alfie accidentally shoots himself in the foot and passes out. Bella returns to Godwin's house and, with Max's help, transplants a goat's brain into Alfie's head. Godwin dies peacefully with Bella and Max at his side. Bella, Max, and Toinette begin a new life in Godwin's house, while Alfie eats grass happily.",
  "wiki": "https://en.wikipedia.org/wiki/Poor_Things_(film)"
}