{
  "year": "2023",
  "name": "American Fiction",
  "plot": "Thelonious \"Monk\" Ellison is a well-read, black elite writer and professor living in Los Angeles . His novels receive academic praise but sell poorly, and his publishers reject his latest manuscript for not being \"Black enough\". His superiors place him on temporary leave due to his brashness with students over racial issues, and suggest that he attend a literary seminar in his hometown of Boston . His panel at the seminar is sparsely attended, in contrast to a packed room for an interview with Sintara Golden, whose bestselling novel We's Lives in Da Ghetto panders to Black stereotypes . In Boston, Monk has dinner with his mother Agnes, who has Alzheimer's disease , and his sister Lisa, a physician. While having drinks with Monk, Lisa suffers a fatal heart attack. Their estranged brother Cliff, a plastic surgeon, attends Lisa's funeral. Newly divorced and out of the closet , Cliff engages in frequent drug use and casual sex. Monk meets Coraline, a lawyer living across the street from his mother's beach house, and begins dating her. Frustrated by Sintara's success and the costs of care for his mother, Monk writes My Pafology , a satirical novel mocking the literary stereotypes expected from Black writers: melodramatic plots, deadbeat dads, gang violence, and drugs. After submitting it to publishers out of contempt, he is shocked to be offered a $750,000 advance, which he reluctantly accepts to pay for his mother's care. His agent Arthur convinces him to adopt the persona of \" Stagg R. Leigh \", a convict on the run, to protect his reputation. As \"Stagg\", Monk is offered a movie deal from film producer Wiley. In response to insulting comments by the publishing executives, Monk tries to sabotage the deal by demanding the title be changed to Fuck , but the publishers concede to his ultimatum. Monk is invited to help judge the New England Book Association's Literary Award as part of a \" diversity push \" and he reluctantly accepts. Sintara is a fellow judge, and Monk discovers that she shares many of his views. Agnes moves into an expensive assisted-living facility but adapts poorly. Cliff briefly returns to Boston but leaves after Agnes makes a homophobic remark. Fuck becomes a bestseller, much to Monk's shock and chagrin. Monk's family, friends, and the public remain unaware that he is \"Stagg\", and the FBI contacts the publisher, believing Stagg is a fugitive as he claimed in interviews. Monk's publisher submits Fuck for the Literary Award, forcing him to judge his own novel. Monk learns that Coraline enjoyed reading Fuck ; they argue over it and break up. The panel's white judges rave over Fuck , though Sintara deems the subject matter \"pandering.\" While Monk agrees, he argues that Sintara's book is \"trauma porn\" and inauthentic to her black middle-class background. Sintara counters that she researched her book by interviewing voiceless people and was just giving the market what it wants. On family housekeeper Lorraine's wedding day, Monk finds Cliff living in Agnes's beach house with two other men, but Lorraine is happy to have him attend the wedding. At the reception, Monk and Cliff discuss the impact of their father's suicide, with Cliff encouraging Monk to let people \"love all of him\". At the awards ceremony, Fuck is announced as the winner. Monk goes onstage and says he has a confession to make. The film cuts to black, and the events shown are revealed to have been Monk's screenplay based on his experiences, written for Wiley's production company as an alternative to the Fuck film adaptation; in reality, Monk quietly left the ceremony and is still estranged from Coraline. Wiley likes the screenplay but asks Monk to change the ambiguous ending. Monk proposes an ending with him running away from the ceremony to apologize to Coraline, but Wiley says it feels too much like a romantic comedy. Monk then suggests one where police, believing Monk to be a wanted criminal, fatally shoot him at the ceremony. Much to Monk's dismay, Wiley loves it and the film moves into production. Monk drives away with Cliff after he and one of Wiley's actors, playing a slave, acknowledge each other.",
  "wiki": "https://en.wikipedia.org/wiki/American_Fiction_(film)"
}