{
  "year": "2023",
  "name": "Past Lives",
  "plot": "The story takes place over 24 years, beginning in the present year of 2023 and then flashing back to 1999 onward. An unseen, unnamed couple observe Nora, Arthur, and Hae Sung at a New York City speakeasy and openly speculate on the trio's relationship dynamic. In Seoul , South Korea , Na Young and Hae Sung are 12-year-old classmates who develop feelings for each other and go on a playdate set up by their parents. Shortly thereafter, Na Young's family immigrates to Canada and the two lose contact. Na Young changes her name to Nora. Hae Sung has finished his military service and Nora has moved to New York City . While calling her mother, Nora discovers on Facebook that Hae Sung had posted that he was looking for Na Young, unaware of her name change. They reconnect through video calls but are unable to visit each other, as Nora is about to attend a writer's retreat in Montauk and Hae Sung is moving to China for a Mandarin language exchange. Eventually, Nora tells Hae Sung they should stop talking for a while, as she wants to focus on her writing and life in New York. At her retreat, Nora meets Arthur Zaturansky and they fall in love, at one point discussing the Buddhist -derived concept of inyeon ( 인연 , dependent origination ), how a relationship between two souls in the present life is influenced by interactions in thousands of past lives. Hae Sung also meets a woman, whom he begins to date. Arthur and Nora are married and living in New York. Hae Sung, no longer with his girlfriend, travels to visit Nora. Arthur wonders if he is a roadblock in their love story, suggesting to Nora that, if another man with similar appeal had met her at the same time, Nora would have married him to secure a green card for U.S. residency. He also expresses anxiety about cultural barriers in their relationship, highlighting Nora's habit of sleep-talking in Korean: \"you dream in a language that I can't understand.\" Nora reassures Arthur that she loves him. The next night, the three go out to a speakeasy. Initially, Nora translates between the two men, but eventually speaks with Hae Sung exclusively in Korean. He wonders what they were to each other in their past lives, and what would have happened if she had never left Korea and they had continued their relationship. When Nora goes to the bathroom, Hae Sung apologizes to Arthur for speaking alone with Nora, but Arthur says he is glad to have met him. They return to Arthur and Nora's apartment. Hae Sung invites them to visit him in Korea and calls an Uber . Nora waits with him, and the two exchange long looks at each other until the car arrives. Hae Sung says that perhaps they are, at that moment, experiencing a past life, and asks Nora what their relationship will be in their next life. She says she does not know. Hae Sung says, \"I'll see you then.\" He leaves in the car and she walks back to her apartment, crying into Arthur's arms.",
  "wiki": "https://en.wikipedia.org/wiki/Past_Lives_(film)"
}