{
  "year": "2023",
  "name": "The Holdovers",
  "plot": "In December 1970, Paul Hunham is a teacher at Barton Academy, a New England all-male boarding school that he once attended on scholarship. His students and fellow teachers despise him for his strict grading and stubborn personality. Dr. Woodrup, Barton's headmaster and Hunham's former student, scolds him for costing the academy money by flunking a major donor's son, causing Princeton University to rescind his offer of admission. As punishment, Hunham is forced to supervise five students left on campus during the Christmas holiday break, including Angus Tully, whose mother cancelled a family trip to Saint Kitts to instead honeymoon with her new husband. Also staying behind is cafeteria manager Mary Lamb, whose late son, Curtis, attended Barton and recently died in the Vietnam War after being drafted . Unlike most Barton students, Curtis did not get a student deferment because he could not afford to go to college. To the students' chagrin, Hunham forces them to study and exercise on their break. After six days, a student's wealthy father arrives by helicopter and agrees to take all five students on the family's ski trip with their parents' permission. Angus, unable to reach his parents for permission, is left alone at Barton with Hunham and Mary. When Hunham catches Angus trying to book a hotel room, the two argue about Hunham's disciplinarian policies. Angus runs through the school halls and defiantly leaps into a pile of gym equipment, dislocating his shoulder. Hunham takes Angus to the hospital. To protect Hunham from blame, Angus lies to the doctors about the circumstances of his injury. At a restaurant, Hunham and Angus encounter Lydia Crane, Woodrup's assistant. Hunham flirts with Lydia, who invites the pair to her Christmas Eve party. Angus, Hunham, Mary, and Barton's janitor, Danny, attend Lydia's party. There, Angus and Lydia's niece Elise share a kiss, while Hunham discovers that Lydia has a boyfriend. As Mary gets drunk and has an emotional breakdown over Curtis's death, Hunham insists on leaving early. As Hunham and Angus argue, Angus says that his father is dead and Mary scolds Hunham for his unsympathetic behavior. Feeling remorseful, Hunham arranges a small Christmas celebration. Mary persuades Hunham to grant Angus's wish for a \"field trip\" to Boston . After dropping off Mary in Roxbury to spend time with her pregnant sister, Angus and Hunham walk through Boston, ice skate and visit the Museum of Fine Arts . The two encounter a classmate of Hunham's from Harvard College , who has become a successful academic. Hunham lies about his career, and Angus plays along. Angus learns that Hunham was expelled from Harvard after a legacy donor's son accused him of plagiarism and Hunham semi-deliberately hit him with a car. Although the incident nearly ruined Hunham's career prospects, the old Barton headmaster took pity on him and offered him an adjunct teaching job. When Hunham and Angus see a movie at the Orpheum Theatre , Angus sneaks away and Hunham catches him entering a taxi. Angus explains that he wants to see his father, and Hunham agrees to accompany him, assuming that they are going to a cemetery. However, Angus's father is alive and confined in a psychiatric hospital . Following the visit, Angus (who takes medication for depression ) expresses concern that his future behavior will echo his father's. Hunham comforts Angus, affirming that Angus is not the same person as his father. Hunham, Angus, Mary and Danny celebrate New Year's Eve together. In January, when school resumes, Hunham is summoned to Woodrup's office; Angus's mother and stepfather are there. They tell Hunham that Angus is not allowed to see his father and that a snowglobe Angus gave to him led to a violent outburst. Angus's mother and stepfather threaten to withdraw Angus from Barton and send him to a military academy . However, Hunham defends Angus and blames himself, lying that he persuaded Angus to visit his father. Woodrup allows Angus to remain at Barton while firing Hunham; Hunham steals expensive cognac from Woodrup's office as he leaves. Mary, who has come to better terms with Curtis's death, gives Hunham a notebook for the monograph he wants to write. Hunham and Angus share a farewell. In his car, Hunham takes a sip of the cognac, spits it out toward the school, and drives away.",
  "wiki": "https://en.wikipedia.org/wiki/The_Holdovers"
}