{
  "year": "2023",
  "name": "The Zone of Interest",
  "plot": "In 1943, Rudolf Höss , commandant of the German Auschwitz concentration camp , lives with his wife Hedwig and their five children in an idyllic home next to the camp . Höss takes the children out to swim and fish, and Hedwig spends time tending the garden. Non-Jewish inmates handle the chores, and the murdered Jews ' best belongings are given to the family. Beyond the garden wall, gunshots, screaming, and the sounds of trains and furnaces are often audible. Höss approves the design of a new crematorium created by Topf and Sons . One day, he notices human remains in the river and gets his children out of the water where they have been playing. On another day, he chastises SS personnel for damaging lilac bushes around the camp. At night, while Höss reads the German fairytale of \" Hansel and Gretel \" to his daughters, a Polish girl sneaks out and hides food at the prisoners' work sites. Hedwig's mother comes to stay, and is impressed and pleased by the material status her daughter has achieved. Höss receives word that he is being promoted to deputy inspector of concentration camps and must move to Oranienburg , near Berlin . He objects, and withholds the news from Hedwig for several days. Hedwig asks him to convince his superiors to let her and the children remain in their home; the request is approved. Before Höss leaves, a woman comes to his office and prepares herself for sex. Meanwhile, the Polish girl finds sheet music composed by a prisoner , which she plays on the piano at her home. Hedwig's mother departs unannounced after seeing and smelling the burning crematorium at night. She leaves a note that upsets Hedwig, causing Hedwig to lash out and threaten her servants. In Berlin, in recognition of Höss's work, Oswald Pohl tells him he will be heading Aktion Höss that will transport 700,000 Hungarian Jews to his camp to be killed. This will allow him to move back to Auschwitz and reunite with his family. He vacantly attends a party organised by the SS Main Economic and Administrative Office . Afterwards, he tells Hedwig over the phone that he spent his time at the party thinking about the most efficient way to gas the attendees. As Höss leaves his Berlin office and descends a stairway, he stops, retches repeatedly and stares into the darkness of the building corridors. In the present day, a group of janitors clean the Auschwitz-Birkenau State Museum . Back in 1944, Höss continues downstairs, descending into darkness.",
  "wiki": "https://en.wikipedia.org/wiki/The_Zone_of_Interest_(film)"
}