{
  "year": "2023",
  "name": "Killers of the Flower Moon",
  "plot": "Osage Nation elders bury a ceremonial pipe , mourning their descendants' assimilation into White American society. Wandering through their Oklahoma reservation during the annual \"flower moon\" phenomenon of fields of blooms, [ 7 ] several Osage find oil gushing from the ground. The tribe becomes wealthy as it retains mineral rights . However, the law requires court-appointed white legal guardians to manage the money of full and half-blood members, assuming them \"incompetent\". [ c ] In 1919, Ernest Burkhart returns from World War I to live with his brother Byron and uncle William King Hale on Hale's reservation ranch. Hale, a reserve deputy sheriff and cattle rancher, poses as a friendly benefactor to the Osage. Ernest and Byron commit armed robbery against the Osage. Ernest develops a romance with Mollie Kyle , an Osage whose family owns oil headrights . They marry in an Osage ceremony with Catholic elements and raise three children. Hale contracts the killing of multiple wealthy Osage, explaining that Ernest will inherit more headrights the more of Mollie's family dies. Mollie is diabetic , and her mother, Lizzie, is ill. After Mollie's sister Minnie dies of a mysterious illness, Hale orders Byron to kill another of Mollie's sisters, Anna. Lizzie and the Osage council blame the white residents and urge the tribe to fight back. The 1921 Tulsa race massacre causes further concern amongst the Osage that they could suffer similarly. Lizzie's ancestors welcome her to the afterlife as she dies. Hale has Ernest arrange the murder of Mollie's first husband, Henry Roan , but Ernest's hitman neglects to make the murder look like a suicide as instructed. Even so, the sheriff and judges are in Hale's pocket, so there are no investigations. An Osage Nation representative seeking to lobby Congress is murdered in Washington, D.C. Mollie hires private detective William J. Burns , but he is severely beaten by Ernest and Byron. Again at Hale's behest, Ernest arranges the bombing of the home of Mollie's last surviving sister, Reta, and her husband, Bill. As the last surviving member of her family, Mollie inherits their headrights. She travels to Washington and asks President Calvin Coolidge for help. Hale orders Ernest to poison Mollie's insulin to \"slow her down\". Mollie's condition worsens, and Ernest exhibits similar symptoms after also ingesting the poison. Bureau of Investigation Agent Thomas Bruce White Sr. and his assistants discover the truth. Hale tries to cover his tracks by murdering his hitmen, but White arrests Hale and Ernest. Two agents find Mollie near death and rush her to the hospital, where it is found that she has been repeatedly poisoned. She recovers. White persuades Ernest to confess and turn state's evidence against his uncle. Hale's attorney, W. S. Hamilton, tries to convince Ernest to claim he was tortured and recant. After his daughter dies of whooping cough , Ernest testifies, wanting to be around for his remaining family. Mollie leaves Ernest after he refuses to admit to poisoning her. A radio drama years later reveals the Shoun brothers were implicated in other \"wasting deaths\" but never prosecuted due to lack of evidence; Byron was tried as an accomplice to Anna's murder but served no prison time due to a hung jury ; [ d ] Hale and Ernest were sentenced to life imprisonment but later paroled despite Osage protests; and Mollie died of diabetes-related complications in 1937 at the age of 50, her obituary stating that she was buried with her parents, sisters, and daughter while making no mention of the Osage murders.",
  "wiki": "https://en.wikipedia.org/wiki/Killers_of_the_Flower_Moon_(film)"
}