{
  "year": "2024",
  "name": "Conclave",
  "plot": "After the pope dies of a heart attack, the College of Cardinals , under the leadership of its dean , Thomas Lawrence of the United Kingdom, convenes to elect a successor . The four cardinals who emerge as likely candidates are Aldo Bellini of the United States, a progressive reformer ; Joshua Adeyemi of Nigeria, a social conservative ; Joseph Tremblay of Canada, a moderate ; and Goffredo Tedesco of Italy, a staunch traditionalist . Archbishop Janusz Woźniak, the prefect of the papal household , tells Lawrence that the pope demanded Tremblay's resignation before dying, which Tremblay denies. Bellini, meanwhile, tells his supporters that his goal is to prevent Tedesco from winning the papacy. Lawrence is surprised by the last-minute arrival of Mexican-born Archbishop Vincent Benítez of Kabul , whom the pope named cardinal in pectore the previous year. [ a ] Lawrence opens the deliberations with an impromptu homily encouraging the college to embrace uncertainty, which some interpret as an open declaration of his papal ambition. No one obtains the two-thirds majority necessary to win, though Adeyemi commands a lead over Tedesco and Tremblay while Bellini and Lawrence split the progressive vote. Monsignor Raymond O'Malley, Lawrence's assistant, discovers the pope paid for Benítez to be flown to Geneva for a medical appointment that Benítez later cancelled. On the second day, the college witnesses an altercation between Adeyemi and Sister Shanumi, a Nigerian nun recently transferred to Vatican City. Lawrence speaks with Shanumi, who confesses to a past illicit relationship that led to the birth of a son. Adeyemi confirms the story when pressed. Though Lawrence is bound to secrecy , a whisper campaign derails Adeyemi's candidacy. Bellini reluctantly decides to back Tremblay. Working with Sister Agnes, the nun acting as head caterer and housekeeper, Lawrence discovers Tremblay arranged for Shanumi's transfer. When confronted, Tremblay claims he did so at the pope's request. Lawrence then breaks into the pope's sealed apartment, where he finds documents indicating Tremblay paid cardinals for votes . He shows the documents to Bellini, whose plea not to reveal their existence sparks an argument. On the third day, Lawrence and Agnes publicize Tremblay's actions, effectively removing him from contention. Lawrence then reconciles with Bellini and agrees to stand against Tedesco. He votes for himself during the deliberations, but before he can cast his vote, he is blown off his feet by an explosion that damages the Sistine Chapel . The college learns the explosion was part of a series of suicide bombings currently taking place throughout Europe. While Tedesco calls for a religious war against Islam , Benítez argues against meeting violence with violence and chastises everyone for prioritizing their political agendas over their shared religious mission. Voting resumes, and as light shines through a broken window, the college overwhelmingly elects Benítez, who chooses the papal name of Innocent XIV . Lawrence is initially enthusiastic until O'Malley pulls him aside to discuss Benítez's canceled medical appointment. He confronts Benítez, who reveals that he was born with a uterus and ovaries but was unaware of their existence until an appendectomy revealed them. The appointment was for a laparoscopic hysterectomy that he decided against, believing he should remain as God made him. Lawrence wanders the Vatican grounds, listening to the crowds cheer Pope Innocent's election, before returning to his room, opening the window, and observing a trio of young nuns chattering in the courtyard below.",
  "wiki": "https://en.wikipedia.org/wiki/Conclave_(film)"
}