{
  "year": "2024",
  "name": "I'm Still Here",
  "plot": "In December 1970, Rubens Paiva lives in an idyllic house near Leblon beach with his wife Eunice and their five children. Returning to his civil career, after the revocation of his tenure at the outset of the 1964 Brazilian coup d'état , Paiva continues to support political expatriates without discussing his activities with his family. After revolutionary movements kidnap the Swiss ambassador to Brazil, the country faces looming political instability. The Paivas' friends Fernando [ pt ] and Dalva Gasparian decide to seek refuge in London , taking the Paivas' eldest daughter, Vera, with them. Vera had previously witnessed military violence while returning from the cinema with her friends. A military raid takes place in Paiva's house, resulting in his arrest and disappearance in January 1971. Eunice's public inquiries about his whereabouts result in her arrest and torture for 12 days. Eliana, their teenage daughter, is also imprisoned but is released after 24 hours. Eunice is questioned about whether her husband is involved with pro-democracy movements, which she denies. False newspaper reports claim that Rubens fled the country into exile, but Eunice and her friends suspect otherwise. With the help of lawyer Lino Machado, she files a habeas corpus petition. She also learns from family friend Bocaiuva Cunha that Rubens had been secretly helping political exiles. A former teacher, Martha, confirms she was imprisoned with Rubens but is afraid to speak out publicly. She later writes a letter detailing her arrest. Félix, a journalist and family friend, informs Eunice that Rubens was killed, but the military authorities refuse to confirm it officially. Left to care for her children alone, Eunice sells their home and moves to São Paulo , anticipating a new start close to her maternal family. 25 years later, in 1996, while receiving from the Brazilian state —now once again a democracy—Rubens Paiva's official death certificate, surrounded by journalists, Eunice calls for reparations for victims' families and accountability for the military dictatorship's crimes. In 2014, during a family gathering surrounded by her children and grandchildren, the now 85-year-old Eunice lives with advanced Alzheimer's disease . When a news report about the National Truth Commission addresses Rubens's case, a distressed Eunice appears to remember him. An epilogue reveals that five men were identified as responsible for the murder of Paiva, who was killed at the DOI-CODI headquarters between January 21 and 22, 1971, but none was prosecuted. The epilogue also notes that Eunice graduated from law school at 48 and became one of the few experts on indigenous rights in Brazil , serving as a counselor for the federal government , the World Bank , and the United Nations . She died in 2018 at the age of 89.",
  "wiki": "https://en.wikipedia.org/wiki/I%27m_Still_Here_(2024_film)"
}