{
  "year": "2024",
  "name": "Emilia Pérez",
  "plot": "Rita Mora Castro, a struggling attorney in Mexico City , leads the defense in a murder case involving a prominent media figure's wife. Against her own conscience, Rita proceeds to argue that the woman died by suicide (\"El alegato\"). After winning the case, Rita receives an anonymous call with a mysterious but lucrative offer. Reflecting on her discontent, she agrees to a meeting (\"Todo y nada\"). Her client, revealed to be cartel kingpin Juan \"Manitas\" Del Monte, expresses the desire to covertly undergo gender-affirming surgery and begin a new and authentic life (\"El encuentro\") as a woman. After consulting with doctors in Bangkok (\"La vaginoplastia\") and Tel Aviv (\"Lady\"), Rita finds a surgeon who agrees to perform the procedure after hearing Manitas's recollections of gender dysphoria during childhood (\"Deseo\"). Following the procedure, Manitas's wife, Jessi, and their children are relocated to Switzerland. Jessi pleads to go to the United States to be with her sister instead, but she is told that Switzerland was chosen for their safety. Rita is paid an exorbitant sum for her services. Meanwhile, Manitas fakes their death and begins a new life as Emilia Pérez. Four years later in London, Rita encounters Emilia, who wants to reunite with her children (\"Por casualidad\"). Rita arranges for Jessi and the children to return to Mexico City to live with Emilia, introducing her as a distant, wealthy cousin of Manitas who has volunteered to help raise the children. Jessi does not recognize Emilia and opposes the arrangement, ultimately agreeing to return to Mexico only to reunite with Gustavo Brun, a past lover with whom she had an affair during the later years of her marriage (\"Bienvenida\"). Adjusting to their new life in Mexico, Rita and Emilia have a chance encounter with the mother of a missing child . Emilia reflects on her criminal past (\"Mis siete hermanos y yo\"). Later, as she is putting her son to bed, he says he still recognizes her scent (\"Papá\"). Remorseful, Emilia uses her connections with incarcerated cartel members to create a nonprofit that identifies the bodies of cartel victims (\"Para\") in order to return them to their families. Rita and Emilia collaborate in building the nonprofit and recruiting donors, some of whom, Rita notes, are dangerous and corrupt (\" El mal \"). Epifanía, a woman whose abusive husband's remains were identified by the nonprofit, meets with Emilia to confirm his death. The two subsequently begin a relationship (\"El amor\"). Meanwhile, Jessi continues rekindling her relationship with Gustavo (\" Mi camino \"). She tells Emilia that the two plan to marry and move the family to a new home. When Emilia refers to the children as \"mine\" and becomes physically aggressive, Jessi flees with the children. After Emilia cuts off Jessi's allowance and threatens Gustavo into leaving Mexico, Jessi and Gustavo kidnap Emilia and demand ransom from Rita. She receives a package with a few of Emilia's severed fingers. Arriving at the designated location, Rita attempts to negotiate with Gustavo, but a shootout ensues with the security team Rita has hired to rescue Emilia. Emilia finally reveals her true identity to Jessi, recounting intimate details of their first meeting and their wedding day (\"Perdóname\"). Gustavo and a confused Jessi load Emilia into the trunk of Gustavo's car and drive off. As Jessi slowly realizes what has happened, she becomes guilt-ridden and orders Gustavo to pull over, holding him at gunpoint. As the two struggle for the gun, the car veers off the road, killing Gustavo, Jessi, and Emilia. Rita, devastated over Emilia's death, tells Jessi's children what has happened and offers to be their guardian. Epifanía marches in the street singing Emilia's eulogy and celebrating her fight for truth and freedom (\"Las damas que pasan\").",
  "wiki": "https://en.wikipedia.org/wiki/Emilia_P%C3%A9rez"
}