{
  "year": "2024",
  "name": "Nickel Boys",
  "plot": "In 1962 Jim Crow-era Tallahassee, Florida , young African-American Elwood Curtis appears destined for great things in the classroom. His Black teacher encourages him to think for himself, rejecting Southern textbooks' slanted view of history. However, Elwood is raised by his doting grandmother, whose father died in a prison cell under suspicious circumstances, and who worries that White society will retaliate against him if he participates in the growing Civil Rights Movement , which he does. Images of Martin Luther King , Sidney Poitier , and other civil rights icons are shown, and appear throughout the film, along with other montages, such as images of the U.S. space program. One day, Elwood is accepted into a tuition-free accelerated study program at an HBCU . While hitchhiking to campus, he is picked up by a man driving a stolen car. The police catch the man and convict Elwood of being his accomplice. Because Elwood is underage, he is sent to the Nickel Academy , a reform school . Nickel is internally segregated; White students enjoy comfortable accommodations and personal attention from staff, while Black students are housed in shabby facilities, and the school makes little attempt to educate them. Although Spencer, the White superintendent, tells the Black students that they can be released for good behavior, in practice they cannot leave until they turn eighteen, as the school makes money hiring them out as convict labor . (Spencer's wife shows Elwood some kindness, donating Pride and Prejudice and other books to the boys and allowing him to use her house's pool, but Elwood had to do free labor for her.) It is implied that some students are sexually abused. Elwood bonds with Turner, another quiet student. However, while Elwood is inspired by the non-violent and democratic ideals of the Civil Rights Movement, Turner is cynical, expects only mistreatment from society, and urges Elwood to keep his head down. Elwood is bullied and beaten by another student, but the administrators do not help him: instead, they savagely beat both students. Elwood's grandmother tries to visit him at Nickel but, on arrival, is not allowed to see him. She also scrimps and saves to hire a lawyer to appeal his conviction, but the lawyer runs away with her money, devastating Elwood. Spencer bets on Nickel's annual Black-White boxing match, but quietly executes a Black student who either refused or forgot to take a dive that Spencer told him to take. In flashforwards to 1988, the adult Elwood lives in New York City, where he runs his own moving business, and a former classmate, Chickie Pete, comes to him to remember old times and to ask him for work. Elwood does not appear to be in contact with Turner. In 2018, he is badly shaken after learning that many unmarked graves have been discovered at the old Nickel campus, and does research. Forensic evidence reveals that most of the dead students were Black. Back in the 1960s, Elwood, fed up with his mistreatment, takes his carefully kept diary of Nickel abuses and convinces a reluctant Turner to deliver it to a government inspector as an exposé. However, nothing happens, and the administrators retaliate by torturing Elwood in the school sweatbox . Turner learns that the school plans to kill Elwood and comes to rescue him. They attempt an escape, running away together on bicycles. However, pursued by a car from Nickel, they are quickly caught. Turner escapes into the woods, but Elwood is shot and killed. A montage shows that Turner safely reached Tallahassee, where he delivered the news of Elwood's death to his grandmother. He then moved North and took on Elwood's name. He marries Millie, builds a stable life, and tries to honor Elwood's legacy by embracing some of his ideals. When the government begins investigating the school, Turner decides to testify about his experiences.",
  "wiki": "https://en.wikipedia.org/wiki/Nickel_Boys"
}