{
  "year": "2024",
  "name": "The Brutalist",
  "plot": "Hungarian-Jewish Holocaust survivor and Bauhaus -trained architect László Tóth immigrates to the United States after being forcibly separated from his wife, Erzsébet, and orphaned niece, Zsófia. As his ship enters New York Harbor , he sees the Statue of Liberty . In 1947, László travels to Philadelphia and stays with his cousin, Attila. He discovers that Attila has assimilated , anglicizing his name and converting to Catholicism. Attila reveals to a relieved László that Erzsébet and Zsófia are still alive but stuck in Europe. He offers László work with his furniture business, and the two are soon approached by Harry Lee Van Buren, who wishes to surprise his father, wealthy industrialist Harrison Lee Van Buren, with a renovated library at his mansion near Doylestown, Pennsylvania . Following a drunken night of merriment, Attila's wife Audrey expresses her disdain for László and suggests he live elsewhere. Back at the mansion, Harrison is enraged by the surprise renovation and fires the men; Harry refuses to pay them. Attila blames László for the failed project, falsely accuses him of having made a pass at Audrey, and demands that he leave their home. Three years later, László, now a heroin addict, works as a laborer loading coal and lives in charity housing with his friend Gordon, an African-American single father. Harrison turns up to tell him the architectural community has lauded his modern library renovation, and that he has discovered László's past as an accomplished architect in Europe. He pays the money owed and invites László to a party, where he commissions a grand project in tribute to his late mother: The Van Buren Institute, a community center comprising a library, theater, gymnasium, and chapel. Work begins immediately with László living on site and employing Gordon. Harrison introduces László to his personal lawyer, who expedites the immigration of László's wife and niece. In 1953, László reunites with Erzsébet and Zsófia and discovers that as a result of their wartime suffering , Erzsébet is a full-time wheelchair user due to osteoporosis , and Zsófia is unable to speak . During construction, László clashes with contractors and consultants hired by Harrison, who depart from his design in an attempt to stay on budget. He agrees to work unpaid to make up for additional costs. Harry derides László as being merely \"tolerated\" and makes lewd remarks about Zsófia. Following the derailment of a train carrying materials and ensuing legal costs, a furious Harrison abandons the project and fires the workers. In 1958, László and Erzsébet have moved to New York City, where he works as a draftsman at an architecture firm, and she writes for a newspaper. Zsófia, having recovered her ability to speak, is expecting a child with her husband, Binyamin. They announce they are making Aliyah and moving to Jerusalem , much to the chagrin of László and Erzsébet. Harrison restarts the project and rehires László. While visiting Carrara to purchase marble , Harrison sodomizes an intoxicated László, calling him a societal leech whose people invite their own persecution. A traumatized László begins to unravel, becoming more belligerent and impulsively firing Gordon during an argument back on site. Recalling the prior contempt he received, he laments to Erzsébet that they are not welcome in America. After László almost kills Erzsébet by giving her heroin to soothe her pain, she proposes they move to Jerusalem and live with Zsófia, to which he agrees. Shortly afterwards, Erzsébet confronts Harrison at his home and calls him a rapist in front of his family and associates. An enraged Harry violently pushes her out, before his sister Maggie intervenes and helps her leave. Unable to find his father, Harry organizes a search party and tries to locate him within the institute. In 1980, Erzsébet has died, and a retrospective of László's work is held at the first Venice Biennale of Architecture . The exhibition showcases various projects built around the world in the ensuing years and includes the Van Buren Institute, finally completed in 1973. Zsófia, accompanied by her young adult daughter and an aging László in a wheelchair, gives a revelatory speech asserting that László designed spaces in the structure to resemble both Buchenwald and Dachau concentration camps. The structure, she implies, functions as a way of processing trauma. Zsófia ends her speech with a phrase she claims László used to tell her as a struggling young mother: \"No matter what the others try and sell you, it is the destination, not the journey.\"",
  "wiki": "https://en.wikipedia.org/wiki/The_Brutalist"
}