{
  "year": "2024",
  "name": "A Complete Unknown",
  "plot": "In 1961, Bob Dylan hitchhikes to New York City to meet his music idol, Woody Guthrie , who is dying slowly of Huntington's disease . Dylan meets Guthrie in the hospital with Guthrie's friend, the singer and activist Pete Seeger . Dylan performs a song he wrote for Guthrie , impressing Guthrie and Pete. Pete invites Dylan to stay with his family, introducing him to New York City's folk scene. Following a performance by Joan Baez , Pete introduces Dylan at an open mic night attended by industry executives. Dylan flirts with Baez and impresses the crowd, prompting the music manager Albert Grossman to take him on as a client. Dylan begins work on an album but is forced by his label to record mostly covers and traditional songs. The record's sales are poor, frustrating Dylan. Dylan meets Sylvie Russo at a concert, charming her with his contrarian opinions and tales of working at a carnival. The two begin a relationship, and he moves into her apartment. Before leaving on a lengthy school trip to Europe, they argue; Sylvie is upset by his aloof nature and attempt to conceal his past from her. Despite this, she encourages him to push for recording his original music. Influenced by political and social unrest, Dylan produces a series of socially conscious songs. This draws Baez's attention, and they begin an affair and collaboration. By 1965, Sylvie and Dylan have separated. Having achieved fame but not artistic freedom, Dylan laments that he is beholden to the expectations of the industry and fans. On tour with Baez, Dylan and Baez argue over his ego and his refusal to play his popular songs instead of new material, and Dylan walks offstage mid-performance. Dylan experiments with electric guitar and rock instruments, a controversial direction within the folk scene . He pieces together his band and begins recording Highway 61 Revisited . Dylan's new direction concerns the planning committee for the upcoming 1965 Newport Folk Festival , as they hired him to headline the event. Dylan brings Sylvie to the festival, hoping to rekindle his relationship with her. Upon watching Dylan duet with Baez on \" It Ain't Me Babe \", Sylvie realizes she will never be comfortable in their relationship and says goodbye. The committee demands Dylan play only folk music, and Pete reminds Dylan that his own life's work is on the line. An intoxicated Johnny Cash encourages Dylan to play the electric show, and Dylan goes through with his plan. The crowd reacts with vitriol. The committee, including Pete, attempts to cut the sound, but is stopped by Grossman and Pete's wife, Toshi . Dylan refuses a request from the festival organizers to perform a folk song as an encore, but relents when Cash offers him his acoustic guitar. The next morning, on his way out from Newport, Baez catches Dylan and remarks that he has won the freedom he wanted. Dylan visits Guthrie and listens to a recording of one of Woody's songs before leaving town on his motorcycle.",
  "wiki": "https://en.wikipedia.org/wiki/A_Complete_Unknown"
}